{"collection":[{"query":"Cơ sở dữ liệu","description":"Muốn tìm hiểu về các loại CSDL, các câu truy vấn, tối ưu hóa truy vấn","sites":[{"title":"Tìm hiểu về cấu trúc của cơ sở dữ liệu Access - Access","url":"https:\/\/support.office.com\/vi-vn\/article\/T%C3%ACm-hi%E1%BB%83u-v%E1%BB%81-c%E1%BA%A5u-tr%C3%BAc-c%E1%BB%A7a-c%C6%A1-s%E1%BB%9F-d%E1%BB%AF-li%E1%BB%87u-Access-001a5c05-3fea-48f1-90a0-cccaa57ba4af","content":"Thử dùng Microsoft Edge một trình duyệt nhanh và bảo mật được thiết kế cho Windows 10 Không, cảm ơn Bắt đầu Quan trọng:  Bài viết này là dịch máy, hãy xem tuyên bố miễn trừ trách nhiệm. Bạn hãy tìm phiên bản tiếng Anh của bài viết này tại đây để tham khảo. Việc làm quen với các bảng, biểu mẫu, truy vấn và đối tượng khác trong cơ sở dữ liệu có thể làm cho việc thực hiện nhiều tác vụ, chẳng hạn như nhập dữ liệu vào biểu mẫu, thêm hoặc loại bỏ các bảng, tìm và thay thế dữ liệu, cũng như chạy truy vấn trở nên dễ dàng hơn. Bài viết này cung cấp một cái nhìn tổng quan cơ bản về cấu trúc của cơ sở dữ liệu Access. Access cung cấp một số công cụ bạn có thể sử dụng để tự làm quen với cấu trúc của một cơ sở dữ liệu cụ thể. Bài viết này cũng giải thích cách thức, thời điểm và lý do bạn sử dụng từng công cụ. Ghi chú: Bài viết này nói về cơ sở dữ liệu truyền thống của Access, bao gồm tệp hoặc tập hợp các tệp chứa mọi tính năng của dữ liệu và ứng dụng, chẳng hạn như biểu mẫu mục nhập dữ liệu. Một số cơ sở dữ liệu trong số đó không áp dụng cho cơ sở dữ liệu web, một loại cơ sở dữ liệu mới của Access mà bạn phát hành lên web bằng SharePoint Server với Access Services. Để biết thêm thông tin về cơ sở dữ liệu web, xem bài viết Xây dựng cơ sở dữ liệu để chia sẻ trên Web. Tổng quan Xem chi tiết về các đối tượng trong cơ sở dữ liệu Khám phá một bảng trong cửa sổ Thiết kế Xem mối quan hệ giữa các bảng Xem cách đối tượng sử dụng các đối tượng khác Cơ sở dữ liệu là một tập hợp các thông tin liên quan đến một chủ đề hoặc mục đích cụ thể, như theo dõi đơn hàng của khách hàng hoặc duy trì bộ sưu tập nhạc. Nếu cơ sở dữ liệu của bạn không được lưu trữ trên máy tính hoặc chỉ các phần của cơ sở dữ liệu được lưu trữ, bạn có thể theo dõi thông tin từ nhiều nguồn khác nhau mà bạn phải điều phối và sắp xếp. Ví dụ: giả sử số điện thoại từ nhà cung cấp của bạn được lưu trữ tại các vị trí khác nhau: trong tệp thẻ chứa số điện thoại của nhà cung cấp, trong tệp thông tin sản phẩm ở tập tin nén và trong bảng tính chứa thông tin đơn hàng. Nếu số điện thoại của nhà cung cấp thay đổi, bạn có thể sẽ phải cập nhật thông tin đó trong cả ba vị trí. Trong cơ sở dữ liệu được thiết kế đẹp của Access, số điện thoại chỉ được lưu trữ một lần, vì vậy, bạn chỉ phải cập nhật thông tin đó trong một vị trí. Do đó, khi bạn cập nhật số điện thoại của nhà cung cấp, số điện thoại sẽ tự động cập nhật vào mọi lúc bạn sử dụng ở cơ sở dữ liệu. Bạn có thể sử dụng Access để quản lý tất cả các thông tin của mình trong một tệp. Trong tệp cơ sở dữ liệu Access, bạn có thể sử dụng: Bảng để lưu trữ dữ liệu của bạn. Truy vấn để chỉ tìm và truy xuất những dữ liệu bạn muốn. Biểu mẫu để xem, thêm và cập nhật dữ liệu trong bảng. Báo cáo để phân tích hoặc in dữ liệu trong một bố trí cụ thể.  1. Lưu trữ dữ liệu một lần trong một bảng nhưng xem dữ liệu từ nhiều vị trí. Khi bạn cập nhật dữ liệu, dữ liệu sẽ tự động cập nhật ở mọi nơi dữ liệu xuất hiện. 2. Truy xuất dữ liệu bằng truy vấn. 3. Xem hoặc nhập dữ liệu bằng cách sử dụng biểu mẫu. 4. Hiển thị hoặc in dữ liệu bằng cách sử dụng báo cáo. Tất cả các mục — bảng, truy vấn, biểu mẫu và báo cáo — đều là đối tượng cơ sở dữ liệu. Ghi chú: Một số cơ sở dữ liệu Access chứa liên kết đến các bảng được lưu trữ trong cơ sở dữ liệu khác. Ví dụ: bạn có thể có một cơ sở dữ liệu Access không chứa gì ngoài bảng và một cơ sở dữ liệu Access khác chứa liên kết đến các bảng đó cũng như truy vấn, biểu mẫu và báo cáo dựa trên các bảng được liên kết. Trong hầu hết các trường hợp, việc một bảng là bảng liên kết hay được lưu trữ thực sự trong cơ sở dữ liệu là điều không quan trọng lắm. Để lưu trữ dữ liệu, bạn hãy tạo một bảng cho từng loại thông tin bạn theo dõi. Các loại thông tin có thể bao gồm thông tin khách hàng, sản phẩm và chi tiết đơn hàng. Để đưa dữ liệu từ nhiều bảng cùng vào một truy vấn, biểu mẫu hoặc báo cáo, bạn cần xác định mối quan hệ giữa các bảng. Ghi chú: Trong cơ sở dữ liệu web, bạn không thể sử dụng tab đối tượng Mối quan hệ để tạo mối quan hệ. Bạn có thể sử dụng trường tra cứu để tạo mối quan hệ trong cơ sở dữ liệu web.  1. Thông tin khách hàng đã có trong danh sách gửi thư giờ sẽ có trong bảng Khách hàng. 2. Thông tin đơn hàng đã có trong bảng tính giờ sẽ có trong bảng Đơn hàng. 3. Một ID duy nhất, như ID Khách hàng, phân biệt một bản ghi với một bản ghi khác trong bảng. Bằng cách thêm trường ID duy nhất của một bảng vào một bảng khác và xác định mối quan hệ giữa hai trường, Access có thể khớp các bản ghi liên quan từ cả hai bảng để bạn có thể đưa các bản ghi đó cùng vào một biểu mẫu, báo cáo hoặc truy vấn. Truy vấn có thể giúp bạn tìm và truy xuất dữ liệu đáp ứng các điều kiện mà bạn chỉ định — bao gồm dữ liệu từ nhiều bảng. Bạn cũng có thể sử dụng truy vấn để cập nhật hoặc xóa nhiều bản ghi cùng một lúc, đồng thời, thực hiện tính toán được xác định trước hoặc tùy chỉnh trên dữ liệu của mình. Ghi chú: Bạn không thể sử dụng truy vấn để cập nhật hoặc xóa các bản ghi trong cơ sở dữ liệu web.  1. Bảng Khách hàng có các thông tin về khách hàng. 2. Bảng Khách hàng có các thông tin về đơn hàng của khách hàng. 3. Truy vấn này truy xuất dữ liệu ID Đơn hàng và Ngày Bắt buộc từ bảng Đơn hàng, cùng dữ liệu Tên Công ty và Thành phố từ bảng Khách hàng. Truy vấn chỉ trả về những đơn hàng được yêu cầu trong Tháng Tư và chỉ dành cho khách hàng tại London. Bạn có thể sử dụng biểu mẫu để xem, nhập và thay đổi dữ liệu mỗi lúc một hàng. Bạn cũng có thể sử dụng biểu mẫu để thực hiện các hành động khác, như gửi dữ liệu tới ứng dụng khác. Biểu mẫu thường chứa các điều khiển được liên kết với trường cơ sở trong bảng. Khi bạn mở biểu mẫu, Acce","relevance":1},{"title":"Cơ sở dữ liệu Quốc gia Văn bản quy phạm pháp luật","url":"http:\/\/vbpl.vn\/pages\/portal.aspx","content":"CƠ SỞ DỮ LIỆU QUỐC GIA VỀ VĂN BẢN PHÁP LUẬT  ","relevance":1},{"title":"Giáo trình môn cơ sở dữ liệu","url":"http:\/\/giasutinhoc.vn\/co-so-du-lieu\/giao-trinh-mon-co-so-du-lieu\/","content":"Giáo trình môn cơ sở dữ liệu cung cấp cho người học: Yêu cầu đối với môn học cơ sở dữ liệu:  Bổ ích Bạn phải đăng nhập để gửi phản hồi.","relevance":1},{"title":"Tìm hiểu cơ sở dữ liệu là gì? và hệ quản trị CSDL MYSQL","url":"https:\/\/freetuts.net\/tim-hieu-co-so-du-lieu-la-gi-va-he-quan-tri-csdl-mysql-168.html","content":"Lưu trữ thông tin là nhu cầu rất thông dụng trong cuộc sống của con người. Từ thời xa xưa con người đã biết sử dụng những vật dụng có sẵn để lưu trữ thông tin như in hình lên đá, in lên các gốc cây, thanh gỗ. Nhưng với công nghệ 2014 này thì việc lưu trữ đó đã trở nên quá lỗi thời. Thay vào đó công nghệ thông tin phát triển, người người đều có khả năng mua máy tính và lưu trữ thông tin trên máy tính. Tuy nhiên mặt nào cũng có những ưu và nhược điểm cả, nên để rõ ràng hơn ta sẽ tìm hiểu những cách lưu trữ thông thường đã nhé. Ví dụ hệ thống tập tin dữ liệu quản lý web project Khi sử dụng máy tính thông thường ta sẽ lưu trữ thông tin dưới dạng file, và mỗi file ta sẽ đặt nó trong những folder có tên khác nhau nhằm mục đích dễ dàng tìm đến. Với cách này ta sẽ có những ưu điểm và nhược điểm như sau: Ưu điểm: Khuyết điểm: Hiện nay các cá nhân sử dụng máy tính đa số sử dụng cách lưu trữ này để lưu trữ thông tin cho riêng mình, nên nói về sự phổ biến thì cách này phổ biến nhất, tuy nhiên với những hệ thống dữ liệu lớn thì sẽ có rất nhiều hạn chế như việc truy xuất tìm kiếm dữ liệu sẽ chậm, khó bảo quản,...  Với những hạn chế trên thì khái niệm cơ sở dữ liệu và hệ quản trị cơ sở dữ liệu được ra đời. Cơ sở dữ liệu là một hệ thống các thông tin có cấu trúc, được lưu trữ trên các thiết bị lưu trữ nhằm thõa mãn yêu cầu khai thác thông tin đồng thời của nhiều người sử dụng hay nhiều chương trình ứng dụng chạy cùng một lúc với những mục đích khác nhau. Việc sử dụng hệ thống CSDL này sẽ khắc phục được những khuyết điểm của cách lưu trữ dươi dạng hệ thống tập tin, đó là: Tuy nhiên việc sử dụng hệ quản trị CSDL lại có những phiền hà không hề nhỏ sau đây: Trong cuộc sống hằng ngày chắc hẳn bạn có sử dụng qua các hệ thống CSDL nhưng bạn lại không biết. Chẳng hạng hằng ngày bạn vào đọc bài tin tức từ các trang báo, ở mỗi trang họ có dùng một hệ thống lưu trữ dữ liệu và khi bạn vào xem hệ thống sẽ trả dữ liệu về màn hình trình duyệt cho bạn xem. Rõ ràng bạn có thể truy cập một lúc nhiều trang và nhiều người có thể đọc một trang cùng một lúc được, nhưng vẫn đảm bảo tính toàn vẹn dữ liệu không bị sai lệch. Đương nhiên khi sử dụng các hệ thống CSDL thì bạn phải có một hệ quản trị CSDL. Hiện nay có rất nhiều hệ quản trị CSDL như MYSQL, SQL SERVER, Oracle, MS Access.Trong loạt serie này ta sẽ tìm hiểu hệ quản trị CSDL MYSQL. Hình ảnh hệ quản trị CSDL MYSQL Mysql là một hệ quản trị CSDL được sử dụng rất rộng rãi trên thế giới, đặc biệt là các ứng dụng website và nó thường đi kết hợp với ngôn ngữ lập trình PHP để xây dựng các ứng dụng website. Các hệ thống web ưa chuộng MYSQL là tại vì tốc độ xử lý của nó cao, tính dễ sử dụng và thương thích với các hệ điều hành thông dụng hiện nay như Linix, Window, ... Mysql có sử dụng ngôn ngữ truy vấn T-SQL để thao tác dữ liệu. Hiện nay đang đình đám các hệ quản trị CSDL với tên gọi NO-SQL, nghĩa là hệ quản trị không sử dụng ngôn ngữ có cấu trúc truy vấn (T-SQL), vì thế trong tương lại không biết MYSQL liệu có bị tiêu diệt hay không? Khi học lập trình PHP và MYSQL bạn sẽ có nguồn tài liệu rất phong phú và đa dạng, vì thế nếu bạn chọn hướng đi này thì không phải lo đội ngũ support miễn phí (Google) . Trong serie này mình sẽ tập trung viết các bài về lập trình cơ sở dữ liệu MYSQL, chúng ta sẽ đi từ cơ bản đến nâng cao, đi từ người chưa biết gì cho đến một người trưởng thành, nắm bắt các khái niệm trigger, store, view, ... , các mô hình thiết kế CSDL thông dụng và kinh nghiệp phân tích thiết kế hệ thống thông tin. Mời các bạn theo dõi ... Nguồn: freetuts.net Bạn đang có nhu cầu học thiết kế cho công việc, cho đam mê thì trong khóa học Photoshop - Illustrator - animate 2017 này sẽ giúp bạn có kiến thức tổng quát, căn bản nhất để có thể làm những sản phẩm vừa tầm cho người không chuyên. Kể từ khi Angular2 ra đời thì TypeScript cũng được phát triển khá mạnh bởi framework cho phép sử dụng typescript để làm việc, dĩ nhiên điều này quá bình thường bởi cả 2 mã nguồn này đều được phát triển bởi google và hoàn toàn miễn phí. Hiện nay trên mạng có rất nhiều khóa học lập trình Javascript nhưng để tìm một khóa học chất lượng mà giá lại rẻ thì rất khó, vì vậy hôm nay mình sẽ review khóa học Javascript tại Fedu để các bạn tham khảo nhé.  Freetuts.net là một blog cá nhân được thành lập vào năm 2014, tại đây bạn sẽ tìm thấy các bài viết về lập trình nói chung và lĩnh vực lập trình web nói riêng. 2016 Powered By GoodNews, Theme By Momizat Team - Benchmark: 0.0087","relevance":1},{"title":"Sách Cơ sở dữ liệu | Vinabook.com","url":"https:\/\/www.vinabook.com\/c399\/co-so-du-lieu\/","content":"Chưa có tài khoản vui lòng ĐĂNG KÝ Giỏ hàng rỗng Cơ Sở Dữ Liệu Mờ Và Xác Xuất Nguyễn Hoà Phân Tích Dữ Liệu Với R Nguyễn Văn Tuấn Nhập Môn Cơ Sở Dữ Liệu Andrew J. (Andy) Oppel Microsoft SQL Server 2008 - Quản Trị Cơ Sở Dữ Liệu (Tập 2) Phạm Hữu Khang (Chủ Biên) Xây Dựng Báo Biểu Bằng SQL Report Service 2008 (Kèm 1 Đĩa CD) Nguyễn Ngọc Quyên Cơ Sở Dữ Liệu Mờ Và Xác Xuất Nguyễn Hoà Hướng Dẫn Xử Lý Những Vấn Đề Phiền Toái Thường Xảy Ra Khi Sử Dụng Powerpoint KS.Nguyễn Nam Thuận Phân Tích Dữ Liệu Với R Nguyễn Văn Tuấn Giáo Trình Học Nhanh SQL Server 2008 - Tập 2 Trịnh Thế Tiến Nhập Môn Cơ Sở Dữ Liệu Andrew J. (Andy) Oppel Microsoft SQL Server 2008 - Quản Trị Cơ Sở Dữ Liệu (Tập 2) Phạm Hữu Khang (Chủ Biên) Xây Dựng Báo Biểu Bằng SQL Report Service 2008 (Kèm 1 Đĩa CD) Nguyễn Ngọc Quyên Làm Kỹ Xảo Hình Và Tiếng Với Canopus, Boris Red, Premiere (Kèm Đĩa CD) Nhiều Tác Giả Dạy Học Trực Tuyến Và Soạn Sách Điện Tử Với Macromedia Captivate (Kèm 1 Đĩa CD) Nhiều Tác Giả Cách Bảo Vệ Dữ Liệu Quan Trọng Và Phương Pháp Phát Hiện Thâm Nhập - Từng Bước Khám Phá An Ninh Mạng Vũ Đình Cường Microsoft SQL Server 2008 - Quản Trị Cơ Sở Dữ Liệu (Tập 1) Phạm Hữu Khang Dạy Học Trực Tuyến & Soạn Sách Điện Tử Với Toolbook Assistant & Instructor (Kèm 2 CD) Phan Long Gis Và Viễn Thám Trong Quản Lý Tài Nguyên Rừng Và Môi Trường Bảo Huy Các Cơ Sở Dữ Liệu Microsoft Visual C# 2008 - Lập Trình Căn Bản Và Nâng Cao Trịnh Thế Tiến Phân Tích Và Thiết Kế Hệ Thống Thông Tin Quản Trị Xí Nghiệp Toàn Tập - Tập 5: Nhập Liệu Và Kiểm Tra Hợp Lệ Viết theo C#.NET Dương Quang Thiện Giáo Trình Nhập Môn Hệ Cơ Sở Dữ Liệu Nguyễn Tuệ Giáo Trình Hướng Dẫn Lý Thuyết Kèm Theo Bài Tập Thực Hành Oracle 11g (Dành Cho Học Sinh, Sinh Viên) - Tập 2 Nguyễn Quảng Ninh Giáo Trình Học Nhanh SQL Server 2008 - Tập 1 Trịnh Thế Tiến Tập Làm Quen Quản Lý Cơ Sở Dữ Liệu Hiệu Quả Nhất - Giáo Trình Cầm Tay Chỉ Việc Trương Thanh Hải Giáo Trình Phân Tích Hệ Thống Hướng Đối Tượng Với UML Dương Kiều Hoa Lý Thuyết Cơ Sở Dữ Liệu - Tập 2 Nguyễn Thị Ngọc Mai Lý Thuyết Cơ Sở Dữ Liệu - Tập 1 Nguyễn Thị Ngọc Mai Tự Học Kế Toán Hàng Tồn Kho C#2005 Phan Hoàng Làm Quen với SQL Server 2000 Đào Thị Minh Nguyệt Lập Trình Cơ Sở Dữ Liệu Với Visual Basic 2005 Và ADO.Net 2.0 (Có CD Kèm Theo Sách) Nguyễn Thiên Băng ISA Server 2004 - Tường Lửa Siêu Cấp Nguyễn Tấn Phát Quản Lý Đĩa Cứng Và Dữ Liệu (Dùng Kèm Đĩa) Đinh Phan Chí Tâm Phân Tích Và Thiết Kế Hệ Thống Thông Tin Quản Trị Xí Nghiệp Toàn Tập SQL Server 2000 Lập Trình T - SQL (Tập 6B) Dương Quang Thiện Tự Học Visual FoxPro Và Visual Basic.Net Trong 10 Ngày Nguyễn Nam Thuận Tự Học Microsoft Office Access 2003 trong 24 Giờ Kỹ Sư Ngọc Hoà CÔNG TY CỔ PHẦN THƯƠNG MẠI DỊCH VỤ MÊ KÔNG COM Địa chỉ: 292A Hòa Bình, Phường Hiệp Tân, Quận Tân Phú, Tp. Hồ Chí Minh MST: 0303615027 do Sở Kế Hoạch Và Đầu Tư Tp.HCM cấp ngày 10\/03\/2011 Tel: 08.73008182 - Fax: 08.39733234 - Email: hotro@vinabook.com","relevance":1},{"title":"Cơ sở dữ liệu","url":"http:\/\/www.vista.gov.vn\/Default.aspx?tabid=145&language=vi-VN","content":"CSDL Tài liệu KH&CN Việt Nam STD là cơ sở dữ liệu toàn văn lớn nhất Việt Nam về tài liệu đăng tải trên các tạp chí KH&CN Việt Nam, trên các kỷ yếu hội nghị, hội thảo KH&CN. CSDL được Cục Thông tin KH&CN Quốc gia xây dựng và cập nhật từ năm 1987. Đến cuối năm 2013, STD có trên 170.000 biểu ghi, trong đó hơn 90.000 biểu ghi có đính kèm tài liệu gốc định dạng tệp PDF. Trung bình mỗi năm, STD được cập nhật thêm khoảng 12.000 tài liệu mới    CSDL Nhiệm vụ khoa học và công nghệ Việt Nam Cơ sở dữ liệu (CSDL) nhiệm vụ khoa học và công nghệ Việt Nam là CSDL thư mục lớn nhất Việt Nam về các nhiệm vụ khoa học và công nghệ bao gồm CSDL các nhiệm vụ khoa học và công nghệ đang tiến hành và CSDL các kết quả thực hiện nhiệm vụ khoa học và công nghệ. CSDL các nhiệm vụ khoa học và công nghệ đang tiến hành là CSDL các nhiệm vụ khoa học và công nghệ đang triển khai thực hiện trong thực tế tính tại thời điểm cung cấp thông tin. Đến cuối năm 2015, CSDL các nhiệm vụ khoa học và công nghệ đang tiến hành có trên 3.500 biểu ghi. CSDL các kết quả thực hiện nhiệm vụ khoa học và công nghệ là CSDL về kết quả thu được từ hoạt động nghiên cứu khoa học và phát triển công nghệ của nhiệm vụ khoa học và công nghệ, bao gồm: báo cáo tổng hợp kết quả thực hiện nhiệm vụ, báo cáo tóm tắt kết quả thực hiện nhiệm vụ; phụ lục tổng hợp các số liệu điều tra, khảo sát, bản đồ, bản vẽ, ảnh, tài liệu đa phương tiện; phần mềm được đăng ký và giao nộp tại Cục Thông tin KH&CN Quốc gia. CSDL có trên 20.000 biểu ghi mô tả thư mục và tóm tắt; được cập nhật khoảng 1200-1500 nhiệm vụ\/năm. Sử dụng cơ sở dữ liệu này, bạn đọc có thể biết các thông tin chi tiết về chủ nhiệm và các cán bộ tham gia đề tài nghiên cứu, cơ quan chủ trì và tóm tắt các kết quả chủ yếu của đề tài.    ","relevance":1},{"title":"Bài 10: Cơ sở dữ liệu quan hệ - Tin học 12 - Hoc247.net","url":"http:\/\/hoc247.net\/tin-hoc-12\/bai-10-co-so-du-lieu-quan-he-l6294.html","content":"Nội dung của Bài 10: Cơ sở dữ liệu quan hệ dưới đây, các em sẽ được tìm hiểu về khái niệm mô hình dữ liệu quan hệ và các đặc trưng cơ bản của mô hình này; khái niệm CSDL quan hệ, khóa và liên kết giữa các bảng. Mời các em cùng theo dõi nội dung chi tiết của bài học. Mô hình dữ liệu là một tập khái niệm dùng để mô tả cấu trúc dữ liệu, các thao tác dữ liệu, các ràng buộc dữ liệu của một CSDL. Theo các mức mô tả chi tiết về CSDL, có thể phân chia các mô hình dữ liệu thành hai loại: Có nhiều mô hình dữ liệu bậc cao nhưng ở đây ta chỉ đề cập đến mô hình dữ liệu quan hệ vì cho đến nay đó là mô hình phổ biến nhất trong thực tế xây dựng các ứng dụng CSDL.  Mô hình dữ liệu quan hệ (gọi tắt là mô hình quan hệ) được  E. F. Codd đề xuất năm 1970. Trong khoảng ba mươi năm trở lại đây, các hệ CSDL xây dựng theo mô hình quan hệ được dùng rất phổ biến. Trong mô hình quan hệ: Một quan hệ trong hệ CSDL quan hệ có các đặc trưng chính sau: Thuộc tính đa trị: 1 thuộc tính tương ứng trong nhiều bộ giá trị; Phức hợp: Một thuộc tính có 2 giá trị. Lưu ý: Chú ý: Thực chất sự liên kết giữa các bảng là dựa trên thuộc tính khóa. Chỉ ra các điều kiện trong mô hình dữ liệu quan hệ Ql_hoctap  Hình 1. Mô hình dữ liệu quan hệ Ql_hoctap Gợi ý trả lời: Trong CSDL quan hệ Ql_hoctap ở ví dụ trên (ví dụ 1), xác định quan hệ, thuộc tính và bộ. Gợi ý trả lời: Trong CSDL quan hệ Ql_thuvien dưới đây, xác định thuộc tính đa trị và phức hợp.  Hình 2. Cơ sở dữ liệu quan hệ Ql_thuvien Gợi ý trả lời: TO-012 5\/9\/07 24\/9\/07 30\/9\/07 5\/10\/07 Bảng 1. Bảng có thuộc tính đa trị Vì giá trị Số thẻ TV_02 có 2 bộ giá trị Bảng có thuộc tính phức hợp Bảng 2. Bảng có thuộc tính phức hợp Ngày mượn trả có 2 cột Ngày mượn và Ngày trả. Sau khi học xong Bài 10: Cơ sở dữ liệu quan hệ, các em cần nắm vững các nội dung trọn tâm: Nhằm giúp các em củng cố lại các kiến thức đã học, trong phần sau là các câu hỏi Trắc nghiệm Tin học 12 Bài 10 Cơ sở dữ liệu quan hệ các em hãy cùng thử sức để tự đánh giá xem mức độ hiểu bài của bản thân mình tới đâu các em nhé. Ngoài ra, các câu hỏi trong sách giáo khoa trang 86 môn Tin học lớp 12 đều được gợi ý trả lời chi tiết và dễ hiểu trong phần Giải bài tập Tin học 12 Bài 10. Nếu có thắc mắc về nội dung bài học thì các em vui lòng đặt câu hỏi trong phần Hỏi đáp để được hỗ trợ. Các em quan tâm có thể tham khảo thêm bài học trước và bài học sau: >> Bài trước: Bài tập và thực hành 9: Bài thực hành tổng hợp >> Bài sau: Bài 11: Các thao tác với cơ sở dữ liệu quan hệ Chúc các em học tốt! -- Mod Tin Học 12 HỌC247 682 lượt xem 387 lượt xem 121 lượt xem 309 lượt xem 576 lượt xem 365 lượt xem Thông báo Bạn vui lòng đăng nhập trước khi sử dụng chức năng này. Thông báo Bạn vui lòng đăng nhập trước khi sử dụng chức năng này.","relevance":1},{"title":"Bài 2: Các khái niệm trong CSDL quan hệ - Giáo trình FPT","url":"https:\/\/www.slideshare.net\/tuoitrecomvn\/slide-02-23857249","content":"Slideshare uses cookies to improve functionality and performance, and to provide you with relevant advertising. If you continue browsing the site, you agree to the use of cookies on this website. See our User Agreement and Privacy Policy. Slideshare uses cookies to improve functionality and performance, and to provide you with relevant advertising. If you continue browsing the site, you agree to the use of cookies on this website. See our Privacy Policy and User Agreement for details. Published on Jul 3, 2013 Tìm hiểu các bước thiết kế CSDL quan hệ Tìm hiểu các khái niệm trong thiết kế CSDL quan hệ: Các khái niệm trong thiết kế CSDL mức khái niệm Các khái niệm trong thiết kế CSDL mức vật lý Làm quen với hệ quản trị CSDL Microsoft Access Tạo các bảng và truy vấn trong Microsoft Access. LinkedIn Corporation © 2017   Clipping is a handy way to collect and organize the most important slides from a presentation. You can keep your great finds in clipboards organized around topics. Looks like you’ve clipped this slide to already.","relevance":1},{"title":"Bài 10: Cơ sở dữ liệu quan hệ | Học trực tuyến","url":"https:\/\/hoc24.vn\/ly-thuyet\/bai-10-co-so-du-lieu-quan-he.3273\/","content":"BÀI 10: CƠ SỞ DỮ LIỆU QUAN HỆ - Mô hình dữ liệu là một tập hợp các khái niệm, dùng để mô tả CTDL, các thao tác dữ liệu, các ràng buộc dữ liệu của một CSDL - Các loại mô hình dữ liệu: - Mô hình dữ liệu quan hệ được E.F.Codd đề xuất năm 1970. Trong khoảng 20 năm trở lại đây các hệ CSDL theo mô hình quan hệ được dùng rất phổ biến. - Trong mô hình quan hệ: - CSDL quan hệ: CSDL được xây dựng trên mô hình dữ liệu quan hệ. - Hệ QTCSDL quan hệ : Hệ QTCSDL quan hệ dùng để tạo lập, cập nhật và khai thác CSDL quan hệ. - Những đặc trưng của CSDL quan hệ: - Để quản lý học sinh mượn sách ở một trường học, thông thường quản lí các thông tin sau:   - Khóa: Khóa của một bảng là một tập gồm một hay một số thuộc tính của bảng phân biệt được các cá thể. - Khoá chính: * Chú ý: - Liên kết: Thực chất sự liên kết giữa các bảng là dựa trên thuộc tính khóa. Chẳng hạn thuộc tính số thẻ là khóa của bảng người mượn xuất hiện lại ở bảng mượn sách đó tạo nên liên kết giữa 2 bảng này.  Tính năng này đang được xây dựng... © 2014-2017 Công ty Cổ phần Khoa học và Công nghệ giáo dục + Giấy phép kinh doanh: 0106303886 + Địa chỉ: Số 12, Ngõ 156, Nguyễn Đổng Chi, phường Cầu Diễn, Nam Từ Liêm, Hà Nội + Người đại diện: Hà Đức Thọ - Hotline: 0986 557 525 - Email: hdtho@hoc24.vn","relevance":1},{"title":"Mô hình quan hệ - thực thể (Entity – Relationship Model) - Viblo","url":"https:\/\/viblo.asia\/p\/mo-hinh-quan-he-thuc-the-entity-relationship-model-oOVlYEenl8W","content":"Marked as Trending on 2017-10-16 19:50:02 Mô hình quan hệ thực thể (Entity Relationship model - E-R) được CHEN giới thiệu vào năm 1976 là một mô hình được sử dụng rộng rãi trong các bản thiết kế cơ sở dữ liệu ở mức khái niệm, được xây dựng dựa trên việc nhận thức thế giới thực thông qua tập các đối tượng được gọi là các thực thể và các mối quan hệ giữa các đối tượng này. So với mô hình mạng thì mô hình quan hệ thực thể có nhiều ưu điểm hơn và nó thể hiện rõ hơn các thành phần trong thế giới thực. Nếu như mô hình mạng chỉ biểu diễn các đối tượng chính chứ không mô tả được các đặc điểm trong đối tượng đó thì trong mô hình quan hệ thực thể lại khắc phục được những điểm yếu này. Chính vì vậy việc lựa chọn mô hình này luôn là quyết định của các nhà phân tích thiết kế cơ sở dữ liệu 1 - Vai trò của mô hình E-R trong quá trình thiết kế cơ sở dữ liệu: Mục tiêu của mô hình E-R trong quá trình thiết kế cơ sở dữ liệu đó là phân tích dữ liệu, xác định các đơn vị thông tin cơ bản cần thiết của tổ chức, mô tả cấu trúc và mối liên hệ giữa chúng  E-R là mô hình trung gian để chuyển những yêu cầu quản lý dữ liệu trong thế giới thực thành mô hình cơ sở dữ liệu quan hệ 2 - Các thành phần cơ bản của mô hình E-R a - Thực thể và tập thực thể Thực thể là một đối tượng trong thế giới thực. Một nhóm bao gồm các thực thể tương tự nhau tạo thành một tập thực thể Việc lựa chọn các tập thực thể là một bước vô cùng quan trọng trong việc xây dựng sơ đồ về mối quan hệ thực thể Ví dụ: “Quản lý các dự án của công ty” b - Thuộc tính: Mỗi tập thực thể có một tập các tính chất đặc trưng, mỗi tính chất đặc trưng này gọi là thuộc tính của tập thực thể. Ứng với mỗi thuộc tính có một tập các giá trị cho thuộc tính đó gọi là miền giá trị. Miền giá trị của thuộc tính gồm các loại giá trị như sau: Ví dụ tập thực thể NHANVIEN có các thuộc tính Thuộc tính bao gồm các loại như sau: Các loại giá trị của thuộc tính: Mỗi thực thể đều được phân biệt bởi thuộc tính khóa Ví dụ 1: tập thực thể NHANVIEN có các thuộc tính Ví dụ 2:  Ví dụ 3:  c - Mối quan hệ giữa các tập thực thể: Quan hệ là sự liên kết giữa hai hay nhiều tập thực thể Ví dụ giữa tập thực thể NHANVIEN và PHONGBAN có các liên kết như sau: Tập quan hệ là tập hợp các mối quan hệ giống nhau d - Lược đồ E-R: Là đồ thị biểu diễn các tập thực thể, thuộc tính và mối quan hệ Các ký hiệu trong lược đồ E-R  Ví dụ lược đồ E-R:  e - Các kiểu liên kết trong lược đồ E-R:  Ví dụ:     Một loại thực thể có thể tham gia nhiều lần vào một quan hệ với nhiều vai trò khác nhau  f - Thuộc tính khóa: Mỗi tập thực thể phải có 1 khóa Một khóa có thể có 1 hay nhiều thuộc tính Có thể có nhiều khóa trong 1 tập thực thể, ta sẽ chọn ra 1 khóa làm khóa chính cho tập thực thể đó 3 - Xây dựng mô hình E-R a - Quy tắc: b - Các bước xây dựng: c - Ví dụ: Ví dụ 1: Xây dựng mô hình E-R cho cơ sở dữ liệu quản lý đơn đặt hàng với các thông tin như sau:  Bước 1: Liệt kê, chọn lọc thông tin: -- Đơn đặt hàng gồm những thông tin như sau: -- Phiếu giao hàng gồm những thông tin như sau: Bước 2: Xác định thực thể, thuộc tính: -- Thực thể ĐƠN VỊ ĐH gồm các thuộc tính sau: -- Thực thể ĐƠN VỊ KH gồm các thuộc tính sau: -- Thực thể HÀNG gồm các thuộc tính sau: -- Thực thể NGƯỜI ĐẶT gồm các thuộc tính sau: -- Thực thể NƠI GIAO gồm các thuộc tính sau: -- Thực thể NGƯỜI NHẬN gồm các thuộc tính sau: -- Thực thể NGƯỜI GIAO gồm các thuộc tính sau: Bước 3: Xác định các mối quan hệ -- Hai động từ tìm được là: Đặt, Giao --> Dựa vào hai động từ tìm được, đặt các câu hỏi để xác định các mối quan hệ như sau:  -- Từ đó ta có các quan hệ như sau: Bước 4: Vẽ biểu đồ mô hình thực thể E-R  Bước 5: Chuẩn hóa, rút gọn mô hình thực thể E-R Do đơn vị đặt hàng và đơn vị khách hàng đều là các đơn vị ở bên ngoài giao dịch với cửa hàng nên ta gộp thành một thực thể là Đơn vị khách gồm các thuộc tính: Mã ĐV, Tên ĐV, Địa chỉ, Điện thoại Ta có mô hình E-R như sau:  Ví dụ 2: Xây dụng cơ sở dữ liệu đề công ty theo dõi các thông tin liên quan đếnnhân viên, phòng ban và đề án với các yêu cầu sau: Ta có lược đồ E-R như sau:  Nguồn tham khảo: http:\/\/tailieu.tv\/tai-lieu\/mo-hinh-thuc-the-moi-quan-he-2876\/ http:\/\/freetuts.net\/mo-hinh-thuc-the-moi-ket-hop-er-305.html http:\/\/www.tailieuontap.com\/2010\/05\/mo-hinh-thuc-lien-ket-mo-hinh-er.html https:\/\/voer.edu.vn\/m\/mo-hinh-quan-he-thuc-the-entity-relationship-model\/ff2250a9 No comments yet. © 2017 Viblo. All rights reserved. Viblo - Free service for technical knowledge sharing Your feedback will be shared with our product delivery teams, and taken into consideration for future development. Join us to find useful information required to improve your skills Join us to find useful information required to improve your skills","relevance":1},{"title":"Cơ sở dữ liệu quan hệ là gì? Khái niệm, định nghĩa","url":"http:\/\/it.die.vn\/c\/co-so-du-lieu-quan-he\/","content":"Home \/ Tìm hiểu: Cơ sở dữ liệu quan hệ Cơ sở dữ liệu được xây dựng dựa trên mô hình dữ liệu quan hệ gọi là cơ sở dữ liệu quan hệ. Một quan hệ trong hệ CSDL quan hệ có các đặc trưng chính sau: • Mỗi quan hệ có một tên phân biệt với tên các quan hệ khác; • Các bộ là phân biệt và thứ tự của các bộ không quan trọng; • Mỗi thuộc tính có một tên phân biệt, thứ tự các thuộc tính không quan trọng;","relevance":1},{"title":"LuatVietnam.Vn - Cơ sở dữ liệu văn bản pháp luật lớn nhất Việt Nam","url":"http:\/\/www.luatvietnam.vn\/VL\/trang-chu\/","content":"Xem tiếp » Xem tiếp »  347 chai rượu Chivas và Macalan do nước ngoài sản xuất không có giấy tờ hợp lệ đang trên đường đi tiêu thụ đã bị lực lượng chức năng Thanh Hóa thu giữ…    Tại Nghị quyết số 101\/NQ-CP ngày 06\/10\/2017, Chính phủ đã phê duyệt Phương án đơn giản hóa thủ tục hành chính, giấy tờ công dân liên quan đến quản lý dân cư thuộc phạm vi chức năng quản lý Nhà nước của Bộ Xây dựng.  Theo Phương án này, một loạt thủ tục hành chính trong các lĩnh vực: Xây dựng; Nhà ở; Kinh doanh bất động sản; Xử phạt vi phạm hành chính thuộc phạm vi quản lý của Bộ Xây dựng sẽ được điều chỉnh theo hướng bãi bỏ một số giấy tờ, thông tin không cần thiết.  Xem tiếp »","relevance":0},{"title":"","url":"http:\/\/www.vietlaw.gov.vn\/LAWNET\/","content":"","relevance":0},{"title":"","url":"http:\/\/vanban.chinhphu.vn\/portal\/page\/portal\/chinhphu\/hethongvanban?class_id=1&mode=detail&document_id=180104","content":"","relevance":0},{"title":"MySQL là gì - 50 bài học MySQL miễn phí","url":"http:\/\/vietjack.com\/mysql\/mysql_la_gi.jsp","content":"Một Database (Cơ sở dữ liệu) là một ứng dụng riêng rẽ mà lưu trữ một tập hợp dữ liệu. Mỗi cơ sở dữ liệu có một hoặc nhiều API riêng biệt để tạo, truy cập, quản lý, tìm kiếm và tái tạo dữ liệu nó đang giữ. Một số loại kho lưu dữ liệu khác có thể được sử dụng, chẳng hạn như file trên hệ thống file hoặc các Hash Table lớn, nhưng việc lấy và ghi dữ liệu không thể nhanh và dễ dàng với các loại kho lưu dữ liệu này của các hệ thống. Vì thế, ngày nay, chúng ta sử dụng các Hệ thống quản lý cơ sở dữ liệu quan hệ (RDBMS) lưu giữ và quản lý khối lượng lớn dữ liệu. Nó được gọi là cơ sở dữ liệu quan hệ, bởi vì tất cả dữ liệu được lưu giữ trong các bảng dữ liệu khác nhau và các mối quan hệ được thành lập bởi sử dụng các Primary Key (khóa chính) và một số khóa khác được biết đến như là Foreign Key. Một Hệ thống quản lý cơ sở dữ liệu quan hệ (RDBMS) là một phần mềm mà: Cho bạn khả năng triển khai một Database với các bảng dữ liệu, cột (column), và các chỉ mục (Index). Bảo đảm Referential Integrity (có thể dịch là toàn vẹn quan hệ) giữa các hàng và các bảng đa dạng. Cập nhật tự động các chỉ mục. Thông dịch một truy vấn SQL và tổ hợp thông tin từ các bảng khác nhau. Trước khi đi vào khái niệm hệ thống cơ sở dữ liệu MySQL, chúng ta cùng xem lại một số định nghĩa liên quan tới cơ sở dữ liệu: Database: Một cơ sở dữ liệu là một tập hợp các bảng dữ liệu, với dữ liệu có liên quan. Bảng dữ liệu: Một bảng là một ma trận dữ liệu. Một bảng trong một cơ sở dữ liệu trông giống như một bảng tính đơn giản. Cột: Một cột chứa cùng một kiểu dữ liệu, ví dụ như tên khách hàng. Hàng: Một hàng (row, entry, record) là một nhóm dữ liệu có liên quan. Redundancy: (có thể hiểu là dữ liệu dự phòng) Dữ liệu được lưu giữ hai lần, để làm cho hệ thống nhanh hơn. Primary Key: Một Primary Key (Khóa chính) là duy nhất. Một giá trị key không thể xuất hiện hai lần trong một bảng. Với một key, bạn có thể tìm thấy phần lớn trên một hàng. Foreign Key: Bạn tưởng tượng về Foreign Key như là cái ghim liên kết giữa hai bảng. Compound Key: Một Compound Key (hay composite key) là một key mà gồm nhiều cột, bởi vì một cột là không duy nhất. Index: Một chỉ mục trong một cơ sở dữ liệu tương tự như chỉ mục trong một cuốn sách. Referential Integrity: Đảm bảo rằng một giá trị Foreign Key luôn luôn trỏ tới một hàng đang tồn tại. MySQL là một RDBMS nhanh và dễ dàng để sử dụng. MySQL đang được sử dụng cho nhiều công việc kinh doanh từ lớn tới nhỏ. MySQL được phát triển, được công bố, được hỗ trợ bởi MySQL AB, là một công ty của Thụy Điển. MySQL trở thành khá phổ biến vì nhiều lý do: MySQL là mã ngồn mở. Vì thế, để sử dụng nó, bạn chẳng phải mất một xu nào. MySQL là một chương trình rất mạnh mẽ. MySQL sử dụng một Form chuẩn của ngôn ngữ dữ liệu nổi tiếng là SQL. MySQL làm việc trên nhiều Hệ điều hành và với nhiều ngôn ngữ như PHP, PERL, C, C++, Java, … MySQL làm việc nhanh và khỏe ngay cả với các tập dữ liệu lớn. MySQL rất thân thiện với PHP, một ngôn ngữ rất đáng giá để tìm hiểu để phát triển Web. MySQL hỗ trợ các cơ sở dữ liệu lớn, lên tới 50 triệu hàng hoặc nhiều hơn nữa trong một bảng. Kích cỡ file mặc định được giới hạn cho một bảng là 4 GB, nhưng bạn có thể tăng kích cỡ này (nếu hệ điều hành của bạn có thể xử lý nó) để đạt tới giới hạn lý thuyết là 8 TB. MySQL là có thể điều chỉnh. Giấy phép GPL mã nguồn mở cho phép lập trình viên sửa đổi phần mềm MySQL để phù hợp với môi trường cụ thể của họ. Trước khi bắt đầu với loạt bài này, bạn nên có kiến thức cơ bản về PHP hoặc HTML. Nếu bạn chưa đủ tự tin với kiến thức của mình, bạn có thể tham khảo loạt bài hướng dẫn của chúng tôi về PHP và HTML. Loạt bài này trọng tập về sử dụng MySQL trong môi trường PHP. Nhiều ví dụ trong bài này sẽ thực sự hữu ích cho các lập trình viên PHP. Để tham khảo PHP, bạn truy cập: Loạt bài hướng dẫn PHP. Loạt bài hướng dẫn học MySQL cơ bản và nâng cao của chúng tôi dựa trên nguồn tài liệu của: Tutorialspoint.com Follow fanpage của team https:\/\/www.facebook.com\/vietjackteam\/ hoặc facebook cá nhân Nguyễn Thanh Tuyền https:\/\/www.facebook.com\/tuyen.vietjack để tiếp tục theo dõi các loạt bài mới nhất về Java,C,C++,Javascript,HTML,Python,Database,Mobile.... mới nhất của chúng tôi. Các bài học MySQL phổ biến khác tại VietJack: Các loạt bài khác: 160 bài học ngữ pháp tiếng Anh hay nhất 155 bài học Java tiếng Việt hay nhất 100 bài học Android tiếng Việt hay nhất 247 bài học CSS tiếng Việt hay nhất 197 thẻ HTML cơ bản 297 bài học PHP 85 bài học C# hay nhất 101 bài học C++ hay nhất 97 bài tập C++ có giải hay nhất 208 bài học Javascript có giải hay nhất Học tiếng Anh tại vietjack.com: 160 bài học ngữ pháp tiếng Anh hay nhất 160 bài tập ngữ pháp tiếng Anh hay nhất 72 bài ngữ pháp thực hành 50 tình huống tiếng Anh thông dụng 120 bí kíp luyện phần V TOEIC Trang web chia sẻ nội dung miễn phí dành cho người Việt. soạn văn lớp 8 , soạn văn lớp 9 , soạn văn lớp 10 , soạn văn lớp 11 , soạn văn lớp 12 , soạn văn lớp 6 , soạn văn lớp 7 , giải toán 6 , giải toán 7 , giải toán 8 , giải toán 9 , giải toán 10 , giải toán 11 , giải toán 12 , 66 Kim Hoa, Đống Đa, Hà Nội Phone: 01689933602 Email: vietjackteam@gmail.com 2015 © All Rights Reserved.","relevance":1},{"title":"Chương 1: Giới thiệu về MySQL","url":"http:\/\/thanhtra.nguyen.free.fr\/web\/tuto-php\/mysql1.php","content":"","relevance":1},{"title":"MySQL – Wikipedia tiếng Việt","url":"https:\/\/vi.wikipedia.org\/wiki\/MySQL","content":"MySQL là hệ quản trị cơ sở dữ liệu tự do nguồn mở phổ biến nhất thế giới và được các nhà phát triển rất ưa chuộng trong quá trình phát triển ứng dụng. Vì MySQL là cơ sở dữ liệu tốc độ cao, ổn định và dễ sử dụng, có tính khả chuyển, hoạt động trên nhiều hệ điều hành cung cấp một hệ thống lớn các hàm tiện ích rất mạnh. Với tốc độ và tính bảo mật cao, MySQL rất thích hợp cho các ứng dụng có truy cập CSDL trên internet. MySQL miễn phí hoàn toàn cho nên bạn có thể tải về MySQL từ trang chủ. Nó có nhiều phiên bản cho các hệ điều hành khác nhau: phiên bản Win32 cho các hệ điều hành dòng Windows, Linux, Mac OS X, Unix, FreeBSD, NetBSD, Novell NetWare, SGI Irix, Solaris, SunOS,... MySQL là một trong những ví dụ rất cơ bản về Hệ Quản trị Cơ sở dữ liệu quan hệ sử dụng Ngôn ngữ truy vấn có cấu trúc (SQL). MySQL được sử dụng cho việc bổ trợ PHP, Perl, và nhiều ngôn ngữ khác, nó làm nơi lưu trữ những thông tin trên các trang web viết bằng PHP hay Perl,...  ","relevance":1},{"title":"Tìm hiểu về cơ sở dữ liệu MySQL","url":"http:\/\/kienthucweb.net\/tim-hieu-ve-co-du-lieu-mysql.html","content":"MySQL là một cơ sở dữ liệu quan hệ miễn phí hiện nay đã được hãng Oracle mua lại từ hãng Sun. Nó thường được sử dụng kết hợp với PHP để lưu trữ dữ liệu của ứng dụng website khi người dùng thao tác trên website của chúng ta. Nếu các bạn đã từng học SQL Server một hệ cơ sở dữ liệu quan hệ của Microsoft thì khi tiếp cận với MySQL sẽ dễ dàng hơn, vì chúng vẫn được xây dựng giống nhau về tư tưởng, kiến trúc. Ở bài viết này mình sẽ hướng dẫn cho các bạn hiểu cơ bản những kiến thức về MySQL, các câu lệnh truy vấn, kiến trúc lưu trữ, … sau đó ở bài viết sau mình sẽ hướng dẫn các bạn kết hợp lập trình PHP để kết nối với cơ sở dữ liệu này để có thể khai thác, truy vấn dữ liệu. Tìm hiểu về cơ sở dữ liệu MySQL Để dễ hiểu hơn cho các bạn, mình sẽ ví dụ cho các bạn về bài toán quản lý trung tâm đào tạo tiếng anh và mình có database với tên: friday với các table (bảng) như sau: Trong database friday này lưu trữ 4 bảng để lưu trữ dữ liệu của một trung tâm đào tạo tiếng anh. Mỗi table lại lưu trữ các field (trường dữ liệu) với các kiểu dữ liệu khác nhau. Mình sẽ ví dụ cho các bạn về bảng: tbl_students học viên như sau: Như chúng ta thấy, cấu trúc của MySQL là: Database -> Table -> Field. Ngoài ra, các field có nhiều kiểu dữ liệu khác nữa như BLOB, date, …  Tương tự với các table khác, khi phân tích thiết kế cơ sở dữ liệu, chúng ta cần lưu trữ cái gì thì tạo ra table và các field để lưu trữ chúng. 1. Lệnh: Insert Lệnh Insert là câu lệnh SQL dùng để chèn một bản ghi vào table Cú pháp: INSERT INTO table_name (field1, field2) VALUES (‘value1’, ‘value2’); Ví dụ:   2. Lệnh Update Lệnh Update là câu lệnh SQL dùng để cập nhật giá trị cho một hoặc nhiều bản ghi đang có trong bảng (tùy vào điều kiện giới hạn số bản ghi thực hiện của bạn). Cú pháp: UPDATE table_name SET field1 = ‘value1’, field2 = ‘value2’ WHERE điều_kiện Ví dụ:   Câu lệnh này sẽ thực hiện sửa tên của bản ghi có mã giảng viên = 1, chính là bản ghi mình vừa thực hiện INSERT vào. 3. Lệnh Delete Lệnh Delete là câu lệnh SQL dùng để xóa một hay nhiều bản ghi Cú pháp: DELETE FROM table_name WHERE điều_kiện Ví dụ:   Câu lệnh này sẽ thực hiện xóa bản ghi có mã giảng viên = 1 4. Lệnh SELECT Câu lệnh SELECT là câu lệnh SQL dùng để truy vấn các bản ghi trong cơ sở dữ liệu của bạn. Đây là câu lệnh SQL được sử dụng nhiều nhất, tùy biến nhất để giải quyết mọi yêu cầu khai thác dữ liệu của bài toán. Cú pháp: SELECT field1, field2, FROM table_name WHERE điều_kiện ORDER BY field ASC|field DESC|rand() LIMIT Số bản ghi|Giá trị đầu, giá trị cuối Ví dụ:   Câu lệnh trên sẽ lấy được toàn bộ các trường dữ liệu của mã giảng viên = 1 Lưu ý: Để có thể đơn giản hóa hơn các thao tác quản trị trong MySQL, các bạn có thể xem bài viết: Hướng dẫn sử dụng phpMyAdmin để quản lý MySQL Trong MYSQL câu lệnh SELECT là câu lệnh cần được chúng ta tìm hiểu sâu nhất. Mỗi một yêu cầu về dữ liệu khác nhau lại có một câu lệnh khác nhau được viết ra. Chúng ta cần phải dựa trên một nền kiến thức cú pháp và tư duy logic để có thể giải quyết được những yêu cầu khai thác dữ liệu đa dạng trên thực tế. Mình sẽ hướng dẫn các bạn chi tiết hơn ở những bài viết sau nhé!. Chúc các bạn có thêm những kiến thức lập trình web bổ ích. Cùng xây dựng, cùng chia sẻ :)","relevance":1},{"title":"Cơ sở dữ liệu MySQL mẫu để học SQL","url":"http:\/\/o7planning.org\/vi\/10235\/co-so-du-lieu-mysql-mau-de-hoc-sql","content":"Cơ sở dữ liệu này được làm ví dụ trong hướng dẫn học SQL (MySQL) tại:","relevance":1},{"title":"Giới thiệu về hệ quản trị cơ sở dữ liệu MySQL","url":"http:\/\/kungfuphp.com\/mysql\/gioi-thieu-ve-he-quan-tri-co-so-du-lieu-mysql.html","content":"Chia sẽ kiến thức miễn phí – Cùng nhau phát triển Nói về hệ quản trị cơ sở dữ liệu MySQL, nó là một phần to lớn khác, các bạn chắc chắn không thể nào học hết trong phạm vi 1 bài viết hay dăm ba bài viết được. Nhưng mình cũng cố gắng tổng hợp tất cả các kiến về MySQL trong bài này, tóm lược các ý chính, để các bạn có thể nắm sơ qua để chúng ta có thể thực hành trong các bài viết sau này để bỡ ngỡ. Đây là 1 bài viết khá dài giới thiệu chi tiết về hệ quản trị cở sở dữ liệu MySQL, chính vì thế mình yêu cầu các bạn chuẩn bị tư tưởng như sau: Khái niệm này đã được định nghĩa rất rõ từ Wikipedia. Mình xin trích dẫn như sau : Nếu bạn đang tìm kiếm một hệ thống quản lý cơ sở dữ liệu miễn phí hay là không đắt tiền, một vài thứ có sẵn để bạn chọn như: MySQL, mSQL, Postgres. Khi bạn so sánh MySQL với các hệ thống cơ sở dữ liệu khác, hãy nghĩ về những gì quan trọng nhất đối với bạn. Sự thực thi, sự hỗ trợ, các đặc tính, các điều kiện và các giới hạn của bản quyền, giá cả của tất cả các nhân tố để có thể thực hiện. Với những lí do đó, MySQL có nhiều đặc điểm cuốn hút: Cơ sở dữ liệu MySQL có thể hỗ trợ cho nhiều cơ sở dữ liệu khác.Thông thường bạn sẽ có một cơ sở dữ liệu cho mỗi ứng dụng. Tạo cơ sở dữ liệu: Đây là phần dễ nhất. Tại dấu nhắc của dòng lệnh MySQL, đánh : dbname: chính là tên của cơ sở dữ liệu bạn muốn tạo. Khi bạn thấy một phản hồi giống như sau: Query OK,1 row affected (0.06 sec). Điều này chứng tỏ bạn đã thành công trong việc tạo cơ sở dữ liệu, nếu không có phản hồi thì bạn xem lại đã đánh ; ở cuối dòng chưa. Dấu ; bảo MySQL rằng bạn đã hoàn thành và yêu cầu nó hãy thực hiện chính xác câu lệnh. Các người dùng và các quyền: Một hệ thống MySQL có nhiều người dùng, vì lí do bảo mật cho nên với mỗi người dùng của hệ thống cần phải có một account và password. Điều này không có nghĩa là bạn phải bắt buộc phải tạo ra password cho người dùng, nhưng điều nên làm là cung cấp các password cho tất cả những người dùng mà bạn đã tạo ra. Các quyền hệ thống của MySQL: Một trong những đặc tính tốt nhất của MySQL là nó hỗ trợ tất cả các quyền phức tạp của hệ thống. Khi bạn tạo ra một người dùng trong MySQL, bạn trao quyền cho người đó để định rõ những gì người đó có thể và không thể đối với hệ thống. Tạo người dùng: sử dụng lệnh GRANT Các lệnh GRANT và REVOKE được dùng để trao và lấy quyền đến người dùng MySQL với bốn cấp bậc phân quyền như sau:Global, Database, Table, Column Lệnh GRANT: để tạo người dùng và giao quyền cho họ.Cấu trúc như sau: Tạo bảng cơ sở dữ liệu: sử dụng lệnh CREATE TABLE, cú pháp thông thường là: Ví dụ, tạo một bảng customers như sau: Xem dữ liệu với lệnh SHOW và DESCRIBE: Sau khi đăng nhập vào màn hình MySQL, bạn có thể xem các bảng trong cơ sở dữ liệu bằng cách đánh vào như sau: Thì MySQL sẽ hiển thị tất cả các bảng trong cơ sở dữ liệu. Bạn cũng có thể sử dụng show để xem danh sách các cơ sở dữ liệu bằng cách đánh vào như sau: Để xem thêm các chi tiết về một bảng cụ thể bạn sử dụng lệnh DESCRIBE:  SQL (Structured Query Language): Đây là ngôn ngữ chuẩn nhất cho việc truy cập hệ thống quản lý cơ sở dữ liệu quan hệ. SQL dùng để chứa và truy xuất dữ liệu từ một cơ sở dữ liệu. Nó thường được dùng trong các hệ thống cơ sỡ dữ liệu như MySQL, Oracle, Sybase, PostgreSQL và Microsoft SQL Server… Chèn dữ liệu vào trong cơ sở dữ liệu: Trước khi bạn có thể làm nhiều việc với cơ sở dữ liệu, bạn cần chứa một ít dữ liệu ở trong nó. Để thực hiện được điều này bạn có thể sử dụng câu lệnh SQL INSERT. Cú pháp như sau: Ví dụ, chèn một bản ghi vào trong bảng Customers, bạn thực hiện như sau: Truy xuất dữ liệu từ cơ sở dữ liệu: Sử dụng câu lệnh SELECT để truy xuất dữ liệu từ một cơ sở dữ liệu bằng cách chọn các hàng thoả mãn điều kiện cụ thể nào đó từ một bảng. Có rất nhiều tuỳ chọn và cách khác nhau để sử dụng lệnh SELECT. Câu lệnh căn bản của SELECT là: Truy xuất dữ liệu với điều kiện cụ thể: Để có thể truy cập một tập hợp con của các hàng trong một bảng, chúng ta cần phải xác định một vài điều kiện có chọn lựa. Bạn có thể làm được điều này với mệnh đề WHERE. Ví dụ: Điều này đồng nghĩa với việc lựa chọn tất cả các cột từ bảng orders, nhưng chỉ có những dòng mà có customerid=3 thì mới thoả mãn. Truy xuất dữ liệu từ nhiều bảng: Thông thường để trả lời một câu hỏi từ cơ sở dữ liệu, bạn có thể cần phải dùng dữ liệu từ nhiều hơn một bảng. Để kết hợp các thông tin này lại với nhau trong SQL, bạn phải thực hiện một phép toán gọi là kết hợp(join). Có nghĩa là nó sẽ kết hợp hai hay nhiều bảng lại với nhau theo các mối quan hệ giữa các dữ liệu. Ví dụ nối hai bảng đơn giản sau: Kết nối nhiều hơn hai bảng: Phức tạp hơn kết nối hai bảng lại với nhau.Theo luật thông thường, bạn cần nối các bảng từng cặp với nhau với các điều kiện nối.Ví dụ như sau: Sử dụng tên khác cho bảng (tên hiệu-alias): Thông thường chúng ta truy cập đến tên của các bảng bằng các tên hiệu của chúng. Bạn có thể tạo ra các tên hiệu này khi bắt đầu câu truy vấn và sau đó sử dụng thông qua chúng. Ví dụ: Như khi bạn khai báo các bảng chúng ta sẽ dùng, chúng ta thêm một mệnh đề AS để khai báo các tên hiệu cho bảng. Chúng ta cũng có thể dùng các tên hiệu cho các cột. Việc này thật sự cần thiết khi chúng ta muốn kết nối một bảng với chính bản thân nó. Điều này nghe có vẻ hơi khó nghe, nhưng nó thật sự là hữu ích, chẳng hạn nếu chúng ta muốn tìm các hàng trong cùng một bảng mà có cùng giá trị, nếu chúng ta muốn tìm các khách hàng sống trong cùng một thành phố, chúng ta có thể đặt các tên khác nhau cho cùng một bảng Customers. Ví dụ: Những gì mà chúng ta làm là giả vờ như bảng Customers là hai bảng khác nhau c1 và c2, sau đó thực hiện việc kết nối trên cột City","relevance":1},{"title":"Cơ sở dữ liệu Oracle","url":"http:\/\/o7planning.org\/vi\/10977\/oracle","content":"Các bài hướng dẫn chi tiết Đây là danh sách các ví dụ nhỏ, bạn nên xem các hướng dẫn đầy đủ ở trên trước khi xem các ví dụ.","relevance":1},{"title":"[Oracle] – Giới thiệu hệ quản trị cơ sở dữ liệu quan hệ Oracle | Cuong Dang","url":"https:\/\/dangvinhcuong.wordpress.com\/2015\/04\/14\/oracle-gioi-thieu-he-quan-tri-co-so-du-lieu-quan-he-oracle\/","content":"Kính gửi anh\/chị, Cường xin giới thiệu hệ quản trị cơ sở dữ liệu chuyên nghiệp và lớn nhất hiện nay Oracle.  Thực ra Oracle đã có hệ quản trị CSDL lớn nhất và chuyên nghiệp nhất thế giới cách đây hàng chục năm. Theo tiếp xúc của Cường, hầu hết những người làm trong lĩnh vực IT đặc biệt là lập trình phần mềm và quản trị hạ tầng hệ thống mạng ít biết đến hệ quản trị CSDL mạnh mẽ nhất này, Có nhiều nguyên nhân khiến giới IT lạ lẩm với DBMS này, đa số là Oracle quá lớn, chúng ta không có điều kiện tiếp cận. Ngoài những tập đoàn lớn hoặc các công ty đa quốc gia với hệ thống phần mềm quản lý chuyên nghiệp mới có đủ điều kiện triển khai Oracle Database. Hãng Oracle hiện nay đưa ra rất nhiều sản phẩm tuy nhiên trong phạm vi bài viết này Cường chỉ nói về Oracle Database Xem thêm : http:\/\/www.oracle.com\/index.html   Cường đã có may mắn sử dụng và quản trị Oracle Database được vài năm và đúc kết một điều là : Tính đến thời điểm hiện tại, Oracle là hệ quản trị CSDL mạnh nhất, tốt nhất chạy trên mọi nền tảng. Khả năng chịu tải, cũng như lưu trữ dữ liệu khổng lồ đã tạo nên một Oracle không thể soát ngôi trong tương lai gần. Nếu như Microsoft SQL Server là một hệ quản trị CSDL dễ dàng quản lý, xây dựng cũng như bảo trì thì Oracle cần người vận hành phải biết nhiều hơn thế. Microsoft SQL Server có giá thành rẻ và chạy trên hệ điều hành Windows, triển khai nhanh cho doanh nghiệp, cá nhân một cách nhanh chóng. Trong khi đó Oracle Database đòi hỏi cấu hình máy chủ cao hơn, giá thành cao hơn và khó quản trị hơn và chỉ có doanh nghiệp và các tổ chức chính phủ mới có đủ tài chính để sử dụng. 1. Lịch sử Oracle – Để đảm bảo tính chính xác thông tin, Cường xin trích dẫn bài viết về lịch sử Oracle từ Wiki  2. Các phiên bản Oracle Database  3. Oracle và mối lương duyên với IBM – Mối lương duyên đầu tiên của Oracle và hãng chuyên cung cấp phần cứng máy chủ từ năm 1989. Lúc bấy giờ Oracle chỉ là một hãng phần mềm thuần túy, để tối ưu hóa sản phầm của mình trên từng thiết bị phần cứng máy chủ khác nhau. Oracle buộc phải bắt tay với IBM là hãnh máy chủ lớn lúc bấy giờ. Các sản phẩm của Oracle thể hiện sự ưu việt của mình trên nền tảng phần cứng IBM hơn so với các hệ quản trị CSDL khác như Microsoft SQL Server hoặc DB2. 4. ERP và Sun Microsystem – Khái niệm ERP (Enterprise Resource Planing) ra đời Oracle là một trong những hãng lớn nhanh chân xây dựng hệ thống riêng cho mình. Trong khi đó IBM cũng đang xây dựng ERP và DB2 tỏ vẻ đuối sức khi cạnh tranh trực diện với Oracle Database. Trong khi đó Oracle phải luôn phụ thuộc vào phần cứng máy chủ IBM. Mối quan hệ ngày càng giống miễn cưỡng, Oracle đã đi một nước cờ táo bạo : Mua hãng phần cứng máy chủ Sun Microsystem. Điều này chứng tỏ mối lương duyên Oracle – IBM đã chấm dứt, Oracle có thể tự xây dựng nền tảng phần cứng máy chủ riêng cho mình, triển khai đến khách hàng trọn gói. – Hơn thế Sun Solaris một hệ điều hành được thiết kế trên nền tảng Unix để chạy máy chủ cũng hiển nhiên là của Oracle => Quan thương vụ trên chúng ta thấy rằng Oracle sẽ không còn phụ thuộc bất cứ hãng phần cứng, phần mềm và OS nào. 5. Oracle và Java – Oracle phát triển DBMS và các ứng dụng máy chủ dưới dạng Multi platform (chạy trên nhiều hệ điều hành khác nhau). Java là ngôn ngữ lập trình hiện đại, dễ dàng đáp ứng nhu cầu của Oracle. Tuy nhiên Java đang chết dần chết mòn vì sự trỗi dậy mạnh mẽ của môi trường lập trình .NET của Microsoft. Oracle quyết định mua Sun Microsystem như một mũi tên bắt trúng ba con nhạn. Java sẽ được tiếp tục hậu thuẩn và phát triển bởi Oracle. 6. Oracle và MySQL – Trong đám Database Oracle trở nên bá đạo, tuy nhiên xu hướng phần mềm nguồn mở và miễn phí đã làm nên một hệ quản trị CSDL đơn giản, hiệu quả MySQL. – Phần mềm mã nguồn mở và free đang gặm nhấm miếng bánh độc tôn của Oracle và hầu như Oracle không kiểm soát được. Thương vụ Oracle-MySQL diễn ra, MySQL vẫn là DBMS free nhưng đã nằm vào tầm kiểm soát của Oracle. => Một bước đi khôn ngoan nữa của Oracle. 7. Tiến sâu vào ERP – Hội đủ điều kiện để trở thành nhà cung cấp dịch vụ độc lập. Oracle càng ngày càng tiến sâu vào ERP. Hầu hết các lĩnh vực : Y tế, Bán lẻ, tài chánh, chính phủ, dầu khí, sản xuất…. Oracle điều có sản phẩm chủ lực rất mạnh. Kết luận: – Chém gió với các bạn theo ý kiến chủ quan của mình thông qua các dữ kiện lịch sử đã có, nhưng sự thật hiển nhiên là Oracle Database là hệ QTCSDL lớn nhất, mạnh nhất hiện nay. ERP của Oracle có thể nói chỉ đứng thứ 2 sau SAP. […] Tiếp theo bài viết https:\/\/dangvinhcuong.wordpress.com\/2015\/04\/14\/oracle-gioi-thieu-he-quan-tri-co-so-du-lieu-quan-he-o… […] Fill in your details below or click an icon to log in: You are commenting using your WordPress.com account. ( Log Out \/ Change ) You are commenting using your Twitter account. ( Log Out \/ Change ) You are commenting using your Facebook account. ( Log Out \/ Change ) You are commenting using your Google+ account. ( Log Out \/ Change ) Connecting to %s Notify me of new comments via email. Notify me of new posts via email.   ","relevance":1},{"title":"Giới thiệu về cơ sở dữ liệu Oracle","url":"http:\/\/phamquan.com\/oracle\/oracle-dba\/gioi-thieu-ve-co-so-du-lieu-oracle.html","content":"Học lập trình bằng đam mê Học cơ sở dữ liệu, Big Data, các công nghệ mới nhất January 8, 2016 by Quan Pham Leave a Comment Chào các bạn, các bạn chắc hẳn đã không ít lần nghe về hệ quản trị cơ sở dữ liệu Oracle hay còn gọi là Oracle database. Hôm nay mình sẽ giới thiệu với các bạn một cách tổng quát nhất về hệ quả trị cơ sử dữ liệu này. Nó giúp các bạn có một cái nhìn khái quát về nó. Oracle Database là cơ sở dữ liệu đầu tiên được thiết kế chuyên dụng cho tính toán mạng lưới (grid computing), tính mềm dẻo nhất và chi phí hiệu quả nhất cho việc quản lý thông tin và ứng dụng. Kiến trúc mạng lưới tính toán của tổ chức  tạo ra các vũng (pools) rộng lớn của ngành công nghiệp(industry-standard), mođun hóa lưu trữ và máy chủ. Với kiến trúc này, mỗi hệ thống mới có thể nhanh chóng chuẩn bị từ vũng của các thành phần. Không cần áp lực cao, bởi vì sức chứa có thể dễ dàng thêm hoặc đặt lại từ nguồn tài nguyên chung nếu cần. Cơ sở dữ liệu có cấu trúc logic và cấu trúc vật lý. Vì cấu trúc logic và cấu trúc vật lý là riêng biệt, cấu trúc vật lý lưu trưc dữ liệu có thể quản lý mà không cần ảnh hưởng từ truy cập của cấu trúc lưu trữ logic. Kiến trúc Oracle grid chung một số lượng lớn máy chủ, lưu trữ và mạng trong sự linh hoạt, trên yêu cầu tài nguyên tính toán cho hệ thống tính toán lớn cần tính toàn on-demand computing resource for enterprise computing needs. Cơ sở hạ tầng tính toán mạng lướ không ngừng phân tích yêu cầu cho tài nguyên và điều chỉnh cung cấp tương ứng. Ví dụ, bạn có thể chạy chương trình ứng dụng trên mạng lưới của hàng loạt các máy chủ cơ sở dữ liệu được liên kết với nhau. Khi báo cáo vào cuối tháng, người quản trị có thể tự động dự phòng nhiều máy chủ hơn để xuer lý yêu cầu tăng. Tính toán mạng lưới (Grid computing) sử dụng áp lực làm việc quản lý mạnh mẽ làm nó có thể để cung cấp tài nguyên  mà làm cho nó có thể cho ứng dụng để chia sẻ tài nguyên vượt qua các máy chủ. Sức chịu đựng xử lý dữ liệu có thể thêm vào hoặc bớt đi dựa trên nhu cầu, và tài nguyên với sự chuẩn bị cho vị trí có thể thay đổi. Web services có thể nhanh chóng hợp nhất chương trình ứng dụng đề tạo hoạt độn xử lý mới. Clustering là công nghệ được sử dụng để tạo hạ tầng cơ sở dữ  cơ sở dữ liệu mạng lưới (grid). Clusters đơn giản có tài nguyên tĩnh cho ứng dụng riêng bởi quyền sở hữu riêng  Grids bao gồm nhiều là vũng(pool) tài nguyên động có thể chia sẻ trong nhiều ứng dụng và người dùng khác nhau. Một mạng lưới (grid) không giả định tất cả các máy tính trong mạng lưới đề chạy giống nhau khi khởi chạy ứng dụng. Ứng dụng có thể được lên lịch trình và di chuyển qua các máy chủ trong mạng lưới. Các mạng lưới có thể chia sẻ tài nguyên từ và trong hệ thống độc lập với hệ thống được sở hữu. Ở cấp độ cao nhất, ý tưởng của tính toán mạng lưới là tính toán có lợi. Nói cách khác nó có thể không quan tâm nơi mà dữ liệu được lưu trữ hoặc máy tính nào xử lý yêu cầu. Bạn có thể yêu cầu thông tin hoặc tính toán và nó được hoàn tất như bạn muốn và bất cứ khi nào bạn muốn. Nó tương tự như việc sử dụng điện của bạn, bạn không cần biết nhà máy sản xuất ở đâu, không cần biết mạng lưới điện như thế nào, và khi bạn có yêu cầu sử dụng thì nó có thể đáp ứng. Mục đích là làm lợi cho tính toán tiện nghi và ở bất cứ đâu. Do đó nó có tên là Grid. Theo góc độ lợi ích như vậy là nhìn lợi ích từ phía góc nhìn của người dùng (client side). Theo góc nhìn từ  “server side”, hoặc phía sau màn ảnh, grid là nơi lưu trữ tài nguyên, chia sẻ thông tin và có tính sẵn sàng cao. Tài nguyên lưu trữ đảm bảo rằng tất cả các yêu cầu cầù tài nguyên không ngừng nghỉ trong khi yêu cầu thì ngừng phục vụ. Chia sẻ thông tin chắc chắn rằng thông tin người sử dụng và ứng dụng cần là có sẵn bất cứ nơi nào và khi nào cần. Tính  có sẵn cao đảm bảo tất cả dữ liệu và sự tính toán luôn luôn ở đó giống như công ty cung cấp điện. Mỗi cơ  sở dữ liệu yêu cầu ít nhất một quản trị viên hay còn gọi là Database Adminstrator (DBA). Hệ thống cơ sở dữ liệu Oracle có thể lớn hơn và có thể có nhiều người dùng hơn. Do đó, người quản trị cơ sở dữ liệu thường không phải công việc của một người, mà của một nhóm DBA cùng nhau chia sẻ trách nhiệm. Trách nhiệm của người quản trị bao gồm: Filed Under: Oracle DBA Your email address will not be published. Required fields are marked * Comment Name * Email * Website    January 4, 2016 By Quan Pham January 8, 2016 By Quan Pham December 31, 2015 By Quan Pham Copyright © 2017 · Magazine Pro Theme on Genesis Framework · WordPress · Log in","relevance":1},{"title":"Học cơ sở dữ liệu Oracle Server - Nghề nghiệp rộng mở","url":"https:\/\/stanford.com.vn\/kien-thuc-lap-trinh\/tin-chi-tiet\/cagId\/42\/id\/8104\/hoc-co-so-du-lieu-oracle-server--nghe-nghiep-rong-mo","content":"Khóa học cơ sở dữ liệu Oracle Server tại Stanford cung cấp cho bạn những kiến thức về quản trị, phân tích và thiết kế cơ sở dữ liệu trong Oracle Server.  Trên thế giới và ở tại Việt Nam có ba hệ quản trị CSDL được biết đến đó là: Microsoft SQL-Server, Oracle, IBM-DB2. Nhưng theo thông kê cho thấy Oracle chiếm đến tới 48.6% thị phần cơ sở dữ liệu trên toàn thế giới. Oracle hiện đang là Cơ sở dữ liệu được các doanh nghiệp ứng dụng nhiều nhất trên thế giới. Vì vậy, học cơ sở dữ liệu Oracle Server được cho là lựa chọn ưu việt nhất so với các hệ quản trị cơ sở dữ liệu khác. Oracle hỗ trợ việc quản trị dữ liệu có khối hợp hàng trăm Gigabyte. Do vậy mà số lượng các công ty tập đoàn trên thế giới sử dụng Oracle chiếm hơn hai phần ba trong số 500 tập đoàn công ty lớn nhất thế giới. Ở việt nam hầu hết các đơn vị lớn đều sử dụng hệ quản trị cơ sở dữ liệu này như các ngành kho bạc, ngân hàng, thuế, bảo hiểm, hàng không, bưu điện,  dầu khí,…  Đối với các chuyên gia cơ sở dữ liệu mức lương tính theo đơn vị ngàn USD không phải là hiếm, tuy nhiên để trở thành một DBA chuyên nghiệp bạn cần phải trải nghiệm trên các hệ thống đủ lớn, am hiểu công nghệ của hãng, có kỹ năng xử lý các tình huống thực tế ngoài vững kiến thức lý thuyết thật tốt. Đây là một cản trở lớn với nhiều DBA và cũng là yếu tố quan trọng để trở thành một DBA giỏi vì không dễ dàng để có cơ hội trải nghiệm kiến thức trên các hệ thống lớn. Nhiệm vụ của DBA là gì? -         Đánh giá khả năng phần cứng của máy chủ CSDL -         Tạo mới và nâng cấp bản mới cho CSDL -         Cài phần mềm CSDL trên các nền Hệ điều hành khác nhau -         Thực hiện giải pháp sao lưu dữ liệu, phòng ngừa thảm họa -         Xây dựng chính sách bảo mật thông tin -         Quản trị người dùng truy nhập CSDL -         Theo dõi và tối ưu tinh chỉnh CSDL -         Phục hồi dữ liệu khi bị hư hoặc bị mất -         Thường xuyên cập nhật kiến thức, giải pháp công nghệ mới -         Thực thi chính sách bảo mật thông tin CSDL Làm thế nào để trở thành một DBA? Bạn có thể tự học cơ sở dữ liệu Oracle Server để trang bị cho mình kiến thức và bằng cấp chuẩn quốc tế của Oracle nhưng có thể sẽ không hiệu quả đôi khi còn mất nhiều thời gian. Để đủ tự tin giải quyết vấn đề trong thực tế, không phải chỉ học lý thuyết suông mà bạn cần thực hành trên những tình huống giả lập.  Tại sao có rất nhiều công ty và tập đoàn lớn của Việt Nam sử dụng hệ quản trị này mà bạn không nghĩ mình sẽ trở thành một quản trị viên cho các tập đoàn lớn nhỉ? Chỉ với học kinh nghiệm quản trị CSDL Oracle tại Stanford – dạy kinh nghiệm lập trình là bạn hoàn toàn có thể trở thành một quản trị viên Oracle. Khóa học đào tạo Oracle tại Stanford dành cho tất cả mọi người, tất cả những người muốn học về quản trị Oracle đều có thể làm được điều đó. Ngoài ra với những nhân viên đã làm về quản trị cơ sở dữ liệu muốn nâng cao tay nghề do sự phát triển không ngừng của Oracle thì việc bạn hãy học khóa đào tạo Oracle là một điều tốt nó sẽ nâng cao tay nghề và giúp bạn trở thành một người quản trị tốt hơn. Khối kiến thức của khóa học Oracle này đóng vai trò quan trọng giúp cho học viên sau khi ra trường có thể làm việc với vai trò của người quản trị hệ thống DBMS, người thiết kế, lập trình các ứng dụng cơ sở dữ liệu trong các công ty, xí nghiệp có sử dụng Oracle database server. Với đội ngũ giảng viên đào tạo Oracle chuyên sâu tới từ các công ty và tập đoàn lớn chắc chắn sẽ cho bạn những cái nhìn khác về Oracle và giúp bạn trở thành một người quản trị tốt nhất. Xem thêm bài viết tại đây: http:\/\/stanford.com.vn\/kien-thuc-lap-trinh\/tin-chi-tiet\/cagId\/42\/id\/8104\/hoc-co-so-du-lieu-oracle-server--nghe-nghiep-rong-mo  Tags: học lập trình, học oracle Tầng 2 số 20 ngõ 678 Đường Láng (Hoặc cuối ngõ 100 Nguyễn Chí Thanh), Đống Đa, Hà Nội. P.504 Tầng 5 - CT6 Khu đô thị mới Tứ Hiệp, Thanh Trì, Hà Nội (024) 6275 2212 | (024) 6662 3355 Chuyên môn: (0869) 188 255 0936.172.315 | 0963.723.236 daotao@stanford.com.vn Chọn Bộ phận hỗ trợ Chọn Bộ phận hỗ trợ  Hãy điền tên của bạn  Vui lòng cung cấp địa chỉ email  Vui lòng điền số điện thoại của bạn Đăng nhập bằng  Bắt đầu trò chuyện Đội hỗ trợ Hãy hỏi chúng tôi Tốt Bạn có câu hỏi? Hãy chat với chúng tôi!  Hỗ trợ trực tuyến ĐÀO TẠO: 024.6275.2212 024.6662.3355 CHUYÊN MÔN: 0869.188.255","relevance":1},{"title":"Con đường Oracle DBA: Oracle Database là gì?","url":"http:\/\/duydx.blogspot.com\/2015\/07\/oracle-database-la-gi.html","content":"Công ty nhận nhập khẩu hàng từ hàn quốc về việt nam chi phí thấp Đơn vị chuyên lấy hàng từ hàn quốc về việt nam giá thấp Đơn vị nhận order phụ kiện quảng châu giá rẻ   ","relevance":1},{"title":"Hệ quản trị cơ sở dữ liệu Oracle là gì? - Hỏi đáp nhanh","url":"http:\/\/hoidapnhanh.vn\/593\/he-quan-tri-co-so-du-lieu-oracle-la-gi","content":"0982.556.857 - Địa chỉ: 74\/46 Nguyễn Hoàng Tôn, Tây Hồ, Hà Nội   Địa chỉ: 74\/46 Nguyễn Hoàng Tôn, Tây Hồ, Hà Nội        HỎI ĐÁP NHANH - HỎI ĐÁP TRỰC TUYẾN CHO NGƯỜI VIỆT Muốn biết thì phải hỏi - Muốn giỏi thì phải đáp Liên hệ quản trị trang: dangnamkien@gmail.com - 89B Lý Nam Đế - Hoàn Kiếm - Hà Nội  ","relevance":1},{"title":"Hướng dẫn học SQL cho người mới bắt đầu với SQL Server","url":"http:\/\/o7planning.org\/vi\/10239\/huong-dan-hoc-sql-cho-nguoi-moi-bat-dau-voi-sql-server","content":"","relevance":1},{"title":"Khởi tạo Database trong SQL Server","url":"http:\/\/www.howkteam.vn\/course\/su-dung-sql-server\/khoi-tao-database-trong-sql-server-1363","content":"Đăng ký thành viên và Đăng nhập để có thể dễ dàng trao đổi, giao lưu và chia sẻ kiến thức hơn. Trong bài lần trước, chúng ta đã tìm hiểu SƠ LƯỢC VỀ SQL và  hướng dẫn cài đặt SQL MANAGEMENT STUDIO cùng công cụ hỗ trợ. Bạn đã chuẩn bị để bắt đầu chứ?  Ở bài này, Kteam sẽ hướng dẫn bạn cách KHỞI TẠO DATABASE trong SQL Server. Chúng ta bắt đầu nào!  Trong bài này chúng ta sẽ cùng tìm hiểu một số vấn đề  Hiện nay, việc thu nhập thông tin trong thế giới thực nhằm tạo một CƠ SỞ DỮ LIỆU (CSDL) dùng chung, liên quan đến một đối tượng, ngành nghề, tổ chức nào đó đã trở nên phổ biến trong cuộc sống. CSDL dùng để tổ chức và truy xuất những thông tin cần thiết, một cách tối đa hóa hỗ trợ hoạt động quản lý kinh doanh, nhân sự, điểm,…. Ở mức logic, một DATABASE gồm nhiều bảng (TABLE), mỗi bảng được xác định bằng một tên, bảng chứa dữ liệu có cấu trúc và các ràng buộc (CONSTRAINT) định nghĩa trên các bảng. Ngoài ra, Database còn có khung nhìn (VIEW), các thủ tục\/ hàm…. Ở mức vật lý, DATABASE của SQL Server được lưu trữ dưới 3 loại tập tin:  Như việc truy xuất, đóng mở tập tin thông thường, bạn cần tạo file lưu trữ trước khi truy xuất. Tương tự vậy, bạn cần tạo một DATABASE để lưu trữ dữ liệu trong SQL Server để tiện cho việc truy vấn sau này. SQL Server sẽ giúp bạn quản lý, truy xuất những dữ liệu này một cách có cấu trúc và dễ dàng hơn. Đầu tiên, để tạo một Database, bạn cần mở SQL Management Studio lên > Connect  Bước 1: Nhấp chuột phải vào Databases > New Database….  Bước 2: Nhập tên Database vào Database Name Cấu trúc đặt tên nên sử dụng là <Tên Database> <DB> <Phương thức tạo Database> Lưu ý: Mỗi Database chỉ tồn tại với một TÊN DUY NHẤT, không trùng lặp với tên các Database sẳn có. Chữ viết hoa hay thường không gây ảnh hưởng đến cú pháp trong SQL. Ví dụ: Tạo Database bằng giao diện có tên SQLDBUI   Bước 1: Nhấp vào New Query hoặc phím tắt Ctrl + N  Bước 2: Nhập câu lệnh có cú pháp sau. Bôi đen dòng lệnh > Excute (Phím tắt F5) CREATE DATABASE <tên database> Hộp thoại Message xuất hiện báo lệnh khởi tạo thành công. Ví dụ:   Để xóa một Database tồn tại trong danh sách ta dùng hai cách Nhấp chuột phải vào Database cần xóa trong danh sách Databases bên trái > Delete  Cửa sổ Delete Object hiển thị. Các bạn đánh dấu vào ô Close existing connections > OK để chắc chắn xóa được.  Trong query, viết câu lệnh có cú pháp sau. Bôi đen > Excute (Phím tắt F5) DROP DATABASE <tên database cần xóa>  Trong quá trình tạo Database bằng UI, nếu bạn gặp phải lỗi sau thì có nghĩ tên Database bạn muốn khởi tạo trùng với tên Database đã có sẵn trong SQL Server.  Tương tự, khi bạn khởi tạo một Database đã tồn tại trong danh sách bằng code. Hộp thoại Message sẽ báo lỗi như sau:  Giải pháp là thay đổi tên Database khác với các tên Database đã có trong danh sách để việc khởi tạo được hoàn tất. Trong một số trường hợp, có thể bạn sẽ không nhìn thấy Database vừa khởi tạo, hoặc vẫn thấy tên của Database đã xóa trong danh sách Database bên trái sau khi thực thi lệnh thành công. Bạn nhấp chuột phải vào Databases > Refesh để cập nhập danh sách Database  Trong quá trình thực thi lệnh (Excute) trong Query: Để tạo COMMENT trong SQL, chúng ta sử dụng cú pháp --Nội dung Comment Query được lưu như một file thông thường. Chọn Save hoặc phím tắt Ctrl + S  Chọn vị trí lưu Query ở khung đỏ > nhập tên Query ở File name hoặc lưu dưới tên mặc định > Save  Trong bài này, chúng ta đã biết cách KHỞI TẠO VÀ THAO TÁC TRÊN DATABASE. Bài sau, chúng ta sẽ tìm hiểu cách KHỞI TẠO, XÓA,SỬA TABLE TRONG SQL SERVER. Cảm ơn các bạn đã theo dõi bài viết. Hãy để lại bình luận hoặc góp ý của bạn để phát triển bài viết tốt hơn. Đừng quên “Luyện tập – Thử thách – Không ngại khó”   Thông tin Kteam Đóng góp từ cộng đồng Lĩnh vực Khoá học Cộng đồng Kết nối với Kteam Kết nối với Kteam qua mạng xã hội Liên kết Chứng nhận Khi đăng ký, bạn đã đồng ý với Điều khoản sử dụng và Chính sách bảo mật của chúng tôi. Bạn đã có tài khoản? Đăng nhập Gửi phản hồi cho Kteam để giúp cải thiện website. Mọi thắc mắc mong muốn khóa học mới, lỗi website làm ảnh hưởng đến bạn. Đừng ngần ngại cho chúng tôi biết Gửi phản hồi × Để giúp Kteam duy trì hoạt động và phát triển nội dung. Bạn vui lòng tắt Adblock trên website www.howkteam.com nhé!","relevance":1},{"title":"Học SQL cơ bản nâng cao | 79 bài học lập trình SQL hay nhất","url":"http:\/\/vietjack.com\/sql\/","content":"[Học SQL cơ bản và nâng cao] SQL (là viết tắt của Structured Query Language – Ngôn ngữ truy vấn mang tính cấu trúc) được sử dụng để thực hiện các hoạt động trên các bản ghi được lưu trữ trong Database (Cơ sở dữ liệu), chẳng hạn như cập nhật các bản ghi, xóa các bản ghi, tạo và sửa đổi các bảng, … SQL chỉ là một ngôn ngữ truy vấn, chứ không phải là một Cơ sở dữ liệu. Để thực hiện các truy vấn SQL, bạn cần cài đặt bất cứ Cơ sở dữ liệu nào, như Oracle, MySQL, MongoDB, PostGres SQL, SQL Server, DB2, … Dưới đây là danh sách các bài hướng dẫn học SQL cơ bản và nâng cao: MỤC LỤC Loạt bài hướng dẫn của chúng tôi dựa một phần trên nguồn tài liệu của: Tutorialspoint.com Chú ý: Link các bài học ở menu bên trái. Nếu không xem được, vui lòng xem hướng dẫn tại đây Mọi người cho thể tham gia khóa học thứ 4 của vietjackteam vào cuối tháng 09\/2017 do anh Nguyễn Thanh Tuyền, admin vietjack.com trực tiếp giảng dạy tại Hà Nội. Chi tiết nội dung khóa học tham khỏa link : Khóa học Java.Các bạn học CNTT, điện tử viễn thông, đa phương tiện, điện-điện tử, toán tin có thể theo học khóa này. Khóa học cũng đưa 200 câu hỏi phỏng vấn java trên https:\/\/www.javatpoint.com\/corejava-interview-questions vào nội dung để giúp các bạn dễ dàng vượt qua kì phỏng vấn Mọi người có thể xem demo nội dung khóa học tại địa chỉ Video demo khóa học Offline Các bạn ở xa học không có điều kiện thời gian có thể tham dự khóa Java online để chủ động cho việc học tập. Thông tin khóa học tại Khóa học Java Online trên Udemy Follow fanpage của team https:\/\/www.facebook.com\/vietjackteam\/ hoặc facebook cá nhân Nguyễn Thanh Tuyền https:\/\/www.facebook.com\/tuyen.vietjack để tiếp tục theo dõi các loạt bài mới nhất về Java,C,C++,Javascript,HTML,Python,Database,Mobile.... mới nhất của chúng tôi. Các bài học SQL phổ biến khác tại VietJack: Các loạt bài khác: 160 bài học ngữ pháp tiếng Anh hay nhất 155 bài học Java tiếng Việt hay nhất 100 bài học Android tiếng Việt hay nhất 247 bài học CSS tiếng Việt hay nhất 197 thẻ HTML cơ bản 297 bài học PHP 85 bài học C# hay nhất 101 bài học C++ hay nhất 97 bài tập C++ có giải hay nhất 208 bài học Javascript có giải hay nhất Học tiếng Anh tại vietjack.com: 160 bài học ngữ pháp tiếng Anh hay nhất 160 bài tập ngữ pháp tiếng Anh hay nhất 72 bài ngữ pháp thực hành 50 tình huống tiếng Anh thông dụng 120 bí kíp luyện phần V TOEIC Trang web chia sẻ nội dung miễn phí dành cho người Việt. soạn văn lớp 8 , soạn văn lớp 9 , soạn văn lớp 10 , soạn văn lớp 11 , soạn văn lớp 12 , soạn văn lớp 6 , soạn văn lớp 7 , giải toán 6 , giải toán 7 , giải toán 8 , giải toán 9 , giải toán 10 , giải toán 11 , giải toán 12 , 66 Kim Hoa, Đống Đa, Hà Nội Phone: 01689933602 Email: vietjackteam@gmail.com 2015 © All Rights Reserved.","relevance":1}]}]}