{"collection":[{"query":"Internet vạn vật","description":"Muốn tìm hiểu về Internet vạn vật","sites":[{"title":"Bùng nổ xu hướng internet kết nối vạn vật - Tin Tức TTXVN","url":"http:\/\/www.baomoi.com\/bung-no-xu-huong-internet-ket-noi-van-vat\/c\/21434657.epi","content":"Tin Tức TTXVN 31\/01\/2017 08:13 GMT+7 4 đăng lại Internet Protocol Version 6 Internet World Stats Đưa Việt Nam Lương Thị Lệ Thủy Internet Of Thing Cisco Việt Nam Thế Anh\/TTXVN Công Ty Cổ Phần FPT Smart Home Vũ Hoàng Liên Hiệp Hội Internet Việt Nam Tập Đoàn VNPT Cisco Trương Gia Bình Trung Tâm Dữ Liệu Kết Nối Internet Cloud Computing I-Ốt Vnpt FPT Công Nghệ Thông Tin Số liệu của Công ty nghiên cứu thị trường Gartner, năm 2017, các công ty dự kiến sẽ chi 3,5 nghìn tỷ USD cho công nghệ thông tin, trong đó tập trung nâng cấp phần mềm và dịch vụ thay cho phần cứng. Đặc biệt, internet kết nối vạn vật (Internet of thing - IoT) sẽ là xu hướng trên toàn cầu. Không nằm ngoài trào lưu này, Việt Nam cũng nhanh chóng chuẩn bị cho thời kỳ bùng nổ của vạn vật kết nối qua internet.  Hội thảo giới thiệu giải pháp “iRoomateTM - Công nghệ cho Smart Home và An ninh” tại TP Hồ Chí Minh. Ảnh: Thế Anh\/TTXVN. Xu thế công nghệ tiềm năng Khái niệm internet kết nối vạn vật lần đầu tiên xuất hiện vào năm 1999. Nhưng phải hơn 10 năm sau, thế giới mới nhận thấy ảnh hưởng ngày càng sâu rộng của xu hướng này. Sau hội nghị thế giới về công nghệ thông tin (Internet Protocol version 6 - Giao thức mạng Internet thế hệ 6) lần thứ 4 diễn ra tại Pháp năm 2014, chủ đề internet vạn vật mới thực sự phổ biến trên thế giới. Tại Việt Nam, khái niệm này cũng đã trở thành cụm từ “hot” nhất, được giới công nghệ thông tin nhắc đến nhiều nhất trong mọi sự kiện công nghệ thông tin năm 2016. Các chuyên gia công nghệ nhận định rằng, trong tương lai, mọi đồ vật sẽ tích hợp phần mềm, cảm biến để có thể kết nối với nhau và tương tác với con người nhằm tạo nên một thế giới vạn vật kết nối internet. Điều này sẽ làm thay đổi cuộc sống của con người, giúp cuộc sống của chúng ta tiện lợi hơn từ những kết nối thông minh. Nhận định về xu thế công nghệ trong tương lai, Chủ tịch Hội đồng quản trị Công ty Cổ phần FPT Trương Gia Bình khẳng định: Internet kết nối vạn vật là một xu thế công nghệ đầy tiềm năng. Việt Nam không thể đứng ngoài cuộc chơi chung của toàn cầu. Hiện nay, FPT đang nghiên cứu một số giải pháp về vạn vật kết nối internet như thành phố thông minh (smart city); giao thông thông minh (các hệ thống quản lý cơ bản như hệ thống điều khiển tín hiệu giao thông, hệ thống quản lý container, bảng hiệu thông báo, nhận dạng biển số tự động…), trung tâm điều khiển thiết bị gia đình (smart home), xây dựng nền tảng cung cấp các dịch vụ giải pháp cho vạn vật kết nối… Đặc biệt, FPT đã triển khai các dự án vạn vật kết nối trong lĩnh vực chăm sóc sức khỏe. Kết nối internet đang mở rộng phạm vi, không chỉ giữa con người với nhau, mà còn với thiết bị, qui trình, dữ liệu, giữa các đồ vật với nhau. Hiện giờ là thời đại của internet liên kết mọi vật. Giá trị thu được từ các kết nối quan trọng hơn số sự vật được kết nối, bởi nó đem đến cơ hội tăng trưởng kinh tế cho các quốc gia, phát triển kinh doanh cho các doanh nghiệp, kiếm tiền cho các nhà phát triển, những trải nghiệm vô giá cho người dùng. Công nghệ và Internet thực sự đã tác động và có sức ảnh hưởng lớn tới mọi ngóc ngách, khía cạnh của cuộc sống cũng như thay đổi thói quen hành vi của con người, của lao động và giải trí, thậm trí cả những quan niệm, giá trị văn hóa. Tập đoàn Cisco - nhà cung cấp giải pháp và thiết bị công nghệ thông tin cũng cho biết: Vào năm 1984 (khi Cisco mới thành lập) chỉ có khoảng 1.000 thiết bị được kết nối mạng toàn cầu, đến năm 2010, con số này đã lên tới 10 tỷ. Tổng Giám đốc Cisco Việt Nam, bà Lương Thị Lệ Thủy nhấn mạnh: Đảm bảo an ninh khi công nghệ vạn vật kết nối internet được triển khai sâu rộng là điều mà các nhà quản lý và các doanh nghiệp công nghệ thông tin cần tính đến. Trung tâm dữ liệu và điện toán đám mây là yếu tố quyết định sự thành công khi vận hành. Thời điểm này, internet kết nối vạn vật đang tạo ra một thị trường mới. Những doanh nghiệp mới, với các mô hình kinh doanh, cách tiếp cận và giải pháp mới sẽ xuất hiện. Những bước phát triển này sẽ chắc chắn mang lại nhiều cơ hội nhưng cũng không ít thách thức đối với các doanh nghiệp công nghệ thông tin của Việt Nam nói riêng và trên toàn cầu. Internet thay đổi cách sống hàng ngày Đại diện Tập đoàn VNPT chia sẻ: Xu hướng internet vạn vật kết nối sẽ làm thay đổi cách chúng ta sống hàng ngày. Hiện VNPT đã triển khai mô hình nông nghiệp thông minh tại các tỉnh Đắk Lắk và Đắk Nông nhằm giúp bà con nông dân cảnh báo dấu hiệu dịch bệnh, thông báo các thời điểm cần bón phân và tưới nước... Đó là những lợi ích thiết thực mà xu hướng này mang lại cho người dân. Tại Việt Nam, xu hướng internet vạn vật kết nối đã hình thành làn sóng công nghệ mới, tạo đột phá trong lĩnh vực thu thập, phân tích và xử lý dữ liệu. Theo thống kê hiện tại mới có khoảng 11-13 tỷ thiết bị được kết nối, và con người đang trong quá trình tiếp theo để kết nối những gì chưa được kết nối. Do đó có thể khẳng định, tiềm năng của công nghệ internet kết nối vạn vật là rất lớn. Ông Vũ Hoàng Liên, Chủ tịch Hiệp hội Internet Việt Nam, chia sẻ: Xu hướng internet vạn vật kết nối rất gần gũi với chúng ta trong cuộc sống hàng. Tùy theo nhu cầu và hoàn cảnh, người dùng có thể lựa chọn những ứng dụng của xu hướng này để phục vụ cho cuộc sống. Chắc chắn rằng xu hướng này sẽ làm thay đổi cách sống của mọi người trong tương lại không xa... Theo ước tính của các chuyên gia công nghệ thông tin, cuộc cách mạng internet vạn vật kết nối sẽ chứng kiến gần 50 tỷ thiết bị được kết nối internet vào năm 2020, tương đương với việc mỗi người trên thế giới sẽ có 6 thiết bị kết nối. Việt Nam đang nhanh chóng đẩy mạnh phát triển công nghệ để hiện thực hóa mục tiêu trở thành một quốc gia số","relevance":1},{"title":"Internet of Things - IoT hay Mạng lưới vạn vật kết nối là gì?","url":"https:\/\/quantrimang.com\/internet-of-things-iot-hay-mang-luoi-van-vat-ket-noi-la-gi-131856","content":"Internet of Things (IoT) là một hệ thống các thiết bị máy tính, máy móc, vật thể, động vật hoặc người có liên quan đến nhau, được cung cấp định danh duy nhất và có khả năng để truyền dữ liệu qua mạng mà không cần sự tương tác giữa con người với con người hay giữa con người với máy tính. Thing trong Internet of Things (Mạng lưới vạn vật kết nối) ở đây có thể là người có bộ cấy ghép để giám sát hoạt động của tim, một động vật với chip sinh học (có khả năng tự động nhận và truyền tín hiệu radio), một chiếc ô tô có bộ cảm biến lắp sẵn để cảnh báo cho người lái khi áp suất lốp thấp hoặc bất cứ vật thể nào khác trong tự nhiên hay do con người làm ra mà được gán một địa chỉ IP và có khả năng truyền dữ liệu qua mạng.  IoT bao gồm sự hội tụ đến đỉnh cao của công nghệ không dây, hệ thống cơ điện vi mô (MEMS), microservice (một kiểu kiến trúc phần mềm, chia phần mềm thành những dịch vụ rất nhỏ) và Internet. Điều này đã phá vỡ bức tường silo giữa công nghệ vận hành (OT) và công nghệ thông tin (IT), cho phép phân tích các dữ liệu phi cấu trúc để có được những hiểu biết, cải thiện hiệu quả hơn. Kevin Ashton, nhà đồng sáng lập và giám đốc điều hành của Auto-ID Center của MIT, là người đầu tiên đề cập đến Internet of Things trong bài thuyết trình cho Procter & Gamble vào năm 1999. Đây là cách Ashton giải thích về tiềm năng của Internet of Things (ở thời điểm năm 1999): \"Ngày nay, các máy tính - và do đó, cả Internet - hầu như hoàn toàn phụ thuộc vào con người để có được thông tin. Gần như tất cả 50 Petabyte (1 Petabyte bằng 1.024 Terabyte) dữ liệu trên Internet được ghi lại và tạo ra bởi con người bằng cách gõ phím, nhấn nút ghi, chụp ảnh kỹ thuật số hoặc quét mã vạch. Vấn đề là con người chỉ có thời gian, sự tập trung, tính chính xác ở mức độ giới hạn - nghĩa là con người không giỏi để nắm bắt dữ liệu về mọi thứ trong thế giới thực. Nếu chúng ta có máy tính có khả năng biết được mọi thứ - sử dụng dữ liệu chúng tự thu thập được mà không cần sự giúp đỡ của con người - chúng ta có thể theo dõi và đếm mọi thứ, giảm đáng kể sự lãng phí, tổn thất và cả chi phí. Chúng ta cũng biết được khi nào cần thay thế, sửa chữa, thu hồi lại mọi thứ và biết được trạng thái chính xác của chúng.\" Sự gia tăng không gian cho địa chỉ trong IPv6 là một yếu tố quan trọng trong việc phát triển Internet of Things. Theo Steve Leibson, việc mở rộng không gian địa chỉ có nghĩa là chúng ta có thể gán địa chỉ IPv6 đến mọi nguyên tử trên bề mặt trái đất mà vẫn còn đủ để làm như thế 100 lần nữa. Nói cách khác, con người có thể dễ dàng gán địa chỉ IP cho mọi thứ trên hành tinh. Sự gia tăng các nút (node) thông minh cũng như số lượng dữ liệu mà các nút tạo ra, dự kiến sẽ gây ra nhiều vấn đề liên quan đến bảo mật dữ liệu, bản quyền dữ liệu và tính an ninh. Trên thực tế, các ứng dụng của công nghệ IoT có thể được tìm thấy ở nhiều ngành công nghiệp, bao gồm nông nghiệp công nghệ cao, quản lý xây dựng, chăm sóc sức khỏe, năng lượng và vận tải. Mặc dù mãi đến năm 1999 khái niệm Internet of Things mới đươc gọi tên, nhưng công nghệ này đã được phát triển trong nhiều thập kỷ. Ví dụ, thiết bị Internet đầu tiên là máy Coke ở Carnegie Melon University vào đầu những năm 1980. Các lập trình viên có thể kết nối với máy thông qua Internet, kiểm tra trạng thái của máy và xem xem trong máy có đồ uống lạnh hay không. Nếu có đồ uống, họ sẽ đi đến đó để lấy. Hãy tưởng tượng rằng trong thời đại mà Internet of Things bùng nổ, bạn thậm chí có thể điều khiển mọi đồ đạc trong nhà mình chỉ bằng cử chỉ, ánh mắt, thậm chí suy nghĩ. Xe tự lái, bò nuôi trong chuồng không cần đến tận nơi kiểm tra mà cũng biết sức khỏe của nó, biết khi nào nó sẵn sàng cho sữa, cây cần nước sẽ tự tưới,... Lúc ấy chúng ta sẽ có nhiều thời gian hơn để chăm sóc sức khỏe, nghiên cứu những vấn đề cao siêu hơn như tìm đường đến các hành tinh khác.","relevance":1},{"title":"internet vạn vật: ​Nhiều lớp tập làm kỹ sư công nghệ cho học sinh - Tuổi Trẻ Online","url":"http:\/\/nhipsongso.tuoitre.vn\/internet-van-vat.html","content":"TTO - Câu lạc bộ Robotics - IoT (CLB) thuộc phòng thí nghiệm trí tuệ nhân tạo, Trường ĐH Khoa học Tự nhiên TP.HCM sẽ mở ra các khóa học về lập trình và sáng chế robot đa dạng dành cho các em từ lứa tuổi tiểu học cho đến đại học TTO - Tiến sĩ Timothy Chou ( \"bậc thầy\" trong lĩnh vực IoT trên thế giới) sẽ đến TP.HCM dự hội thảo \"Internet vạn vật: Nguyên lý, Thực thi và Giải pháp\" và giao lưu với sinh viên Đại học Bách Khoa (ĐHQG TP.HCM) vào ngày 5 và 6-5 © Copyright 2017 TUOITRE.VN, All rights reserved ® Tuổi Trẻ Online giữ bản quyền nội dung trên website này. Thông tin Toà soạn - Thông tin Thành Đoàn - Liên hệ Quảng cáo Điện thoại liên hệ: 0918.033.133","relevance":1},{"title":"Internet vạn vật: Las Vegas sắp trở thành đô thị thông minh tới mức… “viễn tưởng” | Dân trí","url":"http:\/\/dantri.com.vn\/internet-van-vat.tag","content":"Mọi hành động sử dụng nội dung đăng tải trên Báo điện tử Dân trí tại địa chỉ www.dantri.com.vn phải có sự đồng ý bằng văn bản của Báo điện tử Dân trí.  Đơn vị quảng cáo:   Hotline: 0942.86.11.33 Email: quangcao@admicro.vn Website: www.admicro.vn","relevance":1},{"title":"Internet vạn vật: Cách mạng công nghiệp 4.0: Nghề nào dễ bị mất việc? | soha.vn","url":"http:\/\/soha.vn\/internet-van-vat.html","content":"© Copyright 2010 - 2017 – Công ty Cổ phần VCCorp Tầng 17,19,20,21 Toà nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Email: btv@soha.vn Giấy phép số 2411\/GP-TTĐT do Sở Thông tin và Truyền thông Hà Nội cấp ngày 31 tháng 07 năm 2015. Chịu trách nhiệm nội dung: Ông Nguyễn Thế Tân Liên hệ quảng cáo: Hotline: 0942.86.11.33 Email: giaitrixahoi@admicro.vn Hỗ trợ & CSKH: Tầng 20, tòa nhà Center Building, Hapulico Complex, số 1 Nguyễn Huy Tưởng, phường Thanh Xuân Trung, quận Thanh Xuân, Hà Nội. Tel: (84 24) 7307 7979 Fax: (84 24) 7307 7980","relevance":1},{"title":"Internet vạn vật có thể gây rủi ro với hệ thống thông tin quan trọng của quốc gia - ICTNEWS","url":"http:\/\/ictnews.vn\/cntt\/bao-mat\/internet-van-vat-co-the-gay-rui-ro-voi-he-thong-thong-tin-quan-trong-cua-quoc-gia-154801.ict","content":"Trong Hội nghị Phổ biến pháp luật về an toàn thông tin mạng tổ chức tại Long An sáng nay 8\/6, Thứ trưởng Bộ Thông tin & Truyền thông Hoàng Vĩnh Bảo đã có bài phát biểu khai mạc. Thứ trưởng cho biết, trong những năm vừa qua, lĩnh vực công nghệ thông tin của Việt Nam đã có những bước phát triển vượt bậc, đóng góp ngày càng lớn vào quá trình xây dựng và phát triển đất nước. Việc ứng dụng công nghệ thông tin trong các hệ thống quan trọng như viễn thông, điện lực, tài chính, ngân hàng, các hệ thống điều khiển tự động trong các nhà máy, xí nghiệp đã trở nên hết sức quan trọng và không thể thay thế được. Quang cảnh Hội nghị Phổ biến pháp luật về an toàn thông tin mạng - Ảnh: H.Đ Sự ra đời và phát triển của Internet, Internet vạn vật đã thúc đẩy quá trình kết nối giữa các hệ thống thông tin của một quốc gia và giữa các quốc gia với nhau ngày một nhanh chóng. Điều này đã biến thế giới hiện nay trở thành một thế giới kết nối và đem lại rất nhiều lợi ích cho mọi mặt của đời sống. Tuy nhiên, chính sự kết nối này đã gây ra những nguy cơ, rủi ro gây mất an toàn thông tin đối với hầu hết người dùng. Nghiêm trọng hơn, các rủi ro này có thể xảy ra đối với các hệ thống thông tin quan trọng trong hầu hết các lĩnh vực, đặc biệt là các hệ thống thông tin quan trọng của quốc gia. Vì vậy, thách thức đặt ra cho công tác bảo đảm an toàn thông tin mạng sẽ ngày càng khó khăn và phức tạp, Thứ trưởng Hoàng Vĩnh Bảo nhấn mạnh. Trong bối cảnh đó, ngày 19\/11\/2015, Quốc hội đã thông qua Luật An toàn thông tin mạng. Việc ban hành luật đã góp phần hoàn thiện cơ sở pháp lý ổn định về an toàn thông tin theo hướng áp dụng các quy định pháp luật một cách đồng bộ, khả thi trong thực tiễn thi hành và phát huy các nguồn lực của đất nước để đảm bảo an toàn thông tin mạng. Sau Luật An toàn thông tin mạng, các văn bản dưới luật đã lần lượt được ban hành đóng vai trò tích cực trong việc hỗ trợ các cơ quan, tổ chức trong việc xác định cấp độ an toàn thông tin để đưa ra biện pháp bảo vệ phù hợp cho từng hệ thống thông tin. Trong đó phải kể đến Nghị định số 85\/2016\/NĐ-CP ngày 1\/7\/2016 về bảo đảm an toàn hệ thống thông tin theo cấp độ, Quyết định số 05\/2017\/QĐ-TTg ngày 16\/3\/2017 ban hành quy định về hệ thống phương án ứng cứu khẩn cấp đảm bảo an toàn thông tin mạng quốc gia và Quyết định số 632\/QĐ-TTg ban hành danh mục lĩnh vực quan trọng cầu công ty bảo đảm an toàn thông tin mạng và hệ thống thông tin quan trọng quốc gia. Đây là những văn bản quan trọng, có giá trị đối với các cơ quan quản lý, các doanh nghiệp hoạt động trong lĩnh vực an toàn thông tin mạng, thực hiện công tác ứng cứu sự cố đảm bảo an toàn thông tin mạng. Thứ trưởng Hoàng Vĩnh Bảo đã bày tỏ mong muốn các doanh nghiệp, cơ quan đơn vị của Việt Nam cần nhận thức đầy đủ hơn về sự cần thiết phải chuẩn bị các nguồn lực về kỹ thuật, con người để sẵn sàng phản ứng với các sự cố an toàn mạng. Đây không phải là nhiệm vụ của riêng cá nhân hay tổ chức nào mà cần có sự chia sẻ và phối hợp chặt chẽ từ các cơ quan chức năng và sự chung tay góp sức của các tổ chức, doanh nghiệp và cá nhân trong toàn xã hội. Hội nghị Phổ biến pháp luật về an toàn thông tin mạng do Bộ Thông tin & Truyền thông tổ chức, kéo dài trong một ngày 8\/6 tại Long An. Hội nghị có sự tham dự của nhiều sở, ngành tại Long An và các tỉnh lân cận khu vực phía Nam. Các lãnh đạo từ Vụ Pháp chế và Cục An toàn thông tin thuộc Bộ Thông tin & Truyền thông, và lãnh đạo Trung tâm Ứng cứu khẩn cấp máy tính Việt Nam (VNCERT) sẽ có các bài trình bày tại hội nghị nhằm phổ biến pháp luật về an toàn thông tin mạng. Hải Đăng Tương tác trực tiếp với ICTnews trên Facebook Bài viết chưa có bình luận nào. Bình luận của bạn đã được gửi và sẽ hiển thị sau khi được duyệt bởi ban biên tập. Ban biên tập giữ quyền biên tập nội dung bình luận để phù hợp với qui định nội dung của ictnews. ICTNEWS - Chuyên trang về CNTT của Báo điện tử Infonet - Giấy phép số: 605\/GP-BTTT cấp ngày 30\/12\/2016. Cơ quan chủ quản: Bộ Thông tin và Truyền thông. Tổng biên tập: Võ Đăng Thiên; Phó Tổng biên tập: Nguyễn Bá. Tòa soạn: Tầng 7, Tòa nhà Cục Tần số Vô tuyến điện, 115 Trần Duy Hưng, Quận Cầu Giấy, Hà Nội Hotline nội dung: 0888 911 911 - Email: toasoan@ictnews.vn Hotline quảng cáo - truyền thông: 0968331987 - Email: ad@ictnews.vn © Bản quyền thuộc Infonet. Không được phép sao chép khi chưa được chấp thuận bằng văn bản. Tòa soạn: Tầng 7, Tòa nhà Cục Tần số Vô tuyến điện, 115 Trần Duy Hưng, Quận Cầu Giấy, Hà Nội Điện thoại: 024 3 936 9966 - Fax: 024 3 936 9364 Hotline nội dung: 0888 911 911 - Email: toasoan@ictnews.vn Hotline quảng cáo: 0968331987 - Email: ad@ictnews.vn","relevance":1},{"title":"INTERNET VẠN VẬT | Tin tức thời sự mới, điểm nóng trong ngày | giadinh.net.vn","url":"http:\/\/giadinh.net.vn\/internet-van-vat.tag","content":"Bạn thích các tin tức trong chủ đề này? Hãy bình luận, gửi, chia sẻ với bạn bè nhé! 07\/07\/2017 08:00 Trong cuốn sách xuất bản năm 1999, Bill Gates đưa ra 15 dự đoán về các xu hướng phát triển của công nghệ mà hiện tại đã được chứng minh là chính xác. Tags: Kinh doanh điện tử, internet vạn vật, trợ lý ảo, Bill Gates, gia đình hitech 2008 © BẢN QUYỀN THUỘC VỀ BÁO ĐIỆN TỬ GIA ĐÌNH & XÃ HỘI. Cơ quan chủ quản: Tổng cục Dân số - Kế hoạch hóa gia đình (Bộ Y tế) Tổng biên tập: Lê Cảnh Nhạc Phó Tổng biên tập: Nguyễn Ngọc Đức, Trần Tuấn Linh Giấy phép hoạt động báo điện tử số 306\/GP-BTTTT cấp ngày 8\/6\/2016 Điện thoại: 04.22120681 | Fax: 04.8463556 Đường dây nóng: 0904852222 Trụ sở: Số 138A Giảng Võ, quận Ba Đình; Địa chỉ liên hệ: Tòa nhà Tổng cục DS-KHHGĐ, ngõ 8 đường Tôn Thất Thuyết, quận Nam Từ Liêm, TP Hà Nội Email: toasoan@giadinh.net.vn ® Mọi hình thức sao chép thông tin, hình ảnh phải có sự đồng ý bằng văn bản. Vui lòng dẫn “giadinh.net.vn” khi phát hành lại thông tin từ website này.","relevance":0},{"title":"Internet vạn vật (IoT) hoạt động như thế nào? - Tìm việc nhanh - Tuyển dụng & việc làm lập trình viên, IT","url":"http:\/\/smartjob.vn\/internet-van-vat-iot-hoat-dong-nhu-the-nao\/","content":"Internet vạn vật – Internet of things hay còn được biết đến với cái tên Internet of Everything (IoE), là tập hợp của tất cả các thiết bị có thể kết nối với các trang web, cho phép thu thập, gửi và xử lý thông tin ở môi trường xung quanh chúng. Các thiết bị này được tích hợp với các bộ cảm biến, bộ xử lý của máy tính và những phần mềm có thể tương tác với nhau. Các nhà khoa học gọi chúng là những thiết bị “được kết nối” hay những thiết bị “thông minh” (connected or smart devices). Dữ liệu từ “smart devices” được truyền tới các thiết bị khác tạo thành một quá trình được gọi là M2M (machine-to-machine).  Các thuật ngữ như Internet of Things hay M2M có lẽ không quá xa lạ với dân IT. Có rất nhiều cách định nghĩa về IoT và trên thực tế đây là một cụm từ khá trừu tượng nên không ít người không biết IoT hoạt động thế nào. Chúng ta hãy cùng đi tìm lời giải đáp. Ban đầu, các chuyên gia sẽ  tương tác với các tiện ích để cài đặt những thiết bị IoT, cung cấp cho các thiết bị đó những hướng dẫn, cách lấy dữ liệu. Các thiết bị sẽ tự hoạt động trong hầu hết các khâu mà không cần tới sự can thiệp của con người. Chẳng hạn một thiết bị thu thập dữ liệu về thời tiết, các chuyên gia sẽ cài đặt làm sao để chúng tự cập nhật được nhiệt độ, độ ẩm, áp suất,… mà người dùng không phải thực hiện bất cứ một thao tác nào khác. Chúng ta chỉ cần bật điện thoại, ấn vào icon là các thông số về thời tiết sẽ hiện ngay ra màn hình.  Xem thêm: dịch vụ vas, ứng dụng công nghệ thông tin Sự xuất hiện của những chiếc điện thoại thông minh cũng như mạng lưới internet trực tuyến đã dẫn đến sự ra đời của IoT. IoT tạo ra một lượng dữ liệu lớn trên Internet bao gồm các dữ liệu dùng để tạo ra các thiết bị hữu ích và cả phần lưu lượng được dùng cho những mục đích khác. Công nghệ này cho phép chúng ta tạo ra khối lượng thông tin không lồ trên thời gian thực tế, điều mà các nhà khoa học chưa từng làm được trước đó. Các bạn hoàn toàn có thể yên tâm khi ra khỏi nhà với những thiết bị giám sát; những tổ chức, doanh nghiệp sẽ cải thiện được quy trình làm việc, từ đó nâng cao sản lượng, tiết kiệm chi phí và giảm đáng kể các khoảng thời gian chết. Các thiết bị cảm biến trong thành phố có thể giúp giảm bớt tình trạng tắc nghẽn giao thông và cảnh báo chúng ta khi các công trình có nguy cơ sụp đổ. Hơn thế nữa, các thiết bị còn giúp chúng ta thay đổi điều kiện môi trường, cảnh báo về những thảm họa sắp xảy ra. Ngày nay, IoT đã xuất hiện ở mọi nơi trên thế giới và chúng ta hoàn toàn có thể đem công nghệ này áp dụng cho các dự án của mình. Bất kể bạn đang hoạt động trong lĩnh vực nào, đang gặp khó khăn gì thì IoT sẵn sàng giúp bạn giải quyết mọi thứ.  Phạm Bình (Theo howstuffworks.com) ","relevance":1},{"title":"Internet Vạn vật (IoT) - Cisco","url":"https:\/\/www.cisco.com\/c\/vi_vn\/solutions\/internet-of-things\/overview.html?stickynav=4","content":"IoT liên kết các đối tượng với Internet, kích hoạt dữ liệu và thông tin chuyên sâu chưa từng có trước đây. Tạo cơ hội doanh thu mới và giảm chi phí hoạt động bằng cách quản lý các thiết bị được kết nối của bạn. Giảm 15% chi phí 58% số lãnh đạo được hỏi nói rằng IoT có tính chiến lược đối với doanh nghiệp của họ 95% số lãnh đạo được khảo sát dự kiến khởi động doanh nghiệp IoT trong vòng 3 năm Nhà máy Mazak iSMART tập trung vào kết nối mở với cấp độ bảo mật cao nhất. Với xe hơi được kết nối, GM đang đổi mới trải nghiệm mà khách hàng có thể có với xe hơi của họ. Với một cơ sở hạ tầng mạng thông minh, bạn có thể cải thiện hoạt động. Tăng cường an toàn và bảo mật. Và nhận thông tin chuyên sâu về dữ liệu có giá trị để đơn giản hóa việc tự động hóa.       Sử dụng các dịch vụ của chúng tôi để chuyển đổi nhanh mạng hoạt động của bạn sang mạng ngành dựa trên IP. Giải quyết thách thức về hiện đại hóa lưới điện bằng phương pháp kiến trúc Lưới được Kết nối của Dịch vụ Cisco. Hợp tác với các nhà tư vấn chiến lược và kỹ thuật của chúng tôi để điều chỉnh việc quản lý bảo mật, tuân thủ và mối đe dọa cho phù hợp với mục tiêu kinh doanh của bạn. Nâng cao hiệu quả, giảm chi phí hỗ trợ và cải thiện tính khả dụng của mạng bằng các dịch vụ hỗ trợ sản phẩm đạt giải của chúng tôi. Có được thông tin chuyên sâu về chi phí hoạt động của dịch vụ được kết nối IoT. Luôn cập nhật thông tin về IoT bằng cách kết nối với blog về IoT để biết tin tức, xu hướng, sự kiện, v.v. Xem tất cả blog IoT   Các giải pháp IoT nâng cao cung cấp kết nối và bảo mật từ sương mù đến đám mây. Cisco IoT biến khái niệm chuyển đổi kỹ thuật số thành một thực tế trong nhà máy, vận tải và dịch vụ công cộng. Có cái nhìn toàn diện và kiểm soát mạng tự động trong ngành của bạn. Xem cách công nghệ IoT có thể giúp bạn hưởng lợi trong tự động hóa tại gia đình. Bạn đang tìm kiếm giải pháp từ đối tác của Cisco? Kết nối với hệ sinh thái đối tác của chúng tôi.","relevance":0},{"title":"Internet Vạn Vật (Internet of Thing) IoT từ góc nhìn phụ nữ | Tinhte.vn","url":"https:\/\/tinhte.vn\/threads\/internet-van-vat-internet-of-thing-iot-tu-goc-nhin-phu-nu.2694076\/","content":"Các tên cách nhau bởi dấu phẩy(,) Thảo luận trong 'Internet of Things (IoT)' bắt đầu bởi drhmthuyduong, 25\/4\/17. Trả lời: 1, Xem: 1651.","relevance":0},{"title":"Internet of Things - IoT hay Mạng lưới vạn vật kết nối là gì?","url":"https:\/\/quantrimang.com\/internet-of-things-iot-hay-mang-luoi-van-vat-ket-noi-la-gi-131856","content":"Internet of Things (IoT) là một hệ thống các thiết bị máy tính, máy móc, vật thể, động vật hoặc người có liên quan đến nhau, được cung cấp định danh duy nhất và có khả năng để truyền dữ liệu qua mạng mà không cần sự tương tác giữa con người với con người hay giữa con người với máy tính. Thing trong Internet of Things (Mạng lưới vạn vật kết nối) ở đây có thể là người có bộ cấy ghép để giám sát hoạt động của tim, một động vật với chip sinh học (có khả năng tự động nhận và truyền tín hiệu radio), một chiếc ô tô có bộ cảm biến lắp sẵn để cảnh báo cho người lái khi áp suất lốp thấp hoặc bất cứ vật thể nào khác trong tự nhiên hay do con người làm ra mà được gán một địa chỉ IP và có khả năng truyền dữ liệu qua mạng.  IoT bao gồm sự hội tụ đến đỉnh cao của công nghệ không dây, hệ thống cơ điện vi mô (MEMS), microservice (một kiểu kiến trúc phần mềm, chia phần mềm thành những dịch vụ rất nhỏ) và Internet. Điều này đã phá vỡ bức tường silo giữa công nghệ vận hành (OT) và công nghệ thông tin (IT), cho phép phân tích các dữ liệu phi cấu trúc để có được những hiểu biết, cải thiện hiệu quả hơn. Kevin Ashton, nhà đồng sáng lập và giám đốc điều hành của Auto-ID Center của MIT, là người đầu tiên đề cập đến Internet of Things trong bài thuyết trình cho Procter & Gamble vào năm 1999. Đây là cách Ashton giải thích về tiềm năng của Internet of Things (ở thời điểm năm 1999): \"Ngày nay, các máy tính - và do đó, cả Internet - hầu như hoàn toàn phụ thuộc vào con người để có được thông tin. Gần như tất cả 50 Petabyte (1 Petabyte bằng 1.024 Terabyte) dữ liệu trên Internet được ghi lại và tạo ra bởi con người bằng cách gõ phím, nhấn nút ghi, chụp ảnh kỹ thuật số hoặc quét mã vạch. Vấn đề là con người chỉ có thời gian, sự tập trung, tính chính xác ở mức độ giới hạn - nghĩa là con người không giỏi để nắm bắt dữ liệu về mọi thứ trong thế giới thực. Nếu chúng ta có máy tính có khả năng biết được mọi thứ - sử dụng dữ liệu chúng tự thu thập được mà không cần sự giúp đỡ của con người - chúng ta có thể theo dõi và đếm mọi thứ, giảm đáng kể sự lãng phí, tổn thất và cả chi phí. Chúng ta cũng biết được khi nào cần thay thế, sửa chữa, thu hồi lại mọi thứ và biết được trạng thái chính xác của chúng.\" Sự gia tăng không gian cho địa chỉ trong IPv6 là một yếu tố quan trọng trong việc phát triển Internet of Things. Theo Steve Leibson, việc mở rộng không gian địa chỉ có nghĩa là chúng ta có thể gán địa chỉ IPv6 đến mọi nguyên tử trên bề mặt trái đất mà vẫn còn đủ để làm như thế 100 lần nữa. Nói cách khác, con người có thể dễ dàng gán địa chỉ IP cho mọi thứ trên hành tinh. Sự gia tăng các nút (node) thông minh cũng như số lượng dữ liệu mà các nút tạo ra, dự kiến sẽ gây ra nhiều vấn đề liên quan đến bảo mật dữ liệu, bản quyền dữ liệu và tính an ninh. Trên thực tế, các ứng dụng của công nghệ IoT có thể được tìm thấy ở nhiều ngành công nghiệp, bao gồm nông nghiệp công nghệ cao, quản lý xây dựng, chăm sóc sức khỏe, năng lượng và vận tải. Mặc dù mãi đến năm 1999 khái niệm Internet of Things mới đươc gọi tên, nhưng công nghệ này đã được phát triển trong nhiều thập kỷ. Ví dụ, thiết bị Internet đầu tiên là máy Coke ở Carnegie Melon University vào đầu những năm 1980. Các lập trình viên có thể kết nối với máy thông qua Internet, kiểm tra trạng thái của máy và xem xem trong máy có đồ uống lạnh hay không. Nếu có đồ uống, họ sẽ đi đến đó để lấy. Hãy tưởng tượng rằng trong thời đại mà Internet of Things bùng nổ, bạn thậm chí có thể điều khiển mọi đồ đạc trong nhà mình chỉ bằng cử chỉ, ánh mắt, thậm chí suy nghĩ. Xe tự lái, bò nuôi trong chuồng không cần đến tận nơi kiểm tra mà cũng biết sức khỏe của nó, biết khi nào nó sẵn sàng cho sữa, cây cần nước sẽ tự tưới,... Lúc ấy chúng ta sẽ có nhiều thời gian hơn để chăm sóc sức khỏe, nghiên cứu những vấn đề cao siêu hơn như tìm đường đến các hành tinh khác.","relevance":1},{"title":"Internet kết nối vạn vật - PC World VN","url":"http:\/\/www.pcworld.com.vn\/articles\/cong-nghe\/cong-nghe\/2013\/11\/1234269\/internet-ket-noi-van-vat\/","content":"Nếu bạn nghĩ rằng việc kết nối các thiết bị hay sản phẩm số vẫn chiếm một tỉ lệ quá nhỏ trong cuộc sống hàng ngày của mình! Hãy nghĩ lại. Thực tế, xu hướng kết nối đang diễn ra từng ngày từng giờ với và trên quy mô toàn cầu. Theo số liệu của Cisco công bố, hiện tại có khoảng 99,4% số “đối tượng” trên thế giới vẫn không được “kết nối” lại với nhau. Mặc dù đây là mức có vẻ khôi hài. Tuy nhiên nếu nhìn nhận một cách nghiêm túc, bạn sẽ thấy rằng có 10 tỷ trên 1,5 ngàn tỷ đối tượng đang được kết nối. Nếu chia con số này đều trên dân số thế giới, mỗi người sẽ sở hữu khoảng 200 thứ sẽ có thể được kết nối đi đâu đó. Kết quả này cũng cho thấy tiềm năng cực lớn của việc kết nối những thứ vẫn đang đứng riêng lẻ.  Bên cạnh đó, kích thước thiết bị và linh kiện đang ngày càng nhỏ gọn và dễ tích hợp hơn. Những chiếc máy tính với kích thước chỉ bằng hạt gạo (1x1x1mm) đã có thể tích hợp đủ từ tế bào quang năng, pin mỏng, bộ nhớ, cảm biến áp suất, bộ thu phát tín hiệu không dây. Máy ảnh cùng kích thước có thể cho hình ảnh 250x250 còn cảm biến với kích thước bằng hạt bụi (0,05 x 0,005mm) có thể đánh giá và truyền thông tin về nhiệt độ, áp suất, chuyển động… Cuối cùng, IoE đã cho thấy tương lai lợi nhuận của doanh nghiệp đã chuyển dần sang khả năng khai thác hiệu quả các mô hình kết nối. Cụ thể hơn nữa, đó chính là khả năng tạo ra được tài sản trí tuệ dựa trên những kết nối đó. Các công ty trong giai đoạn mới sẽ khó lòng có thể chỉ dựa trên những yếu tố nội lực và kiến thức từ phía nhân lực. Thay vào đó, họ sẽ phải thu hút và tận dụng hiệu quả từ các nguồn bên ngoài. Điều này – chỉ có thể thực hiện được – thông qua IoE. Cơ hội trị giá 14,4 ngàn tỷ USD – sẽ thuộc về ai?   ","relevance":1},{"title":"Internet kết nối vạn vật - Báo Nhân Dân điện tử - Cửa sổ điện tử Báo Thời Nay","url":"http:\/\/www.nhandan.com.vn\/baothoinay\/baothoinay-hosotulieu\/item\/33092502-internet-ket-noi-van-vat.html","content":"(Tiếp theo & hết) Kỳ 2: Cuộc đua của các “đại gia”    Mặc dù đang ở giai đoạn “chớm nở” nhưng nền công nghiệp internet vạn vật (IoT) đang phát triển sôi động với sự gia nhập của các “đại gia” công nghệ thế giới như Google, Samsung, Apple, Intel, IBM, Microsoft… Trong lĩnh vực quân sự, cuộc đua này càng gay cấn hơn.    Tương lai của các phương tiện tự hành Lâu nay, ngành chế tạo ô-tô vốn là thế mạnh của các nhà sản xuất lớn tại Mỹ như Ford hay General Motors. Tuy nhiên, trong thời đại công nghệ số, các tập đoàn công nghệ cũng đang “lấn sân” sang ngành chế tạo xe hơi với sản phẩm xe tự hành (xe tự lái). Google là tập đoàn công nghệ đầu tiên tiến hành nghiên cứu xe tự hành cách đây tám năm. Đến nay, xe tự hành của Waymo (chi nhánh của Google) đã đi được hơn 3,2 triệu km. Sau Google, nhiều “ông lớn” công nghệ khác của Mỹ như Apple, Intel,... cũng quan tâm việc sản xuất xe tự hành. Trong thư đề nghị chính phủ tạo điều kiện phát triển xe tự hành cuối năm ngoái, Apple tiết lộ đã đầu tư mạnh vào lĩnh vực sản xuất này. Apple có kế hoạch tập trung phát triển hệ thống phần mềm và sẽ hợp tác với các đối tác sản xuất xe khác. Apple tin rằng, xe tự hành có thể làm giảm tình trạng tắc đường, ngăn hàng triệu vụ va chạm và cứu sống hàng nghìn người trong các vụ tai nạn do say xỉn và mất tập trung. Bên cạnh đó, loại xe này có tiềm năng mang lại những khoản lợi nhuận béo bở. Ngày 14-4 vừa qua, chính quyền bang California (Mỹ) đã cấp phép cho Tập đoàn Apple thử nghiệm công nghệ xe tự hành trên đường phố của bang này. Giới phân tích nhận định, Apple sẽ mất nhiều thời gian để bắt kịp công nghệ tự lái, song với 246 tỷ USD tiền đầu tư, Apple hoàn toàn có thể mua được công nghệ để đẩy nhanh chương trình đầy tham vọng của mình. Tại Hàn Quốc, Tập đoàn Samsung cũng nhận được sự chấp thuận từ Chính phủ Hàn Quốc để bắt đầu thử nghiệm công nghệ xe tự hành trên các tuyến đường công cộng trong nước. Theo mạng tin công nghệ TechCrunch, việc Samsung tham gia nghiên cứu và phát triển công nghệ xe tự hành là điều không quá bất ngờ, đặc biệt khi Samsung luôn là công ty “đầu tàu” trong lĩnh vực công nghệ cao. Năm 2015, Samsung tuyên bố tập trung nhiều nguồn lực phát triển công nghệ xe tự hành, trong đó hướng chủ yếu vào phát triển các bộ phận trên xe thay vì toàn bộ xe. Mục tiêu của công ty chính là nghiên cứu để tạo ra cả bộ cảm biến và bộ vi xử lý dành cho các nhà sản xuất ô-tô cũng như những đối tác khác trong tương lai. Bên cạnh đó công ty Hàn Quốc cũng phát triển phần mềm cho xe tự hành, bao gồm trí thông minh nhân tạo (AI) và thuật toán nâng cao... Theo AFP, nhiều hãng sản xuất ô-tô lớn và các nhóm công nghệ đang phát triển xe tự hành. Đây được coi là tương lai của ngành ô-tô với các mẫu đầu tiên dự kiến được đưa ra vào khoảng năm 2020.  Xe tự hành của Tập đoàn Google. Ảnh: AMAZONAWS IoT ứng dụng trong lĩnh vực quân sự Trong bối cảnh lực lượng khủng bố đang trỗi dậy khắp nơi, những kẻ cực đoan có thể đe dọa mạng sống người khác chỉ trong tích tắc với một cú “nhấp chuột”, việc xây dựng căn cứ quân sự sử dụng công nghệ thông minh sẽ cho phép bảo đảm an toàn hơn nhiều. Căn cứ quân sự thông minh sử dụng các công nghệ AI, IoT, máy móc tự động phân tích dữ liệu sẽ giúp tăng tốc và nâng cao chất lượng của các nhiệm vụ thực thi. Tất cả kết hợp lại, cùng thu thập và xử lý một lượng lớn dữ liệu, giúp các cấp chỉ huy ra quyết định hợp lý và kịp thời hơn cho các hoạt động của họ. Hiện nay, một số căn cứ quân sự của Mỹ và châu Âu đã ứng dụng công nghệ thông minh theo nhiều cách khác nhau. Thí dụ, căn cứ quân đội Mỹ ở bang Georgia mới khánh thành nhà máy năng lượng mặt trời, cho phép hoạt động độc lập với lưới điện địa phương, duy trì mọi hoạt động bình thường cho căn cứ trong trường hợp khẩn cấp. Căn cứ Fort Bragg ở bang Bắc Carolina (Mỹ) đang thử nghiệm các phương tiện vận chuyển không người lái để chuyển thương, bệnh binh trên tới các điểm cấp cứu. Ngoài việc tăng cường an ninh và giúp tiết kiệm năng lượng, IoT còn giúp cải thiện cuộc sống trong các căn cứ quân sự. Các thiết bị cảm biến có khả năng phân biệt nhân viên quân sự với các nhân công thời vụ; hỗ trợ điều tiết giao thông tránh tắc nghẽn trong giờ cao điểm buổi sáng hay khi những sự kiện công cộng lớn diễn ra. Các cảm biến trong thùng rác có thể giúp nhân viên thu dọn rác thải quản lý công việc tốt hơn; cảm biến trên các kệ hàng trong các cửa hàng tạp hóa của căn cứ thu thập dữ liệu giúp tự động hóa quá trình cung cấp quân nhu; công nghệ xây dựng và quy hoạch đô thị tiên tiến có thể giúp các căn cứ thiết kế những khu vực sử dụng hỗn hợp giảm được hàng triệu USD về chi phí tác động của môi trường thông qua việc xác định các khu vực có thể được tái sử dụng. Tại Ấn Độ, một ứng dụng start-up (khởi nghiệp) công nghệ có tên Tonbo Imaging chuyên cung cấp cho chính quyền New Delhi những công nghệ cho phép phát hiện và tái tạo hình ảnh các vật thể trong bất kỳ điều kiện môi trường nào. Công nghệ này cũng cho phép quân đội Ấn Độ thu được các thông tin tình báo có ý nghĩa sống còn đối với các cơ sở quân sự và tính mạng của quân nhân, đặc biệt là ở khu vực biên giới của nước này. Ngoài ra, Tonbo Imaging còn đang phát triển hệ thống tầm nhìn phục vụ công nghệ xe tự hành. Các ứng dụng của Tonbo Imaging cho phép những chiếc xe thông minh có thể phát hiện các chướng ngại vật, chạy trong địa hình sương mù, mưa, bão hay trong các điều kiện thời tiết xấu khác. Hiện tại, hãng Tesla Motors và Uber đã liên hệ chạy thử ứng dụng của Tonbo Imaging. Tuy nhiên, việc sử dụng các thiết bị công nghệ thông minh cũng tiềm ẩn những rủi ro khó lường. Tin tặc có thể làm lây nhiễm malware (phần mềm độc ","relevance":1},{"title":"Internet của vạn vật: Kết nối để đổi thay - doanhnhansaigon.vn","url":"http:\/\/www.doanhnhansaigon.vn\/van-de\/internet-cua-van-vat-ket-noi-de-doi-thay\/1094726\/","content":"Với doanh thu gần 1,1 tỷ USD, gấp 5 lần kinh phí sản xuất, siêu phẩm Transformers 4: Kỷ nguyên hủy diệt đã đứng đầu trong danh sách 10 phim có doanh thu cao nhất toàn cầu năm 2014. Sức hút khó cưỡng từ loạt phim khoa học viễn tưởng của đạo diễn Michael Bay nằm ở ý tưởng những robot có khả năng biến hình từ xe hơi sang người máy khổng lồ. Ý tưởng về một thế giới mà mọi thứ trong cuộc sống loài người kết nối internet để tương tác lẫn nhau được dựa trên khái nghiệm Internet of Things (IoT), xuất hiện lần đầu năm 1999 và sau đó được nhiều công ty công nghệ lớn trên thế giới nhắc lại trong thập kỷ gần đây. Cha đẻ của IoT - ông Kevin Ashton (nhà sáng lập Trung tâm Auto-ID tại Viện Công nghệ Massachusetts, Mỹ) từng giải thích, Internet of Things được hiểu đơn giản là viễn cảnh mà tất cả đồ vật trên thế giới, từ chiếc máy bay khổng lồ cho đến những vật dụng bình thường nhỏ bé trong cuộc sống, đều được kết nối, truyền tải, tương tác và trao đổi dữ liệu với nhau qua mạng internet. Khi đó, mỗi đồ vật sẽ được gán một mã nhận dạng, giống như địa chỉ IP trên hệ thống. Nhờ vậy, người dùng có thể tương tác, điều khiển và kiểm soát mọi thứ trong cuộc sống thông qua những thiết bị thông minh, như điện thoại thông minh, máy tính bảng... Mới đây, Hội nghị quốc tế \"Ứng dụng của Internet of Things cho đô thị thông minh và chất lượng cuộc sống\" đã đưa khái niệm IoT đến gần hơn với người dùng và đồng thời đề xuất nhiều giải pháp, khuyến nghị gửi đến cơ quan quản lý nhà nước, nhằm thúc đẩy hơn nữa việc triển khai và ứng dụng tại Việt Nam. Phạm vi ứng dụng công nghệ IoT thực sự rộng lớn và đa dạng, từ quản lý giao thông, quản lý đô thị, quản lý môi trường, ứng phó khẩn cấp đến mua sắm thông minh. Theo Công ty Nghiên cứu Thị trường IDC, thị trường IoT toàn cầu đạt gần 700 tỷ USD năm 2015 và dự kiến tăng trưởng kép (giá trị và số lượng) hàng năm (CARG) 17%. Khu vực châu Á - Thái Bình Dương là thị trường lớn nhất của IoT, chiếm tỷ trọng 40%, còn Nam Mỹ và Tây Âu lần lượt đứng vị trí thứ 2 và thứ 3, với tổng thị trường trị giá 250 tiỷ USD. Các thị trường này luôn đạt mức tăng trưởng kép hàng năm cao, trong đó ấn tượng nhất là thị trường Mỹ Latinh đạt 26,5%. >> Internet vạn vật bùng nổ Triển vọng trong vòng 3 năm tới, thị trường IoT sẽ đạt quy mô 1.300 tỷ USD trên toàn cầu. Hàng loạt các buổi hội thảo về xu hướng công nghệ IoT được tổ chức bởi các thương hiệu lớn ngành công nghệ như Cisco, Intel và sự vào cuộc của các tập đoàn trong nước, như MobiFone, DTT, Sao Bắc Đẩu. Sức hấp dẫn của công nghệ IoT nằm ở tính khả thi và khả năng thương mại hóa cao. Điển hình, đối với cá nhân, nền tảng IoTs có thể giúp quản lý các thiết bị cá nhân dễ dàng hơn. Ngôi nhà có thể được điều khiển, lập trình tự động khi trang bị các thiết bị thông minh, như tivi, hệ thống chiếu sáng, điều khiển cửa, tủ lạnh... Với thiết bị đeo tay cho phép theo dõi sức khỏe, bạn sẽ nhận được cảnh báo mỗi khi mở tủ lạnh lấy thêm nước ngọt hoặc bia rượu. Một chiếc bếp thông minh trên nền tảng IoT có thể báo cáo lượng nhiên liệu tiêu thụ, mức độ hư hỏng và đặt hàng linh kiện thay thế. Tủ lạnh thông minh có thể cập nhật số lượng, tình trạng thực phẩm và tự đặt hàng những nguyên liệu vừa hết. IoT sẽ giúp chúng ta thu thập dữ liệu và xử lý được nhiều công việc. Với viễn cảnh hàng tỷ thiết bị, đồ vật trên thế giới được kết nối internet, hình thành nên một hệ thống liên kết, IoT hứa hẹn sẽ thay đổi mạnh mẽ cách chúng ta sống và làm việc. Tại châu Âu, trong lĩnh vực giao thông công cộng, nhiều thành phố đã áp dụng công nghệ của Streetline để tìm vị trí đỗ xe. Hay tại Boston, các tài xế nhờ vào cảm biến gắn trên smartphone để xác định địa hình mặt đường và chọn vận tốc phù hợp. Hầu như các sản phẩm gắn mác “thông minh” đều có thể trở thành một phần trong IoT. Như vậy có thể thấy IoTs đã và đang xâm nhập mạnh vào cuộc sống con người. >> Thị trường nhà thông minh: Đích ngắm 20 tỷ USD Mặc dù đang ở giai đoạn chớm nở nhưng nền công nghiệp IoT đã khá sôi động với sự gia nhập của Google, Samsung, Apple, Intel, IBM, Microsoft… Theo Cisco, năm 1984, thế giới mới chỉ có 1.000 thiết bị được kết nối internet thì đến năm 2010, đã đạt hơn 10 tỷ thiết bị và dự đoán đến năm 2020, sẽ có đến 50 tỷ thiết bị. Xét về mặt cơ cấu ngành nghề, sản xuất và giao thông vận tải là 2 lĩnh vực ứng dụng IoT lớn nhất, với quy mô thị trường năm 2015 lần lượt là 165,6 tỷ và 78,7 tỷ USD. Bởi vì, trong 2 lĩnh vực này, doanh nghiệp rất cần kết nối với chuỗi cung ứng, sản phẩm, khách hàng và cả những công nhân đang làm việc trong các nhà máy. Tuy nhiên, các ngành khác như bảo hiểm (31,8% CAGR), chăm sóc sức khỏe và tiêu dùng dự đoán sẽ có mức tăng trưởng kép hàng năm cao nhất. Tại Việt Nam, IoT cũng đã hiện diện với nhiều cấp độ khác nhau và các tập đoàn nước ngoài, như Samsung, Dell, IBM, Microsoft, Google, Intel, đã giới thiệu hàng loạt dự án sản phẩm, giải pháp. Ở cấp độ khác, nhiều công ty đã đưa ra giải pháp ứng dụng dựa trên nền tảng IoT, như FPT hay BKAV với hệ thống nhà thông minh SmartHome. IoT đang phát triển nhanh chóng, vượt dự đoán của nhiều chuyên gia và thâm nhập vào mọi mặt đời sống sản xuất của con người. Ví dụ, một số công ty cung cấp giải pháp nền tảng ","relevance":0},{"title":"Internet của vạn vật IoT (Internet of Things) Archives - Cộng đồng đam mê Internet of Things IoT (Vạn vật kết nối) & AI (Trí tuệ nhân tạo) Việt Nam","url":"https:\/\/iotvietnam.com\/category\/internet-cua-van-vat-iot-internet-of-things\/","content":"","relevance":1},{"title":"Internet của vạn vật - VnExpress","url":"https:\/\/vnexpress.net\/internet-cua-van-vat\/tag-176640-1.html","content":"IoT đang 'thâm nhập vào Việt Nam theo cách đặc biệt' Sẽ có hơn 50 tỷ thiết bị kết nối vào năm 2020 Hoa hậu đẹp nhất thế giới 2016 mặc áo dài hình hang động Quảng Bình Ariska Putri Pertiwi tạo dáng với tà áo dài vàng rực khi tham quan cùng các thí sinh Miss Grand International 2017. ... Ngọc Huyền trong vòng vây fan tại sân bay Người hâm mộ mừng nghệ sĩ cải lương từ Mỹ về TP HCM sau khi được cấp phép biểu diễn. Ngôi chùa có đàn khỉ hoang dã lớn nhất Việt Nam Thiền viện Trúc lâm Chân Nguyên (Bà Rịa - Vũng Tàu) được biết đến là nơi giữ kỷ lục về đàn khỉ thiên nhiên nhiều ... Trang chủ Tìm kiếm Trang chủ Tải VnExpress App Thuộc Bộ Khoa học Công nghệ. © Copyright 1997 VnExpress, All rights reserved. ® VnExpress giữ bản quyền nội dung trên website này. VnExpress tuyển dụng Liên hệ: Quảng cáo \/ Tòa soạn Đường dây nóng: 0123.888.0123 (HN) - 0129.233.3555 (TP HCM) © Copyright 1997 VnExpress, All rights reserved ® VnExpress giữ bản quyền nội dung trên website này.","relevance":0},{"title":"Việt Nam có cơ hội từ Internet kết nối vạn vật","url":"http:\/\/www.thesaigontimes.vn\/138731\/Viet-Nam-co-co-hoi-tu-Internet-ket-noi-van-vat.html","content":"Việt Nam có cơ hội từ Internet kết nối vạn vật Vân Ly (TBKTSG Online) - Việt Nam còn nhiều việc phải làm để tận dụng cơ hội từ môi trường kết nối internet mang lại, theo các chuyên gia tại hội thảo Ngày Internet Việt Nam 2015 diễn ra vào ngày 19-11 tại Hà Nội. Xu hướng Internet kết nối vạn vật (Internet of things - IoT) là chủ đề chính được Hiệp hội internet lấy cho sự kiện Ngày Internet Việt Nam 2015. IoT là xu hướng đang diễn ra trên toàn thế giới. Với xu hướng này, internet không chỉ kết nối con người mà còn kết nối ngày càng nhiều các thiết bị, máy móc... Các giải pháp về xu hướng IoT đã xuất hiện tại Việt Nam như giải pháp nhà thông minh (các thiết bị trong ngôi nhà như ti vi, máy điều hòa, nồi cơm điện... được kết nối với internet để chủ nhân có thể điều khiển từ xa qua mạng internet), giao thông thông minh (mọi thiết bị trên đường như đèn giao thông, đèn đường đều có cảm biến để điều khiển tự động từ xa qua kết nối internet theo lưu lượng và mật độ giao thông)... Cơ hội cho Việt Nam từ IoT Theo Hiệp hội Internet Việt Nam, hiện thế giới có 8 tỉ thiết bị kết nối internet, nhưng đến năm 2020 con số này sẽ tăng lên 80 tỉ do xu hướng IoT phát triển mạnh. Trên thế giới, xu hướng này dự kiến sẽ mang lại các giá trị tương đương 19.000 tỉ đô la Mỹ trong 10 năm tới. Xu hướng này cũng sẽ đem lại cơ hội chưa từng có cho các doanh nghiệp Việt Nam từ các ngành dịch vụ, nhà sản xuất thiết bị thông minh, đến các doanh nghiệp viễn thông, công nghệ thông tịn... Ông Thiều Phương Nam, Tổng giám đốc Qualcomm khu vực Đông Dương, cho rằng, xu hướng IoT tạo cơ hội lớn cho các doanh nghiệp Việt Nam, bởi xu hướng này sẽ tạo ra những phân khúc thị trường mới với các cơ hội ngang bằng cho cả doanh nghiệp Việt Nam lẫn nước ngoài. Cũng tại sự kiện trên, ông Trương Gia Bình, Chủ tịch Hội đồng quản trị của tập đoàn FPT, nói: “Với xu hướng này, lần đầu tiên các doanh nghiệp Việt Nam có cơ hội ngang bằng với doanh nghiệp trên thế giới.” Nếu nhìn vào thực tế của Việt Nam, có thể thấy điều ông Bình nói là hợp lý. Từ cách đây vài năm, Tập đoàn Công nghệ Bkav đã đầu tư nghiên cứu phát triển giải pháp nhà thông minh với các thiết bị và phần mềm điều khiển ngôi nhà qua mạng internet. Tất nhiên đây là xu hướng mới nên giá của giải pháp này còn cao, chưa phù hợp với số đông người dân. Ông Trương Gia Bình còn cho biết, hiện FPT đang cung cấp giải pháp bệnh viện thông minh tại Singapore. Theo đó, bệnh nhân tại bệnh viện có thể đeo một thiết bị như đồng hồ. Thông qua kết nối internet của thiết bị này và phần mềm tích hợp trong nó, bác sĩ có thể theo dõi tình trạng sức khỏe của bệnh nhân 24 giờ trong ngày... Đây là một trong những cơ hội mà FPT có được từ xu hướng IoT. Thách thức và rào cản Vì sao FPT không triển khai giải pháp bệnh viện thông minh nêu trên tại Việt Nam mà lại là Singapore? Ông Bình cho biết để có thể triển khai giải pháp trên cần sự sẵn sàng về hạ tầng y tế mà tại Việt Nam chưa có điều này. FPT triển khai giải pháp tại Singapore vì cần môi trường bệnh viện hiện đại để làm ra được sản phẩm tốt nhất có thể, sau đó mới đem sản phẩm, mô hình tương tự triển khai tại các quốc gia khác hoặc Việt Nam. Có thể tiêu chuẩn và chức năng của giải pháp được bớt đi để phù hợp với yêu cầu và điều kiện của Việt Nam. Ông Thiều Phương Nam cho rằng, xu hướng IoT tạo cơ hội rất lớn cho các doanh nghiệp Việt Nam nhưng đi kèm với nó cũng là thách thức. Xu hướng này làm cho thế giới không còn biên giới giữa các quốc gia. Do đó, đối thủ và thị trường của các doanh nghiệp Việt Nam là cả thế giới, phải cạnh tranh toàn cầu. Thực tế cho thấy, các doanh nghiệp Việt Nam khó mà cạnh tranh được với các doanh nghiệp nước ngoài trên thị trường toàn cầu, nhất là ở những thị trường đòi hỏi cao về chất lượng sản phẩm, dịch vụ. Nhưng nếu biết chọn lọc thì tại một số thị trường, doanh nghiệp Việt sẽ có lợi thế. Ông Bình cho rằng, doanh nghiệp Việt có thể nghiên cứu những giải pháp cho xu hướng IoT (giao thông, bệnh viện thông minh) để triển khai ở nước mình hoặc một thị trường mà mình có lợi thế cạnh tranh. Theo ông Bình, hiện có nhiều quốc gia trên thế giới có điều kiện kiện kinh tế xã hội, giáo dục tương tự Việt Nam hoặc kém hơn như Sri Lanca, Bangladesh, Myanmar... họ sẽ cần những giải pháp kết nối internet thông minh, rẻ tiền, hiệu quả, mà doanh nghiệp Việt lại có lợi thế hơn với những giải pháp này. “Trong khi các tập đoàn lớn không quan tâm tới hợp đồng giá trị nhỏ tại các nước nghèo đang phát triển thì doanh nghiệp Việt Nam lại chấp nhận làm. Doanh nghiệp Việt có cơ hội dẫn dắt ở thị trường các nước đang phát triển có điều kiện tương tự hoặc kém hơn Việt Nam” ông Bình nói. Hiện Việt Nam có cơ hội trong xu hướng IoT không chỉ ở mảng cung cấp dịch vụ nêu trên. Ông Bình cho biết FPT còn hợp tác với tập đoàn Fujitsu của Nhật Bản để đưa giải pháp ứng dụng công nghệ thông tin và viễn thông trong nông nghiệp để nâng cao hiệu suất và chất lượng sản phẩm. Với giải pháp này thông qua mạng internet và phần mềm cùng thiết bị, việc tưới, bón phân... trong nông nghiệp được tự động hóa. Để dễ thuyết phục khách hàng hơn, hai đối tác trên định triển khai mô hình trồng cà chua trong nhà kính theo công nghệ của Fujitsu tại Hà Nội và TPHCM. Để triển khai mô hình này cần phải nhập máy móc và thiết bị nhà kính về từ Nhật Bản. Tuy nhiên, ông Bình cho biết FPT đã chạy đôn chạy đáo thủ tục nhập khẩu tới 6 tháng mà chưa xong do quy định quá rườm rà, phải chạy đi chạy lại nhiều. Ông Bình cho rằng cơ chế và thủ tục hành chính cũng là một rào cản gây khó khăn cho Việt Nam trong việc bắt nhịp với xu hướng IoT trong nông nghiệp - điều này cần được cải cách. Bên cạnh đó, ông Bình ","relevance":0},{"title":"Vạn vật kết nối: Internet of things - Xu hướng công nghệ của tương lai | VTV.VN","url":"http:\/\/vtv.vn\/van-vat-ket-noi.html","content":"TIN TỨC Tin Trong Nước Chính trị Xã hội Pháp luật Tin Thế Giới Tin tức Thế giới đó đây Kinh Tế Bất động sản Tài chính Thị trường VTV Truyền Hình Phim VTV Hậu trường Nhân vật Chuyển động 24h Vấn đề hôm nay Việt Nam & thế giới Góc khán giả ĐỜI SỐNG Văn Hóa - Giải Trí Điện ảnh Âm nhạc Đời sống Du lịch Làm đẹp Giới tính Sức khỏe Tấm lòng Việt THỂ THAO Bóng đá Việt Nam Bóng đá quốc tế Quần vợt Video Các môn khác Bên lề Góc doanh nghiệp Sản phẩm Doanh nghiệp Video KHÁC Công Nghệ Sản phẩm Thị trường Tư vấn Giáo Dục Tư vấn Học trực tuyến Hoạt động VTV Lịch Phát Sóng VTV.vn - Theo Giáo sư Timothy Chou, Internet of things (Internet vạn vật - IOT) sẽ tạo cơ hội lớn để ứng dụng các hệ thống dựa trên nền tảng máy tính trong nhiều lĩnh vực. TIN MỚI NHẤT Công nghệ18\/07\/2017 09:40 AM VTV.vn - Tuy chỉ nhỏ gọn trong lòng bàn tay, nhưng bạn có thể sử dụng ứng dụng này để điều khiển hầu hết các thiết bị trong nhà. Công nghệ07\/05\/2017 09:29 PM VTV.vn - Kỷ nguyên IOT mới ở giai đoạn đầu và cơ hội để dẫn đầu xu thế này chia đều cho tất cả các quốc gia, trong đó có Việt Nam. Kinh tế06\/05\/2017 04:39 PM VTV.vn - Internet kết nối vạn vật hay còn gọi là IoT đang và sẽ là xu hướng công nghệ phát triển mạnh mẽ trong thời gian tới. Công nghệ06\/03\/2017 06:18 PM VTV.vn - Trong thế giới mạng 5G, mọi thứ đều được kết nối. Thử nghiệm 5G đầu tiên sẽ được tiến hành trong năm nay. Công nghệ07\/02\/2017 09:57 AM VTV.vn - Theo các chuyên gia, số lượng thiết bị kết nối càng lớn, nguy cơ tấn công càng cao, cơ hội sẽ càng mở rộng cho các doanh nghiệp khởi nghiệp trong lĩnh vực bảo mật. Công nghệ19\/01\/2017 12:06 PM VTV.vn - Một nhóm các bạn trẻ đã tạo ra sản phẩm vườn rau thông minh bằng ứng dụng công nghệ Internet kết nối vạn vật. Công nghệ07\/07\/2016 03:30 PM VTV.vn - Internet of Things - mạng lưới \"Vạn vật kết nối\" được dự báo có thể thay đổi hoàn toàn công việc, cuộc sống và xã hội con người trong tương lai. HOẠT ĐỘNG VTV | LIÊN HỆ CƠ QUAN CHỦ QUẢN: ĐÀI TRUYỀN HÌNH VIỆT NAM CƠ QUAN BÁO CHÍ: BÁO ĐIỆN TỬ VTV NEWS Giấy phép hoạt động báo chí điện tử số 306\/GP-BTTTT cấp ngày 22\/02\/2012. ® Cấm sao chép dưới mọi hình thức nếu không có sự chấp thuận bằng văn bản. Ghi rõ nguồn VTV.vn khi phát hành lại thông tin từ website này. Tổng Biên tập: Vũ Thanh Thủy Phó Tổng Biên tập: Phạm Quốc Thắng Tổng đài VTV: (024) 3.8355931; (024) 3.8355932 Ðiện thoại Báo điện tử VTV: (024) 66897 897 Email: toasoan@vtv.vn","relevance":0},{"title":"VẠN VẬT KẾT NỐI INTERNET, tin tức Mới nhất Internet of Things: Kỷ nguyên tương lai khi kể cả một mớ rau cũng được lắp cảm biến! - Đọc tin tuc tại Kenh14.vn","url":"http:\/\/kenh14.vn\/van-vat-ket-noi-internet.html","content":"Kenh14.vn rất hoan nghênh độc giả gửi thông tin và góp ý cho chúng tôi. trụ sở hà nội Tầng 20, tòa nhà Center Building, Hapulico Complex, số 1 Nguyễn Huy Tưởng, p. Thanh Xuân Trung, quận Thanh Xuân, Hà Nội. Điện thoại: 024.39743410, máy lẻ 230. trụ sở tp.hồ chí minh Tầng 6 Tòa nhà 123, 123 Võ Văn Tần, phường 6, quận 3, Tp. HCM Điện thoại: 028.73077979, máy lẻ 216 chịu trách nhiệm quản lý nội dung Bà Nguyễn Bích Minh hợp tác nội dung 024.730.7797 (máy lẻ 62362) liên hệ quảng cáo 0942 86 11 33 Chính sách bảo mật © Copyright 2007 - 2017 – Công ty Cổ phần VCCorp Tầng 17, 19, 20, 21 Tòa nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Giấy phép số 1082\/GP-STTTT do Sở Thông tin và Truyền thông Hà Nội cấp ngày 16 tháng 4 năm 2014","relevance":1},{"title":"Ứng dụng Internet vạn vật vào trồng lúa, chăn bò","url":"http:\/\/vietnamnet.vn\/vn\/cong-nghe\/ung-dung\/ung-dung-internet-van-vat-vao-trong-lua-chan-bo-369581.html","content":"- Có thể bạn đã từng nghe về khái niệm IoT hay Internet of Things (Internet Vạn vật) với khả năng ứng dụng vào công nghệ cao như robot thay thế con người, xe hơi tự hành hay thành phố thông minh, giao thông thông minh… Nhưng không chỉ có vậy, IoT cũng có thể áp dụng vào những lĩnh vực rất gần gũi với đời sống hàng ngày của chúng ta, chẳng hạn như chăn nuôi gia súc hay canh tác nông trại.  Giảm chi phí nhưng tăng hiệu quả Bạn đã quen với các công ty công nghệ trong lĩnh vực tiêu dùng như Google, Uber… Nhưng IoT còn có tiềm năng làm điều tương tự cho cả các lĩnh vực như nông nghiệp, y tế, điện, giao thông, nước và nhiều hơn nữa.  Trong cuốn sách có tên PRECISION - CHÍNH XÁC, được coi là “cẩm nang về IoT” của tác giả Timothy Chou, việc ứng dụng IoT vào nông nghiệp được minh họa rất trực quan. Với các nông trại ngũ cốc rộng lớn nhiều hec-ta tại Mỹ, việc gieo hạt bằng máy móc đã giúp giải phóng sức lao động rất nhiều. Nhưng khi áp dụng IoT vào các máy gieo hạt này, hiệu quả còn được tăng cao hơn nhờ việc xác định được việc gieo hạt ở độ sâu nào trong đất là phù hợp nhất. Nếu sâu quá, cây non sẽ khó phát triển, nếu nông quá, tỉ lệ hạt giống bị các loại chim bới ra ăn sẽ cao lên rất nhiều.  Tiến sĩ Timothy Chou cũng dẫn chứng việc canh tác nông nghiệp chính xác thông qua ứng dụng IoT sẽ giúp giảm thiểu chi phí về nhiên liệu vận hành máy móc, phân bón, thuốc trừ sâu… Các trạng thái về độ ẩm của đất hay mức độ phát triển của cây, mức độ sâu bệnh cũng được giám sát bằng các hệ thống cảm biến, liên tục gửi dữ liệu về hệ thống máy tính giám sát. Nhờ quá trình phân tích những dữ liệu được thu thập liên tục hàng ngày hàng giờ từ cánh đồng, các máy rải phân bón hay phun thuốc trừ sâu sẽ được điều chỉnh để giảm thiểu được lượng phân bón hay thuốc trừ sâu cần sử dụng, từ đó giảm được chi phí đầu tư. Trong một bài báo trên Irish Technews, tiến sĩ Chou dẫn chứng về trường hợp Nick August, chủ nông trang August Farms ở Mỹ là một “nông dân chính xác” trong canh tác nông nghiệp. Ông Nick ước tính được rằng việc sử dụng các máy móng nông nghiệp chính xác đã giúp ông giảm lượng xăng cần để vận hành máy móc từ 60 lít\/hecta xuống chỉ còn 5,9 lít\/hecta. Một con số quá ấn tượng. Nhưng quan trọng hơn, Nick giảm được lượng phân bón và thuốc trừ sâu cần phải sử dụng so với trước khi áp dụng các công nghệ chính xác, giúp cây trồng tăng trưởng tốt hơn nhưng giảm được lượng hóa chất tồn dư trong nông sản, từ đó tạo ra sản phẩm tốt cho sức khỏe người dùng, đồng thời giảm thiểu được tác hại của hóa chất đối với môi trường nông trại của ông. Hiệu quả từ máy móc thu hoạch chính xác  Trong cuốn sách PRECISION - CHÍNH XÁC, Tiến sĩ Chou cũng giới thiệu về khả năng ứng dụng các máy thu hoạch chính xác, có thể lên phương án thu hoạch hiệu quả nhất trên cánh đồng từ việc máy móc phải di chuyển ít hơn, giảm tác động của máy làm tổn hại đất trồng. Các quy trình gặt, đập, sàng ngũ cốc được tích hợp trong cùng một máy gặt đập liên hợp không phải là điều mới mẻ ở các nông trại của Mỹ. Nhưng máy thu hoạch có thể kiểm soát mọi thông số thiết bị, tự hành theo bản đồ cánh đồng thông qua định vị GPS với sai số chỉ là 2 centimet, tích hợp dữ liệu sản lượng thu hoạch được tại từng vị trí lại là một câu chuyện hoàn toàn mới mẻ. Không chỉ đảm bảo các máy móc thu hoạch vận hành trong điều kiện tốt nhất để giảm thiểu hỏng hóc, các dữ liệu về năng suất cũng được tổng hợp và cập nhật liên tục về hệ thống phân tích IoT thông qua các dạng kết nối như 2G, 3G hoặc kết nối vệ tinh.  Với kết nối qua mạng di động, dữ liệu có thể được cập nhật 6 lần mỗi phút, nhưng nếu không có, máy sẽ tự động tổng hợp để gửi qua kết nối vệ tinh sau mỗi 12 tiếng. Ngoài ra, chủ nông trại cũng có thể sử dụng các kết nối đơn giản hơn như Bluetooh hoặc USB để tổng hợp dữ liệu.  Từ các dữ liệu về sản lượng và từ quá trình gieo trồng, chăm sóc, chủ nông trại cũng có thể phân tích để xác định chính xác hơn mức độ sử dụng phân bón và thuốc trừ sâu hiệu quả nhất, thời điểm và phương thức gieo hạt nào là hiệu quả nhất. Thông qua từng mùa vụ, các dữ liệu sẽ ngày càng được thu thập nhiều và phản ánh chính xác hơn tình trạng phát triển của nông sản. Chăn nuôi chính xác bằng trang trại thông minh IoT cũng được dẫn chứng trong việc giúp tăng hiệu quả cho các trang trại chăn nuôi gia súc, chẳng hạn như chăn bò. Thay vì việc thường xuyên phải kiểm tra sức khỏe định kỳ cho cả đàn bò hàng ngàn con, các chủ trang trại ở Úc đã đeo vào chân bò một chiếc vòng cảm biến có tuổi thọ pin lên tới 10 năm để giám sát sức khỏe của từng con. Chiếc vòng cảm biến có nhiệm vụ vô cùng đơn giản, đó là đếm số bước chân bò mỗi ngày, và liên tục gửi dữ liệu về hệ thống quản lý dữ liệu trung tâm của chủ trang trại thông qua các trạm thu phát tín hiệu không dây. Các trạm thu phát tín hiệu này được lắp đặt ở mọi khu vực trong trạng trại rộng lớn, đảm bảo không bỏ lọt bất kỳ con bò nào khỏi tầm kiểm soát. Từ các dữ liệu đếm bước chân được thiết bị cảm biến gửi về, hệ thống quản lý dữ liệu có thể phân tích, xác định được tình trạng sức khỏe của từng con bò, cũng như giới tính, thậm chí cả thời điểm bò cái bắt đầu mang thai. Những dấu hiệu bất thường đầu tiên về sức khỏe của bò sẽ thể hiện ngay qua số bước chân, và lập tức được giám sát chặt chẽ hơn.  Nhờ có các dữ liệu cập nhật liên tục này, người quản lý trang trại có thể xác định được chính xác vị trí của con bò đang ốm. Sau đó, bằng cách kiểm tra thông qua hệ thống camera hoặc đến quan sát trực tiếp, người chăn bò sẽ quyết định có gọi bác sĩ thú y đến hay không. Nhờ vậy, các chi phí về khám thú y định kỳ sẽ được giảm thiểu, chi phí nhân công chăn bò hàng ngày cũng được ti","relevance":1},{"title":"Ứng dụng của Internet vạn vật cho Thành phố thông minh","url":"http:\/\/www.vista.gov.vn\/UserPages\/News\/detail\/tabid\/73\/newsid\/15651\/seo\/Ung-dung-cua-Internet-van-vat-cho-Thanh-pho-thong-minh.aspx","content":"Đến nay, chúng ta chưa thể hình dung được tất cả các ứng dụng của Internet vạn vật (IoT)cũng nhưsự phát triển công nghệ và nhu cầu đa dạng của người sử dụng tiềm năng. Dưới đây chỉlà một số ứng dụng quan trọng có thể thấy được trong xây dựng Thành phố thông minh.  ","relevance":0},{"title":"technologyMag.net | Cổng thông tin Công nghệ & Máy móc Công nghiệp – Công ty TNHH Phương Bắc | Internet vạn vật Archives - technologyMag.net | Cổng thông tin Công nghệ & Máy móc Công nghiệp - Công ty TNHH Phương Bắc","url":"https:\/\/www.technologymag.net\/category\/cntt-va-truyen-thong\/internet-van-vat\/","content":"Những công nghệ dựa trên Internet of Things sẽ hỗ trợ đắc lực cho việc vận hành các ngôi nhà thông minh, mang tới nhiều tiện ích cho người dùng. Trí tuệ nhân tạo (artificial intelligence – AI) xuất hiện khắp mọi nơi Nó là thứ được sử dụng để trả lời email tự động trên Gmail, học cách lái Để có thể hiểu được một cách rõ ràng hơn về Internet Vạn vật (Internet of Things – IoT), chúng ta cần phải xem xét những khía cạnh rất cụ Hannover Messe 2017 – hội chợ hàng đầu thế giới về công nghệ và máy móc công nghiệp, là sự kiện thường niên được tổ chức bởi Deutsche Messe AG Hội chợ CeBIT 2017 – sự kiện thường niên lớn nhất và quan trọng nhất thế giới trong ngành Công nghệ thông tin và Truyền thông sẽ mở cửa tại Hannover Messe 2017 – hội chợ hàng đầu thế giới về công nghệ và máy móc công nghiệp, là sự kiện thường niên được tổ chức bởi Deutsche Messe AG Hội chợ CeBIT 2017 – sự kiện thường niên lớn nhất và quan trọng nhất thế giới trong ngành Công nghệ thông tin và Truyền thông sẽ mở cửa tại Hội chợ CeBIT 2017 – sự kiện thường niên lớn nhất và quan trọng nhất thế giới trong ngành Công nghệ thông tin và Truyền thông sẽ mở cửa tại Hội chợ CeBIT 2017 – sự kiện thường niên lớn nhất và quan trọng nhất thế giới trong ngành Công nghệ thông tin và Truyền thông sẽ mở cửa tại Internet vạn vật (Internet of Things – IoT) là khái niệm dùng để chỉ mọi thứ đều có thể được kết nối qua Internet, người dùng có thể điều khiển mọi Giới thiệu TechnologyMag Đối tác của chúng tôi Cộng tác với chúng tôi Các trang liên kết Liên hệ Câu hỏi thường gặp (FAQ) Đăng ký nhận bản tin Đăng tin bài miễn phí Đăng ký nhận tin bài miễn phí Chào bán sản phẩm tại technologyMAG Tiếp thị sản phẩm cùng chúng tôi © 2017 Copyright Technology Mag.","relevance":1},{"title":"SỬ DỤNG INTERNET VẠN VẬT (IoT) NHẰM TĂNG NĂNG SUẤT SẢN XUẤT THỰC PHẨM TRÊN TOÀN CẦU - Austrade","url":"https:\/\/www.austrade.gov.au\/local-sites\/vietnam\/news\/using-the-internet-of-things-to-increase-global-food-production","content":"For International You are here: Liên Hiệp Quốc đã tuyên bố nhu cầu cần thiết sử dụng các ý tưởng mới trong việc cung cấp thực phẩm cho toàn thế giới vào năm 2050. Doanh nhân người Australia tên Ros Harvey đã sử dụng IoT và những công nghệ mới nhằm giúp các nhà kinh doanh trong ngành nông nghiệp cải tiến sản phẩm một cách hiệu quả cũng như giảm lượng chất thải.  Ros Harvey là nhà sáng lập kiêm Giám đốc Điều hành công ty The Yield, một doanh nghiệp chuyên phân tích dữ liệu và IoT để cung cấp cho người nông dân cảm biến thông minh, phần mềm và dịch vụ nhằm biến dữ liệu môi trường phức tạp thành thông tin dễ sử dụng. Ros cũng là trợ giảng tại Viện Nghiên cứu Môi trường Tương lai của Đại học Công nghệ Queensland. Ros tin rằng công nghệ có thể cách mạng hóa việc sản xuất lương thực trên toàn cầu bởi điều kiện giám sát tại chỗ cho phép người trồng giảm thiểu rủi ro và đưa ra quyết định sáng suốt về thời điểm trồng, tưới tiêu, chăm sóc, bảo vệ và thu hoạch. Công nghệ này đã được kiểm chứng tại các nông trại hàu trên toàn Tasmania, sử dụng cảm biến để đo độ mặn, nhiệt độ nước và độ sâu của nước mỗi 10 phút. Thông tin này giúp người nuôi trồng thủy sản và cơ quan quản lý an toàn thực phẩm quản lý được rủi ro nhiễm bệnh của hàu và giảm công đoạn không cần thiết. Công nghệ tiên tiến của The Yield sử dụng IoT, nơi mà ngoài con người, máy móc cũng được kết nối internet. Công nghệ này đã được thừa nhận bởi các chính phủ và doanh nghiệp trên toàn thế giới trong đó có các nhà đầu tư từ Bosch, KPMG Australia và AgFunder. Ros giải thích “Những quyết định được thực hiện trên trang trại có thể có ảnh hưởng rất lớn đến thời hạn sử dụng, giảm chất thải trong quá trình sản xuất thừa và tối ưu hóa chuỗi cung ứng”. Bạn có thể tìm đọc toàn bộ bài viết tại đây và những công nghệ đổi mới sáng tạo khác của Australia tại đây. Hãy liên hệ với đội ngũ chuyên gia giàu kinh nghiệm về các ngành công nghiệp của chúng tôi hoặc gửi câu hỏi của bạn tới Austrade. Mẫu yêu cầu sản phẩm\/dịch vụ www.studyinaustralia.gov.au www.australia.com Contact Sign Up","relevance":1},{"title":"Phát triển công nghệ Internet vạn vật tại Việt Nam","url":"http:\/\/nhandantv.vn\/phat-trien-cong-nghe-internet-van-vat-tai-viet-nam-v39026","content":"Phát triển công nghệ Internet vạn vật tại Việt Nam  10\/10\/2017 09\/10\/2017 03\/10\/2017 02\/10\/2017 26\/09\/2017 25\/09\/2017 19\/09\/2017 18\/09\/2017 12\/09\/2017 11\/09\/2017 05\/09\/2017 04\/09\/2017 29\/08\/2017 28\/08\/2017 22\/08\/2017 Báo Nhân Dân thiết kế và giữ bản quyền. Trung tâm Truyền hình Nhân Dân Trụ sở Bộ biên tập: 71 Hàng Trống - Hà Nội P.Hành chính - Tổ Chức: 0432.669.533 - 01696.996.841 P.Truyền hình Internet: 0432.669.547 - 0912.207.322 Email: internet.tv@nhandantv.vn Xem NhanDan TV trên Youtube Bản quyền thuộc về Trung Tâm Truyền Hình Nhân Dân","relevance":1},{"title":"Mạng lưới vạn vật kết nối Internet – Wikipedia tiếng Việt","url":"https:\/\/vi.wikipedia.org\/wiki\/Mạng_lưới_vạn_vật_kết_nối_Internet","content":"Internet Vạn Vật, hay cụ thể hơn là Mạng lưới vạn vật kết nối Internet hoặc là Mạng lưới thiết bị kết nối Internet (tiếng Anh: Internet of Things, viết tắt IoT) là một liên mạng, trong đó các thiết bị, phương tiện vận tải (được gọi là \"thiết bị kết nối\" và \"thiết bị thông minh\"), phòng ốc và các trang thiết bị khác được nhúng với các bộ phận điện tử, phần mềm, cảm biến, cơ cấu chấp hành cùng với khả năng kết nối mạng máy tính giúp cho các thiết bị này có thể thu thập và truyền tải dữ liệu.[1][2][3] Năm 2013, tổ chức Global Standards Initiative on Internet of Things (IoT-GSI) đinh nghĩa IoT là \"hạ tầng cơ sở toàn cầu phục vụ cho xã hội thông tin, hỗ trợ các dịch vụ (điện toán) chuyên sâu thông qua các vật thể (cả thực lẫn ảo) được kết nối với nhau nhờ vào công nghệ thông tin và truyền thông hiện hữu được tích hợp,\"[3] và với mục đích ấy một \"vật\" là \"một thứ trong thế giới thực (vật thực) hoặc thế giới thông tin (vật ảo), mà vật đó có thể được nhận dạng và được tích hợp vào một mạng lưới truyền thông\".[4] Hệ thống IoT cho phép vật được cảm nhận hoặc được điều khiển từ xa thông qua hạ tầng mạng hiện hữu,[5] tạo cơ hội cho thế giới thực được tích hợp trực tiếp hơn vào hệ thống điện toán, hệ quả là hiệu năng, độ tin cậy và lợi ích kinh tế được tăng cường bên cạnh việc giảm thiểu sự can dự của con người.[6][7][8][9][10][11] Khi IoT được gia tố cảm biến và cơ cấu chấp hành, công nghệ này trở thành một dạng thức của hệ thống ảo-thực với tính tổng quát cao hơn, bao gồm luôn cả những công nghệ như điện lưới thông minh, nhà máy điện ảo, nhà thông minh, vận tải thông minh và thành phố thông minh. Mỗi vật đựoc nhận dạng riêng biệt trong hệ thống điện toán nhúng và có khả năng phối hợp với nhau trong cùng hạ tầng Internet hiện hữu. Các chuyên gia dự báo rằng Internet Vạn Vật sẽ ôm trọn chừng 30 tỉ vật trước năm 2020.[12] Về cơ bản, Internet Vạn Vật cung cấp kết nối chuyên sâu cho các thiết bị, hệ thống và dịch vụ, kết nối này mang hiệu quả vượt trội so với kiểu truyền tải máy-máy (M2M), đồng thời hỗ trợ da dạng giao thức, miền (domain), và ứng dụng.[13] Kết nối các thiết bị nhúng này (luôn cả các vật dụng thông minh), được kỳ vọng sẽ mở ra kỷ nguyên tự động hóa trong hầu hết các ngành, từ những ứng dụng chuyên sâu như điện lưới thông minh,[14] mở rộng tới những lĩnh vực khác như thành phố thông minh.[15][16] IoT là một kịch bản của thế giới, khi mà mỗi đồ vật, con người được cung cấp một định danh của riêng mình, và tất cả có khả năng truyền tải, trao đổi thông tin, dữ liệu qua một mạng duy nhất mà không cần đến sự tương tác trực tiếp giữa người với người, hay người với máy tính. IoT đã phát triển từ sự hội tụ của công nghệ không dây, công nghệ vi cơ điện tử và Internet. Nói đơn giảnlà một tập hợp các thiết bị có khả năng kết nối với nhau, với Internet và với thế giới bên ngoài để thực hiện một công việc nào đó.[17] Một vật trong IoT có thể là một người với một trái tim cấy ghép; một động vật ở trang trại với bộ chip sinh học; một chiếc xe với bộ cảm ứng tích hợp cảnh báo tài xế khi bánh xe xẹp hoặc bất kỳ vật thể tự nhiên hay nhân tạo nào mà có thể gán được một địa chỉ IP và cung cấp khả năng truyền dữ liệu thông qua mạng lưới. Cho đến nay, IoT là những liên kết máy-đến-máy (M2M) trong ngành sản xuất, công nghiệp năng lượng, kỹ nghệ xăng dầu.  Khả năng sản phẩm được tích hợp máy-đến-máy thường được xem như là thông minh[18] Với sự trợ giúp của công nghệ hiện hữu, các thiết bị này thu thập dữ liệu hữu ích rồi sau đó tự động truyền chúng qua các thiết bị khác.[19] Các ví dụ hiện thời trên thị trường bao gồm nhà thông minh được trang bị những tính năng như kiểm soát và tự động bật tắt đèn, lò sưởi (giống như bộ ổn nhiệt thông minh), hệ thống thông gió, hệ thống điều hòa không khí, và thiết bị gia dụng như máy giặt\/sấy quần áo, máy hút chân không, máy lọc không khí, lò nướng, hoặc tủ lạnh\/tủ đông có sử dụng Wi-Fi để theo dõi từ xa.[cần dẫn nguồn] Khi tự động hóa có kết nối internet được triển khai đại trà ra nhiều lãnh vực, IoT được dự báo sẽ tạo ra lượng dữ liệu lớn từ đa dạng nguồn, kéo theo sự cần thiết cho việc kết tập dữ liệu nhanh, gia tăng nhu cầu đánh chỉ mục, lưu trữ, và xử lý các dữ liệu này hiệu quả hơn. Internet Vạn Vật hiện nay là một trong các nền tảng của Thành phố Thông minh, và các Hệ thống Quản lý Năng lượng Thông minh.[20][21] Khái niệm \"the Internet of Things\" do Kevin Ashton làm việc tại Procter & Gamble, sau này là MIT's Auto-ID Center, giới thiệu vào năm 1999.[22]   Internet Vạn Vật (tiếng Anh, viết tắt: IoT) là thuật ngữ dùng để chỉ các đối tượng có thể được nhận biết (identifiable) cũng như chỉ sự tồn tại của chúng trong một kiến trúc mang tính kết nối. Cụm từ này được đưa ra bởi Kevin Ashton vào năm 1999. Ông là một nhà khoa học đã sáng lập ra Trung tâm Auto-ID ở đại học MIT, nơi thiết lập các quy chuẩn toàn cầu cho RFID (một phương thức giao tiếp không dây dùng sóng radio) cũng như một số loại cảm biến khác. IoT sau đó cũng được dùng nhiều trong các ấn phẩm đến từ các hãng và nhà phân tích.[23] \"Vạn Vật\", trong khái niệm này, có thể hướng đến đa dạng thiết bị như máy theo dõi nhịp tim, máy phát đáp vi mạch sinh học trên gia súc, loài ctenoides ales sinh sống tại vùng nước ven bờ biển,[24] xe hơi với cảm biến tích hợp, thiết bị phân tích ADN để quan sát môi trường\/thức ăn\/mầm bệnh,[25] hoặc thiết bị chuyên dụng để hỗ trợ lực lượng cứu hỏa trong hoạt động tìm kiếm cứu nạn.[26] Nhiệu luật gia gợi ý \"Vạn Vật\" nên được xem là \"một tổng thể không thể tách rời của phần cứng, phần mềm, dữ liệu và dịch vụ mạng\".[27] Năm 1999, Kevin Ashton đã đưa ra cụm từ Internet of Things nhằm để chỉ các đối","relevance":1},{"title":"Kỷ nguyên Internet kết nối vạn vật và cơ hội của Việt Nam | VTV.VN","url":"http:\/\/vtv.vn\/cong-nghe\/ky-nguyen-internet-ket-noi-van-vat-va-co-hoi-cua-viet-nam-20170507192623511.htm","content":"TIN TỨC Tin Trong Nước Chính trị Xã hội Pháp luật Tin Thế Giới Tin tức Thế giới đó đây Kinh Tế Bất động sản Tài chính Thị trường VTV Truyền Hình Phim VTV Hậu trường Nhân vật Chuyển động 24h Vấn đề hôm nay Việt Nam & thế giới Góc khán giả ĐỜI SỐNG Văn Hóa - Giải Trí Điện ảnh Âm nhạc Đời sống Du lịch Làm đẹp Giới tính Sức khỏe Tấm lòng Việt THỂ THAO Bóng đá Việt Nam Bóng đá quốc tế Quần vợt Video Các môn khác Bên lề Góc doanh nghiệp Sản phẩm Doanh nghiệp Video KHÁC Công Nghệ Sản phẩm Thị trường Tư vấn Giáo Dục Tư vấn Học trực tuyến Hoạt động VTV Lịch Phát Sóng Công nghệ Đăng nhập Đăng ký Ban Thời sự-Chủ nhật, ngày 07\/05\/2017 21:29 GMT+7 Internet vạn vật hay còn gọi là IOT đang và sẽ là xu hướng công nghệ phát triển mạnh mẽ trong thời gian tới. IOT hiểu một cách đơn giản là người dùng ở vị trí trung tâm, kết nối và điều khiển mọi thiết bị xung quanh mình bằng internet. TS. Timothy Chou, giảng viên đại học Stanford của Mỹ, một trong những \"bậc thầy\" về IOT trên thế giới, đã có các buổi nói chuyện tại Việt Nam 4 ngày qua. Theo ông, kỷ nguyên IOT mới ở giai đoạn đầu và cơ hội để dẫn đầu xu thế này chia đều cho tất cả các quốc gia, trong đó có Việt Nam. Theo TS Timothy Chou, IOT có rất nhiều tiềm năng ứng dụng trong nông nghiệp, y tế, may mặc, những ngành thế mạnh của Việt Nam. IOT sẽ tạo ra xu hướng kết nối tất cả máy móc lại với nhau thay vì chỉ tập trung phát minh thêm những sản phẩm, hay cỗ máy mới. Từ đó, nâng cao tính chính xác và hiệu quả công việc, tiết kiệm nhân lực. Lợi thế của Việt Nam trong kỷ nguyên IOT chính là nguồn nhân lực trẻ cùng đột phá về công nghệ thông tin. Các doanh nghiệp Việt Nam cần nhìn ra cơ hội kết nối toàn cầu, từ đó có phương án đầu tư sản xuất các sản phẩm IOT theo thế mạnh riêng. Ông nhận định, thay vì gia công phần mềm cho thế giới, Việt Nam cần tạo ra những giá trị nội lực cốt lõi trong phát triển phần mềm. Ông cho rằng, với việc đào tạo nhân lực phù hợp, chỉ trong 5 - 10 năm, Việt Nam có thể sẽ bất ngờ về những giá trị gia tăng mà chính kỹ sư công nghệ trong nước tạo ra. Mời quý độc giả theo dõi các chương trình đã phát sóng của Đài Truyền hình Việt Nam tại TV Online! Từ khóa: Cùng chuyên mục Tăng cường bảo mật nhờ công nghệ nhận diện khuôn mặt VTV.vn- Ở Việt Nam, dù khá mới mẻ nhưng các kĩ sư trong nước đang dần bắt kịp với xu hướng công nghệ nhận diện khuôn mặt, từ đó cho ra đời những ứng dụng thiết thực trong đời sống. Học tiếng Anh trực tuyến với công nghệ thông minh... Thị trường PC toàn cầu tiếp tục suy giảm, Apple... 10 mẫu smartphone... \"khác người\" nhất trong lịch... Vạch kẻ đường thông minh tại Anh TIN MỚI HOẠT ĐỘNG VTV | LIÊN HỆ CƠ QUAN CHỦ QUẢN: ĐÀI TRUYỀN HÌNH VIỆT NAM CƠ QUAN BÁO CHÍ: BÁO ĐIỆN TỬ VTV NEWS Giấy phép hoạt động báo chí điện tử số 306\/GP-BTTTT cấp ngày 22\/02\/2012. ® Cấm sao chép dưới mọi hình thức nếu không có sự chấp thuận bằng văn bản. Ghi rõ nguồn VTV.vn khi phát hành lại thông tin từ website này. Tổng Biên tập: Vũ Thanh Thủy Phó Tổng Biên tập: Phạm Quốc Thắng Tổng đài VTV: (024) 3.8355931; (024) 3.8355932 Ðiện thoại Báo điện tử VTV: (024) 66897 897 Email: toasoan@vtv.vn","relevance":0},{"title":"Kiểm thử mạng lưới vạn vật kết nối Internet (Internet of Things - IoT) - Viblo","url":"https:\/\/viblo.asia\/p\/kiem-thu-mang-luoi-van-vat-ket-noi-internet-internet-of-things-iot-RQqKLMG6Z7z","content":"IoT là sự kết nối của phương tiện, thiết bị gia dụng, trang thiết bị y tế sử dụng điện tử nhúng, vi mạch … có khả năng truyền tải và trao đổi thông tin, dữ liệu qua mạng. Công nghệ này cho phép người dùng có thể điều khiển thiết bị từ xa thông qua mạng.  Một vài ví dụ về mạng lưới vạn vật kết nối trong cuộc sống thực:  Các thiết bị đeo được như đồng hồ Apple, được đồng bộ hóa một cách dễ dàng với thiết bị di động. Những thông tin này giúp thu thập các thông tin cần thiết như sức khoẻ, theo dõi nhịp tim, hoạt động ngủ… Chúng cũng giúp hiển thị dữ liệu, nhận thông báo từ các thiết bị di động Với việc sử dụng một ứng dụng như CitySense, sẽ dễ dàng lấy được dữ liệu chiếu sáng ngoài trời theo thời gian thực và dựa trên các đèn này, đèn đường được bật hoặc tắt. Ngoài ra còn có các ứng dụng khác nhau để kiểm soát tín hiệu giao thông và chỗ đậu xe theo cách bố trí phức tạp của thành phố. Có rất nhiều ứng dụng để theo dõi điều kiện sức khoẻ của bệnh nhân. Dựa vào dữ liệu được đánh giá, các dịch vụ kiểm soát liều lượng thuốc vào các thời điểm khác nhau trong ngày. Có những ứng dụng như UroSense có thể theo dõi mức chất lỏng trong cơ thể bệnh nhân và dựa trên nhu cầu có thể bắt đầu việc truyền dịch chất lỏng. Đồng thời, dữ liệu có thể được truyền đi không dây tới các bên liên quan khác nhau. Sau đây là một vài kĩ thuật đã được sử dụng trong IoT Chúng ta hãy lấy ví dụ về một hệ thống theo dõi chăm sóc sức khoẻ y tế, trong đó dụng cụ này theo dõi tình trạng sức khoẻ, nhịp tim, chi tiết nạp dịch và gửi báo cáo cho các bác sĩ. Dữ liệu đó được ghi lại trong hệ thống và dữ liệu lịch sử có thể được xem bất cứ khi nào có yêu cầu. Các bác sĩ có thể theo dõi lượng thuốc, bổ sung chất lỏng dựa trên dữ liệu. Điều này có thể được kích hoạt từ xa từ bất kỳ thiết bị nào [máy tính hoặc thiết bị di động] mà thiết bị y tế được kết nối tới. Các phương pháp tiếp cận kiểm thử mạng lưới vạn vật kết nối #1) Tính khả dụng Chúng ta cần chắc chắn về khả năng sử dụng của mỗi thiết bị sử dụng Các thiết bị theo dõi sức khỏe y tế nên cơ động để có thể di chuyển tới các phân đoạn khác nhau Các trang thiết bị không chỉ gửi và nhận thông báo mà còn các tin nhắn lỗi, cảnh báo… Hệ thống nên có tùy chọn để lưu lại tất cả sự kiện, cung cấp đầy đủ thông tin cho người dùng cuối. Các thông báo nên được hiển thị và xử lý chính xác trên tất cả các thiết bị Có khả năng hiển thị, xử lý dữ liệu… phải được kiểm tra một cách kĩ lưỡng #2) Kiểm thử an toàn Thách thức của kiểm thử an toàn - IoT security: IoT là trung tâm dữ liệu, nơi mà tất cả các thiết bị\/ hệ thống được kết nối hoạt động dựa trên những dữ liệu có sẵn Khi nói đến luồng dữ liệu giữa các thiết bị, luôn có cơ hội để có thể truy cập hoặc đọc dữ liệu Từ góc độ kiểm thử, chúng ta cần kiểm tra liệu dữ liệu đã được bảo vệ, mã hóa khi truyền từ một thiết bị tới thiết bị khác hay không? Bất cứ nơi nào có giao diện người dùng, chúng ta cần chắc chắn rằng có mật khẩu bảo vệ trên đó. #3) Khả năng kết nối Vì đây là hệ thống theo dõi sức khỏe, do đó khả năng kết nối đóng một vai trò quan trọng. Hệ thống phải luôn sẵn sàng và có kết nối liền mạch với các bên liên quan. Có hai điều rất quan trọng khi kiểm thử: Kết nối, truyền dữ liệu, nhận nhiệm vụ công việc từ thiết bị này sang thiết bị khác cần phải được liền mạch, không gián đoạn. Cần phải kiểm tra các điều kiện ngoại tuyến (offline). Khi hệ thống không được kết nối mạng, cần phải có cảnh báo có thể nhắc nhở các bác sĩ theo dõi các điều kiện sức khỏe theo cách thủ công, không phụ thuộc vào hệ thống cho đến khi nó được kết nối mạng trở lại. Mặc khác phải có cơ chế để có thể lưu trữ tất cả dữ liệu trong thời gian ngoại tuyến (offline). Khi hệ thống được kết nối mạng trở lại, tất cả các dữ liệu đó cần phải được truyền đi, đảm bảo không mất mát dữ liệu ở bất kì điều kiện nào. #4) Hiệu năng (Performance) Cần đảm bảo hệ thống có khả năng mở rộng. Khi kiểm thử được thực hiện, cần thực hiện cho 2-10 bệnh nhân tại một thời điểm và dữ liệu được truyền từ 10-20 thiết bị. Khi toàn bộ bệnh viện được kết nối và 180-200 bệnh nhân được kết nối với hệ thống, dữ liệu được truyền đi sẽ lớn hơn nhiều so với dữ liệu đã được kiểm tra. Kiểm thử viên cần phải đảm bảo hiệu năng của hệ thống là như nhau mặc dù dữ liệu truyền đi đã lớn hơn. #5) Kiểm tra khả năng tương thích Nhìn vào kiến trúc phức tạp của 1 hệ thống IoT, việc kiểm tra khả năng tương thích là điều cần thiết. Các mục cần kiểm tra như: nhiều phiên bản hệ điều hành, nhiều loại trình duyệt vvaf các phiên bản tương thích, các thế hệ thiết bị, các chế độ liên lạc (bluetooth 2.0, 3.0) … #6) Kiểm thử thí điểm Hệ thống IoT có rất nhiều thiết bị kết nối với nhau, vì thế kiểm thử thí điểm là cần thiết. Trong quá trình thử nghiệm thí điểm, hệ thống được tiếp xúc với một số lượng hạn chế người dùng trong lĩnh vực thực sự. Họ sử dụng ứng dụng và đưa ra các phản hồi về hệ thống. Những ý kiến này có ích để làm cho ứng dụng mạnh lên để có thể triển khai sản xuất #7) Kiểm thử nâng cấp (upgrade testing) IoT là sự kết hợp của nhiều giao thức, thiết bị, hệ điều hành, phần cứng, phần mềm, các tầng mạng… Khi có sự nâng cấp, cần phải thực hiện kiểm thử hồi quy để khắc phục các vấn đề liên quan đến việc nâng cấp.  #1) Phần cứng - phần mềm IoT là một kiến trúc, được kết hợp chặt chẽ giữa các thành phần phần cứng và phần mềm khác nhau. Nó không chỉ là ứng dụng phần mềm tạo nên hệ thống mà phần cứng, cảm biến, cổng thông tin giao tiếp cũng đóng một vai trò quan trọng. #2) Các module tương tác thiết bị Vì đây là kiến trúc giữa các bộ phần cứng và phần mềm khác nhau, nên bắt buộc họ nói chuyện với nhau trong thời gian thực \/ gần thời gian thự","relevance":0},{"title":"IoT-Internet kết nối vạn vật - Chúng Ta","url":"http:\/\/chungta.vn\/iot-internet-ket-noi-van-vat\/tag-24136-1.html","content":"IoT-Internet kết nối vạn vật 5 điều cần biết về 5G   5 điều cần biết về 5G   Mạng 5G với tốc độ lý thuyết tới 1 Gbps (một GB dung lượng mỗi giây), cao gấp 1.000 lần so với 4G và 10.000 lần so với 3G đang mở ra những cơ hội Đua nhau phát triển 5G   Đua nhau phát triển 5G   Anh và Đức đầu tư hơn 120 triệu USD để phát triển mạng di động có tốc độ gấp 1.000 lần mạng 4G. Hàn Quốc mạnh tay hơn, chi tới 1,5 tỷ USD. Nguyễn Thành Nam Thầy Văn Như Cương và triết lý giáo dục   Chưa kịp góp thêm với thầy một lời trong cơn bão tố dư luận thì thầy đã ra đi. Nguyễn Phú Trung Hãy để sự tự giác và cảm xúc lên ngôi   Khảo sát của Đại học Colombia cho hay, 97% những lãnh đạo, CEO hay quản lý có tầm ảnh hưởng đến nhân viên của mình đều có một ngọn lửa vô cùng mãnh liệt với Hội chứng ‘không thể được’   Có lẽ, trong suốt quá trình dài đi học, việc không được chấp nhận khi cố gắng khác biệt đã khiến ta muốn “bình thường” như tất cả một cách vô thức. © 2011 Chúng ta, trang tin nội bộ của Tập đoàn FPT. Chúng ta giữ bản quyền nội dung trên website này. © 2011 Chúng ta, trang tin nội bộ của Tập đoàn FPT. Chúng ta giữ bản quyền nội dung trên website này.","relevance":1},{"title":"internet vạn vật: ​Nhiều lớp tập làm kỹ sư công nghệ cho học sinh - Tuổi Trẻ Online","url":"http:\/\/nhipsongso.tuoitre.vn\/internet-van-vat.html","content":"TTO - Câu lạc bộ Robotics - IoT (CLB) thuộc phòng thí nghiệm trí tuệ nhân tạo, Trường ĐH Khoa học Tự nhiên TP.HCM sẽ mở ra các khóa học về lập trình và sáng chế robot đa dạng dành cho các em từ lứa tuổi tiểu học cho đến đại học TTO - Tiến sĩ Timothy Chou ( \"bậc thầy\" trong lĩnh vực IoT trên thế giới) sẽ đến TP.HCM dự hội thảo \"Internet vạn vật: Nguyên lý, Thực thi và Giải pháp\" và giao lưu với sinh viên Đại học Bách Khoa (ĐHQG TP.HCM) vào ngày 5 và 6-5 © Copyright 2017 TUOITRE.VN, All rights reserved ® Tuổi Trẻ Online giữ bản quyền nội dung trên website này. Thông tin Toà soạn - Thông tin Thành Đoàn - Liên hệ Quảng cáo Điện thoại liên hệ: 0918.033.133","relevance":1},{"title":"Internet vạn vật: Cách mạng công nghiệp 4.0: Nghề nào dễ bị mất việc? | soha.vn","url":"http:\/\/soha.vn\/internet-van-vat.html","content":"© Copyright 2010 - 2017 – Công ty Cổ phần VCCorp Tầng 17,19,20,21 Toà nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Email: btv@soha.vn Giấy phép số 2411\/GP-TTĐT do Sở Thông tin và Truyền thông Hà Nội cấp ngày 31 tháng 07 năm 2015. Chịu trách nhiệm nội dung: Ông Nguyễn Thế Tân Liên hệ quảng cáo: Hotline: 0942.86.11.33 Email: giaitrixahoi@admicro.vn Hỗ trợ & CSKH: Tầng 20, tòa nhà Center Building, Hapulico Complex, số 1 Nguyễn Huy Tưởng, phường Thanh Xuân Trung, quận Thanh Xuân, Hà Nội. Tel: (84 24) 7307 7979 Fax: (84 24) 7307 7980","relevance":0},{"title":"Internet vạn vật có thể gây rủi ro với hệ thống thông tin quan trọng của quốc gia - ICTNEWS","url":"http:\/\/ictnews.vn\/cntt\/bao-mat\/internet-van-vat-co-the-gay-rui-ro-voi-he-thong-thong-tin-quan-trong-cua-quoc-gia-154801.ict","content":"Trong Hội nghị Phổ biến pháp luật về an toàn thông tin mạng tổ chức tại Long An sáng nay 8\/6, Thứ trưởng Bộ Thông tin & Truyền thông Hoàng Vĩnh Bảo đã có bài phát biểu khai mạc. Thứ trưởng cho biết, trong những năm vừa qua, lĩnh vực công nghệ thông tin của Việt Nam đã có những bước phát triển vượt bậc, đóng góp ngày càng lớn vào quá trình xây dựng và phát triển đất nước. Việc ứng dụng công nghệ thông tin trong các hệ thống quan trọng như viễn thông, điện lực, tài chính, ngân hàng, các hệ thống điều khiển tự động trong các nhà máy, xí nghiệp đã trở nên hết sức quan trọng và không thể thay thế được. Quang cảnh Hội nghị Phổ biến pháp luật về an toàn thông tin mạng - Ảnh: H.Đ Sự ra đời và phát triển của Internet, Internet vạn vật đã thúc đẩy quá trình kết nối giữa các hệ thống thông tin của một quốc gia và giữa các quốc gia với nhau ngày một nhanh chóng. Điều này đã biến thế giới hiện nay trở thành một thế giới kết nối và đem lại rất nhiều lợi ích cho mọi mặt của đời sống. Tuy nhiên, chính sự kết nối này đã gây ra những nguy cơ, rủi ro gây mất an toàn thông tin đối với hầu hết người dùng. Nghiêm trọng hơn, các rủi ro này có thể xảy ra đối với các hệ thống thông tin quan trọng trong hầu hết các lĩnh vực, đặc biệt là các hệ thống thông tin quan trọng của quốc gia. Vì vậy, thách thức đặt ra cho công tác bảo đảm an toàn thông tin mạng sẽ ngày càng khó khăn và phức tạp, Thứ trưởng Hoàng Vĩnh Bảo nhấn mạnh. Trong bối cảnh đó, ngày 19\/11\/2015, Quốc hội đã thông qua Luật An toàn thông tin mạng. Việc ban hành luật đã góp phần hoàn thiện cơ sở pháp lý ổn định về an toàn thông tin theo hướng áp dụng các quy định pháp luật một cách đồng bộ, khả thi trong thực tiễn thi hành và phát huy các nguồn lực của đất nước để đảm bảo an toàn thông tin mạng. Sau Luật An toàn thông tin mạng, các văn bản dưới luật đã lần lượt được ban hành đóng vai trò tích cực trong việc hỗ trợ các cơ quan, tổ chức trong việc xác định cấp độ an toàn thông tin để đưa ra biện pháp bảo vệ phù hợp cho từng hệ thống thông tin. Trong đó phải kể đến Nghị định số 85\/2016\/NĐ-CP ngày 1\/7\/2016 về bảo đảm an toàn hệ thống thông tin theo cấp độ, Quyết định số 05\/2017\/QĐ-TTg ngày 16\/3\/2017 ban hành quy định về hệ thống phương án ứng cứu khẩn cấp đảm bảo an toàn thông tin mạng quốc gia và Quyết định số 632\/QĐ-TTg ban hành danh mục lĩnh vực quan trọng cầu công ty bảo đảm an toàn thông tin mạng và hệ thống thông tin quan trọng quốc gia. Đây là những văn bản quan trọng, có giá trị đối với các cơ quan quản lý, các doanh nghiệp hoạt động trong lĩnh vực an toàn thông tin mạng, thực hiện công tác ứng cứu sự cố đảm bảo an toàn thông tin mạng. Thứ trưởng Hoàng Vĩnh Bảo đã bày tỏ mong muốn các doanh nghiệp, cơ quan đơn vị của Việt Nam cần nhận thức đầy đủ hơn về sự cần thiết phải chuẩn bị các nguồn lực về kỹ thuật, con người để sẵn sàng phản ứng với các sự cố an toàn mạng. Đây không phải là nhiệm vụ của riêng cá nhân hay tổ chức nào mà cần có sự chia sẻ và phối hợp chặt chẽ từ các cơ quan chức năng và sự chung tay góp sức của các tổ chức, doanh nghiệp và cá nhân trong toàn xã hội. Hội nghị Phổ biến pháp luật về an toàn thông tin mạng do Bộ Thông tin & Truyền thông tổ chức, kéo dài trong một ngày 8\/6 tại Long An. Hội nghị có sự tham dự của nhiều sở, ngành tại Long An và các tỉnh lân cận khu vực phía Nam. Các lãnh đạo từ Vụ Pháp chế và Cục An toàn thông tin thuộc Bộ Thông tin & Truyền thông, và lãnh đạo Trung tâm Ứng cứu khẩn cấp máy tính Việt Nam (VNCERT) sẽ có các bài trình bày tại hội nghị nhằm phổ biến pháp luật về an toàn thông tin mạng. Hải Đăng Tương tác trực tiếp với ICTnews trên Facebook Bài viết chưa có bình luận nào. Bình luận của bạn đã được gửi và sẽ hiển thị sau khi được duyệt bởi ban biên tập. Ban biên tập giữ quyền biên tập nội dung bình luận để phù hợp với qui định nội dung của ictnews. ICTNEWS - Chuyên trang về CNTT của Báo điện tử Infonet - Giấy phép số: 605\/GP-BTTT cấp ngày 30\/12\/2016. Cơ quan chủ quản: Bộ Thông tin và Truyền thông. Tổng biên tập: Võ Đăng Thiên; Phó Tổng biên tập: Nguyễn Bá. Tòa soạn: Tầng 7, Tòa nhà Cục Tần số Vô tuyến điện, 115 Trần Duy Hưng, Quận Cầu Giấy, Hà Nội Hotline nội dung: 0888 911 911 - Email: toasoan@ictnews.vn Hotline quảng cáo - truyền thông: 0968331987 - Email: ad@ictnews.vn © Bản quyền thuộc Infonet. Không được phép sao chép khi chưa được chấp thuận bằng văn bản. Tòa soạn: Tầng 7, Tòa nhà Cục Tần số Vô tuyến điện, 115 Trần Duy Hưng, Quận Cầu Giấy, Hà Nội Điện thoại: 024 3 936 9966 - Fax: 024 3 936 9364 Hotline nội dung: 0888 911 911 - Email: toasoan@ictnews.vn Hotline quảng cáo: 0968331987 - Email: ad@ictnews.vn","relevance":1},{"title":"INTERNET VẠN VẬT | Tin tức thời sự mới, điểm nóng trong ngày | giadinh.net.vn","url":"http:\/\/giadinh.net.vn\/internet-van-vat.tag","content":"Bạn thích các tin tức trong chủ đề này? Hãy bình luận, gửi, chia sẻ với bạn bè nhé! 07\/07\/2017 08:00 Trong cuốn sách xuất bản năm 1999, Bill Gates đưa ra 15 dự đoán về các xu hướng phát triển của công nghệ mà hiện tại đã được chứng minh là chính xác. Tags: Kinh doanh điện tử, internet vạn vật, trợ lý ảo, Bill Gates, gia đình hitech 2008 © BẢN QUYỀN THUỘC VỀ BÁO ĐIỆN TỬ GIA ĐÌNH & XÃ HỘI. Cơ quan chủ quản: Tổng cục Dân số - Kế hoạch hóa gia đình (Bộ Y tế) Tổng biên tập: Lê Cảnh Nhạc Phó Tổng biên tập: Nguyễn Ngọc Đức, Trần Tuấn Linh Giấy phép hoạt động báo điện tử số 306\/GP-BTTTT cấp ngày 8\/6\/2016 Điện thoại: 04.22120681 | Fax: 04.8463556 Đường dây nóng: 0904852222 Trụ sở: Số 138A Giảng Võ, quận Ba Đình; Địa chỉ liên hệ: Tòa nhà Tổng cục DS-KHHGĐ, ngõ 8 đường Tôn Thất Thuyết, quận Nam Từ Liêm, TP Hà Nội Email: toasoan@giadinh.net.vn ® Mọi hình thức sao chép thông tin, hình ảnh phải có sự đồng ý bằng văn bản. Vui lòng dẫn “giadinh.net.vn” khi phát hành lại thông tin từ website này.","relevance":1}]}]}