{"collection":[{"query":"Học máy Machine learning","description":"Muốn tìm hiểu về học máy, trí tuệ nhân tạo, các ứng dụng thực tiễn","sites":[{"title":"Machine Learning cơ bản","url":"https:\/\/machinelearningcoban.com\/2016\/12\/26\/introduce\/","content":"Những năm gần đây, AI - Artificial Intelligence (Trí Tuệ Nhân Tạo), và cụ thể hơn là Machine Learning (Học Máy hoặc Máy Học) nổi lên như một bằng chứng của cuộc cách mạng công nghiệp lần thứ tư (1 - động cơ hơi nước, 2 - năng lượng điện, 3 - công nghệ thông tin). Trí Tuệ Nhân Tạo đang len lỏi vào mọi lĩnh vực trong đời sống mà có thể chúng ta không nhận ra. Xe tự hành của Google và Tesla, hệ thống tự tag khuôn mặt trong ảnh của Facebook, trợ lý ảo Siri của Apple, hệ thống gợi ý sản phẩm của Amazon, hệ thống gợi ý phim của Netflix, máy chơi cờ vây AlphaGo của Google DeepMind, …, chỉ là một vài trong vô vàn những ứng dụng của AI\/Machine Learning. (Xem thêm Jarvis - trợ lý thông minh cho căn nhà của Mark Zuckerberg) Machine Learning là một tập con của AI. Theo định nghĩa của Wikipedia, Machine learning is the subfield of computer science that “gives computers the ability to learn without being explicitly programmed”. Nói đơn giản, Machine Learning là một lĩnh vực nhỏ của Khoa Học Máy Tính, nó có khả năng tự học hỏi dựa trên dữ liệu đưa vào mà không cần phải được lập trình cụ thể. Bạn Nguyễn Xuân Khánh tại đại học Maryland đang viết một cuốn sách về Machine Learning bằng tiếng Việt khá thú vị, các bạn có thể tham khảo bài Machine Learning là gì?. Những năm gần đây, khi mà khả năng tính toán của các máy tính được nâng lên một tầm cao mới và lượng dữ liệu khổng lồ được thu thập bởi các hãng công nghệ lớn, Machine Learning đã tiến thêm một bước dài và một lĩnh vực mới được ra đời gọi là Deep Learning (Học Sâu - thực sự tôi không muốn dịch từ này ra tiếng Việt). Deep Learning đã giúp máy tính thực thi những việc tưởng chừng như không thể vào 10 năm trước: phân loại cả ngàn vật thể khác nhau trong các bức ảnh, tự tạo chú thích cho ảnh, bắt chước giọng nói và chữ viết của con người, giao tiếp với con người, hay thậm chí cả sáng tác văn hay âm nhạc (Xem thêm 8 Inspirational Applications of Deep Learning) Nhu cầu về nhân lực ngành Machine Learning (Deep Learning) đang ngày một cao, kéo theo đó nhu cầu học Machine Learning trên thế giới và ở Việt Nam ngày một lớn. Cá nhân tôi cũng muốn hệ thống lại kiến thức của mình về lĩnh vực này để chuẩn bị cho tương lai (đây là một trong những mục tiêu của tôi trong năm 2017). Tôi sẽ cố gắng đi từ những thuật toán cơ bản nhất của Machine Learning kèm theo các ví dụ và mã nguồn trong mỗi bài viết. Tôi sẽ viết 1-2 tuần 1 bài (việc viết các công thức toán và code trên blog thực sự tốn nhiều thời gian hơn tôi từng nghĩ). Đồng thời, tôi cũng mong muốn nhận được phản hồi của bạn đọc để qua những thảo luận, tôi và các bạn có thể nắm bắt được các thuật toán này. Với những từ chuyên ngành, tôi sẽ dùng song song cả tiếng Anh và tiếng Việt, tuy nhiên sẽ ưu tiên tiếng Anh vì thuận tiện hơn cho các bạn trong việc tra cứu các tài liệu tiếng Anh. Khi chuẩn bị các bài viết, tôi sẽ giả định rằng bạn đọc có một chút kiến thức về Đại Số Tuyến Tính (Linear Algebra), Xác Suất Thống Kê (Probability and Statistics) và có kinh nghiệm về lập trình Python. Nếu bạn chưa có nhiều kinh nghiệm về các lĩnh vực này, đừng quá lo lắng vì mỗi bài sẽ chỉ sử dụng một vài kỹ thuật cơ bản. Hãy để lại câu hỏi của bạn ở phần Comment bên dưới mỗi bài, tôi sẽ thảo luận thêm với các bạn. Trong bài tiếp theo của blog này, tôi sẽ giới thiệu về các nhóm thuật toán Machine learning cơ bản. Mời các bạn theo dõi.","relevance":1},{"title":"Machine Learning 101 (1): Làm quen - Khanh's little things","url":"http:\/\/khanhxnguyen.com\/toi-da-hoc-machine-learning-nhu-the-nao-phan-1-lam-quen\/","content":"Khanh's little things Official homepage of Khanh Xuan Nguyen Ph.D. Student at UMaryland August 09, 2015 (Tựa bài cũ là “Tôi đã học Machine Learning như thế nào?” Mình quyết định đổi tên thành “Machine Learning 101” cho ngắn gọn dễ nhớ, và cũng dễ bắt mắt anh Google hơn) Xin chào, mình là khanhptnk. Mình là một người đang học và nghiên cứu về Machine Learning. Lĩnh vực mình chuyên sâu cho đến bây giờ là Natural Language Processing (gọi tắt là NLP), tức là làm cho máy tính có khả năng hiểu được ngôn ngữ của con người. Mình không phải là một chuyên gia, kinh nghiệm còn khá non nếu so với các giáo sư đầu ngành nhưng mình rất muốn đem bộ môn này về giới thiệu với các bạn, nhất là các bạn còn đang loay hoay tìm câu trả lời cho câu hỏi: học Tin học sau này làm được gì? Vào năm 2014, mình có thuyết trình trước lớp một bài giới thiệu về Machine Learning. Nội dung bài viết này phần lớn dựa vào đó. Để giới thiệu về Machine Learning, mình xin dựa vào mối quan hệ của nó với ba khái niệm sau: 1. Machine Learning và trí tuệ nhân tạo (Artificial Intelligence hay AI) 2. Machine Learning và Big Data. 3. Machine Learning và dự đoán tương lai. Trí tuệ nhân tạo, AI, một cụm từ vừa gần gũi vừa xa lạ đối với chúng ta. Gần gũi bởi vì thế giới đang phát sốt với những công nghệ được dán nhãn AI. Xa lạ bởi vì một AI thực thụ vẫn còn nằm ngoài tầm với của chúng ta. Nói đến AI, hẳn mỗi người sẽ liên tưởng đến một hình ảnh khác nhau. Các bạn có để ý rằng vài thập niên gần đây có một sự thay đổi về diên mạo của AI trong các bộ phim quốc tế. Trước đây, các nhà sản xuất phim thường xuyên đưa hình ảnh robot hoặc terminator vào phim, nhằm gieo vào đầu người xem suy nghĩ rằng trí tuệ nhân tạo như một phương thức nhân bản con người bằng máy móc. Tuy nhiên, trong những bộ phim gần đây nhất về đề tài này, ví dụ như Transcendence do Johny Depp vào vai chính, ta không thấy hình ảnh của một con robot nào cả. Thay vào đó là một bộ não điện toán khổng lồ chỉ huy hàng vạn con Nanobot, được gọi là Singularity. Tất nhiên cả hai hình ảnh đều là hư cấu và giả tưởng, nhưng sự thay đổi như vậy cũng một phần nào phản ánh sự thay đổi ý niệm của con người về AI. AI bây giờ được xem như vô hình vô dạng, hay nói các khác có thể mang bất cứ hình dạng nào. Trong giới hàm lâm, theo hiểu biết chung, AI là một ngành khoa học được sinh ra với mục đích làm cho máy tính có được trí thông minh. Mục tiêu này vẫn khá mơ hồ vì không phải ai cũng đồng ý với một định nghĩa thống nhất về trí thông minh. Thế nên các nhà khoa học phải định nghĩa một số mục tiêu cụ thể hơn, một trong số đó là việc làm cho máy tính lừa được Turing Test. Turing Test được tạo ra bởi Alan Turing (1912-1954), người được xem là cha đẻ của ngành khoa học máy tính hiện đại, nhằm phân biệt xem người đối diện có phải là người hay không (xem phim The Imitation Game về nhân vật này, nhưng đừng tin hết những gì trong phim). AI thể hiện một mục tiêu của con người. Machine Learning là một phương tiện được kỳ vọng sẽ giúp con người đạt được mục tiêu đó. Và thực thế thì Machine Learning đã mang nhân loại đi một quãng đường rất xa trên quãng đường chinh phục AI. Nhưng vẫn còn một quãng đường xa hơn cần phải đi. Machine Learning và AI có mối quan hệ chặt chẽ với nhau nhưng không hẳn là trùng khớp vì một bên là mục tiêu (AI), một bên là phương tiện (Machine Learning). Chinh phục AI mặc dù vẫn là mục đích tối thượng của Machine Learning, nhưng hiện tại Machine Learning tập trung vào những mục tiêu ngắn hạn hơn như: 1. Làm cho máy tính có những khả năng nhận thức cơ bản của con người như nghe, nhìn, hiểu được ngôn ngữ, giải toán, lập trình, … và 2. Hỗ trợ con người trong việc xử lý một khối lượng thông tin khổng lồ mà chúng ta phải đối mặt hàng ngày, hay còn gọi là Big Data. Big Data thực chất không phải là một ngành khoa học chính thống. Đó là một cụm từ dân gian và được giới truyền thông tung hô để ám chỉ thời kì bùng nổ của dữ liệu hiện nay. Nó cũng không khác gì với những cụm từ như “cách mạng công nghiệp”, “kỉ nguyên phần mềm”. Big Data là một hệ quả tất yếu của việc mạng Internet ngày càng có nhiều kết nối. Với sự ra đời của các mạng xã hội nhưng Facebook, Instagram, Twitter, nhu cầu chia sẻ thông của con người tăng trưởng một cách chóng mặt. Youtube cũng có thể được xem là một mạng xã hội, nơi mọi người chia sẻ video và comment về nội dung của video. Để hiểu được quy mô của Big Data, hãy xem qua nhũng con số sau đây: + Khoảng 300 giờ video được upload trên youtube trong mỗi phút (theo https:\/\/www.youtube.com\/yt\/press\/statistics.html) + Hơn 900 triệu người thật sự sử dụng Facebook mỗi ngày, 82.8% trong số đó ở ngoài Mỹ và Canada (theo http:\/\/newsroom.fb.com\/company-info\/) + Nhu cầu chia sẻ tăng đi đôi với việc nhu cầu tìm kiếm thông tin cũng tăng. Google phải xử lý 100 tỉ lượt tìm kiếm mỗi tháng, tức là 3,3 tỉ lượt mỗi ngày và 38.000 lượt mỗi giây (theo http:\/\/www.internetlivestats.com\/google-search-statistics\/). Và những con số này đang tăng lên theo từng giây! Bùng nổ thông tin không phải là lý do duy nhất dẫn đến sự ra đời của cụm từ Big Data. Nên nhớ rằng Big Data xuất hiện mới từ vài năm gần đây nhưng khối lượng dữ liệu tích tụ kể từ khi mạng Internet xuất hiện vào cuối thế kỉ trước cũng không phải là nhỏ. Thế nhưng, lúc ấy con người ngồi quanh một đống dữ liệu và không biết làm gì với chúng ngoài lưu trữ và sao chép. Cho đến một ngày, các nhà khoa học nhận ra rằng trong đống dữ liệu ấy thực ra chứa một khối lượng tri thức khổng lồ. Những tri thức ấy có thể giúp cho ta hiểu thêm về con người và xã hội. Từ danh sách bộ phim yêu thích của một cá nhân chúng ta có thể rút ra được sở thích của người ","relevance":1},{"title":"Lộ trình để học về Machine Learning","url":"https:\/\/techmaster.vn\/posts\/33982\/lo-trinh-de-hoc-ve-machine-learning","content":"Bài viết được dịch từ trang web Benfreu Đây là một hướng dẫn ngắn dành cho những người muốn bắt đầu học Machine Learning và đang cảm thấy chưa có phương hướng. Bài viết giới thiệu về các khóa học và những cuốn sách có nhiều giá trị, những công cụ nên cài đặt và làm thế nào có dữ liệu thực để thực hành những gì bạn đã học được. Bạn có quan tâm đến Machine Learning? Tôi biết nhiều người thích Machine Learning (ML) nhưng không muốn bắt đầu tự tìm hiểu về nó, bởi vì khi bước vào nghiên cứu một chủ đề rộng như vậy thì họ thường cảm thấy choáng ngợp và khó khăn. Trong bài viết này, tôi sẽ cung cấp cho bạn một số cách để tiếp cận với Machine Learning rất hiệu quả theo kinh nghiệm của bản thân mình. Miễn là bạn có một chút nền tảng về lập trình và toán học thì sẽ thực sự dễ dàng để tìm hiểu những điều cơ bản. Thậm chí bạn có thể có một số ứng dụng trong cuộc sống thực nhờ sự kết hợp của các khóa học trực tuyến tuyệt vời, thư viện mã nguồn mở, tài liệu và dữ liệu có sẵn miễn phí. Bạn lo lắng về phần cứng của bạn ư? Trong thực tế, bạn sẽ không cần các data center hoành tráng để làm việc trên những thách thức thú vị mà chỉ cần chiếc laptop của bạn là cũng là đủ xài rồi. Chỉ có một lưu ý rất nhỏ: tùy thuộc vào hệ điều hành của bạn, việc cài đặt các công cụ và thư viện có thể cần một số thủ thuật. Nhưng đã có StackOverflow nên bạn chỉ cần tìm kiếm hướng dẫn trên Google một chút là ra ngay. Tất nhiên sẽ là thuận lợi hơn nếu bạn có trước một số kiến thức. Machine Learning là sự giao thoa của khoa học máy tính và thống kê. Vì vậy, kiến thức trong cả hai lĩnh vực này sẽ rất hữu ích. Nếu bạn chưa biết gì về lĩnh vực thống kê thì hãy thử đọc cuốn sách Head-First Statistics. Nó là một cuốn sách khá dễ hiểu (mặc dù chỉ giới thiệu kiến thức ở mức tổng quan) về lĩnh vực thống kê. Đối với Machine Learning thì việc biết một chút về ngôn ngữ lập trình Python cũng sẽ rất hữu ích. Bạn sẽ có khả năng truy cập vào rất nhiều thư viện tính toán, và dữ liệu rất tuyệt vời. May mắn là việc học Python khá dễ dàng. Bạn có thể tham khảo khóa học này. Khóa học Machine Learning của Andrew Ng trên Coursera có lẽ là khởi đầu tốt nhất. Bạn sẽ học các khái niệm cơ bản và các thuật toán mạnh mẽ. Khóa học này sử dụng GNU Octave (\"Open Source Matlab\") cho các bài tập lập trình. Vào cuối khóa học, bạn sẽ phải thực hiện các thuật toán của mình bao gồm một mạng nơron và có một sự hiểu biết thấu đáo về các khái niệm như bias\/variance. Bạn chắc chắn sẽ thấy được những thách thức và giải pháp quy mô lớn trong Machine Learning. Lời khuyên của tôi đó là bạn hãy thực sự làm các bài kiểm tra và bài tập để nhận được nhiều lợi ích nhất từ khóa học. Khi bạn đã có một số kiến thức cơ bản về toán học nhưng chưa biết nên học thêm những gì, thì hãy tham khảo giáo trình đại số tuyến tính trên Khan Academy và các kiến thức về toán học nói chung. Một khi bạn biết những kiến thức cơ bản thì đó là lúc để ...  Đến lúc này bạn đã tự mình thực hiện rất nhiều các thuật toán và do đó bạn đã biết rất nhiều về Machine Learning. (Xin chúc mừng bạn!) Bây giờ bạn sẽ cần có một số dữ liệu thực tế để thực hành, và kaggle.com là một nơi tuyệt vời dành cho bạn. Hoặc là bạn tham gia một cuộc thi thực sự nhưng ở mức đơn giản. Vì ở thời điểm này bạn cần có những cảm nhận về ứng dụng thực tế.  Chỉ cần duyệt qua phần mô tả về cuộc thi và chọn những phần bạn quan tâm. Để có nhiều niềm vui ở đây bạn có thể sử dụng IPython\/Jupyter notebooks với pandas để khám phá dữ liệu.  Tiếp đến bạn cũng nên học những kiến thức cơ bản về numpy. Bạn cũng nên tham khảo thông tin trên trang web Kaggle nữa. Họ có một forum với những trợ giúp rất hữu ích từ cộng đồng, IPython notebooks và scripts chỉ cho bạn cách làm thể nào để load và transform dữ liệu và cuối cùng là đưa vào các thư viện Machine Learning. Phổ biến nhất trong số đó là scikit-learn. Vì vậy, bạn hãy cố gắng load dữ liệu, tránh những tính năng bạn nghĩ là không quan trọng hoặc quá phức tạp để chuyển đổi và cung cấp dữ liệu đó vào một thuật toán scikit-learn phù hợp. (Bạn biết được vấn đề nào cần thuật toán nào.) Nếu bạn đã từng gặp khó khăn, hãy xem cách người khác giải quyết các vấn đề như thế nào. Một khi bạn đã thực hiện được những bước kể trên, thì bạn đã thực sự đi được một chặng đường dài rồi đó. Điều duy nhất thú vị hơn khi làm việc với dữ liệu đó là được làm việc với nhiều dữ liệu hơn. Vì vậy, bạn có thể quan tâm đến deep learning. Google đã phát hành TensorFlow và có một khóa học của Udacity về deep learning với TensorFlow. Nó không được hướng dẫn nhiều như khóa Machine Learning nhưng bạn sẽ trải qua những ví dụ sử dụng IPython notebooks và có thể tìm hiểu mọi thứ. Trong quá trình học đó bạn sẽ được tiếp xúc với một số vấn đề rất thú vị.  Hùng là lập trình viên có nhiều năm kinh nghiệm trong lĩnh vực: C#, VB.NET, ASP.NET, SQL Server, MVC, Entity Framework… và đồng thời cũng là admin của blog http:\/\/vinacode.net\/. Bạn có thể liên hệ với anh qua email hungpm2000[at]gmail.com Quy định Ghi nhớ tài khoản Hiển thị mật khẩu Bằng cách nhấp vào Đăng ký, bạn đã đồng ý với các Quy định của chúng tôi.","relevance":1},{"title":"Lộ trình học Machine Learning\/ Deep Learning từ đầu cho các bạn Lập Trình Viên - writes - Dạy Nhau Học","url":"https:\/\/daynhauhoc.com\/t\/lo-trinh-hoc-machine-learning-deep-learning-tu-dau-cho-cac-ban-lap-trinh-vien\/37264","content":"Đây là kế hoạch dài hơi cho sự nghiệp học tập Machine Learning \/ Deep Learning của mình. Mình hiện là Lập Trình Viên mobile (Android, iOS, Blackberry) với 6 năm kinh nghiệm và không có bằng cấp Thạc sĩ, Tiến sĩ gì về Computer Science. Mục đích chính của mình là tìm 1 cách học Machine Learning \/ Deep Learning thật hiệu quả cho các bạn không có kinh nghiệm nghiên cứu khoa học. Cách học này sẽ tập trung vào việc thực hành các ứng dụng của ML\/DL trước, sau đó mới đi dần dần vào lý thuyết, toán học sau . Các bạn có thế tìm kiếm nhanh trên google về cách học Machine learning, và nhận thấy ngay việc phải học Toán: xác xuất thống kê, đại số tuyến tính, giải tích .... đầu tiên. Ngoài ra việc nghiên cứu khoa học ở mức độ Thạc sĩ, Tiến sĩ là điều cần thiết khi muốn tìm hiểu sâu. Cũng như các bạn, mình gặp khá nhiều rắc rối trong việc này. - Có nên bỏ làm để đi học Thạc sĩ, Tiến sĩ? - Ở Viêt Nam có học được ngành này không? Có 2 loại Machine learning: Machine Learning thực hành: Liên quan truy vấn cơ sở dữ liệu, làm sạch dự liệu, viết script để chuyển đổi data và gắn kết thuật toán với các thư viện để giải quyết vấn đề. Machine Learning lý thuyết: Liên quan tới toán học, lý thuyết, nghiên cứu khoa học. Theo mình cách học tốt nhất dành cho các bạn chưa có căn bản về nghiên cứu là tập trung vào thực hành: \"thực hành - tìm hiểu - thực hành\", có nghĩa là đầu tiên các bạn sẽ làm quen với 1 vài bài toán và thực hành các giải pháp của bài toán đó, để làm quen với hướng xử lý và 1 vài thuật ngữ về ML\/DL. Sau đó mới có thể học lý thuyết trong sách. Cứ thế lặp lại thì các bạn có thể nắm dc rõ về bản chất của ML\/DL. Như vậy sẽ dễ tiếp cận hơn việc đọc sách khô khan. Mình đã tạo ra roadmap rất chi tiết trên Github và hiện tại đang có hơn 2 nghìn bạn đang cùng xây dựng và học cùng mình. machine-learning-for-software-engineers - A complete daily plan for studying to become a machine learning engineer. Các bạn có góp ý gì có thể comment trên Github hoặc ngay tại thread này. Mong rằng con đường tiếp cận Machine Learning, Deep Learning, Artificial Intelligence đỡ chông gai hơn với tất cả mọi người. thấy cũng hứng thứ với mảng này, nhưng thấy liên quan đến toán xác xuất, giải tích thì nản, xác xuất còn đỡ, chứ toán thì mù chữ luôn So much cool, big thumb up (y) (y). Xin hỏi bạn đang làm việc ở đâu nhỉ? Nếu ở TP.HCM thì quá tốt, mình có thể trao đổi thêm. Xin tự giới thiệu qua: hiện tại mình đang làm ở ANTS, với vai trò là Data Engineer, cũng không có bằng cấp gì nhiều, nhưng cũng may mắn có đủ năng lực, hiện tại đang điều hành một team nhỏ, xử lý dữ liệu đầu vào cho các tác vụ ETL, Intergrating, Realtime... cũng như chuẩn bị dữ liệu cho đội Data Mining. Dữ liệu hiện tại đang xử lý tầm 500tr~600tr\/ngày. Mong muốn của mình là đi theo con đường hybird giữa DE và Data Analytics, bởi vì việc này nó phù hợp hơn với mình do cũng nghiên cứu các ngành nghề khác nhau ngoài Software. Lâu rồi mới thấy một bài post chất lượng, và sự đầu tư lẫn tinh thần ham học hỏi cao cỡ vậy. Mình cũng ko có base về Toán, nên lúc đầu học theo cách của trường đại học khá nản Mình đang ở Hà Nội bạn ạ. Có gì cần trao đổi cụ thể hơn, thì bạn có thể trao đổi tại đây, hoặc bạn có thể mail cho mình ở địa chỉ mail trên profile của Github nhé. Cảm ơn bạn đã quan tâm. Ồ, tiếc quá nhỉ. Vậy bạn có thể cho biết hiện tại bên bạn đã áp dụng ML\/DL này ở những vấn đề gì rồi ? Nếu được bạn có thể trình bày chi tiết vấn đề và cách giải quyết nó không? Mình đang nghiên cứu và thực hành độc lập, ko liên quan đến bên nào cả gì cả. Các vấn đề mình đã và đang nghiên cứu: - Phát triển motion detection cho các vật, người được gắn tag NFC, RFID - Phát triển face recognition. - Phát triển việc tự sáng tạo bản nhạc. Mình chưa xem kỹ roadmap này nhưng cho mình hỏi tại sao không bắt đầu với khóa intro to machine learning của Udacity mà lại để ở cuối? Mình cũng đang tự học và chưa biết bắt đầu từ đâu. Udacity’s Intro to Machine Learning là khóa học đầu tiên ở MOOC mà mình recommend. Ở roadmap cần kết hợp đọc cả web, xem video, học MOOC, đọc textbook... Nên mình đang chưa sắp xếp dc roadmap cho việc lẫn lộn đó. Hiện mình đang chỉ sắp mức được độ ưu tiên theo từng chủ đề. Có gì chưa hợp lý, các bạn comment thêm nhé OK vậy mình sẽ thử học một số courses và gửi pull request về road map học cái nào trước Cảm ơn anh đã tạo ra lộ trình này cho mọi người. Em nghĩ học theo kiểu top down này rất hợp lý tại em cũng có đọc thử ML thì toàn là Toán không, chưa hiểu gì đã cảm thấy nản rồi. Không biết ML\/DL có nặng về giải thuật không anh? cũng có đọc thử ML thì toàn là Toán không, chưa hiểu gì đã cảm thấy nản rồi. Vỉ nếu không nặng về toán thì mình nghĩ bạn không cần thiết học ML đâu . chỉ cần học cách xài thư viện à. Google, microsoft, ibm đều có khá nhiều api rất mạnh, và nó chắc chắn mạnh hơn rất nhiều so với việc bạn tự học, tự xây dựng và chỉ dừng lại ở bề nổi. Nhưng muốn thực sự có một công việc ở trong ML\/AI\/DS, muốn làm \"scientist\" thì cần phải hiểu sâu về bản chất và cả toán nữa, nó rất nặng về toán, ML thiên về toán hơn thiên về tin. Hầu như không có việc \"engineer\" trong lĩnh vực AI . Nhưng muốn thực sự có một công việc ở trong ML\/AI\/DS, muốn làm \"scientist\" thì cần phải hiểu sâu về bản chất và cả toán nữa, nó rất nặng về toán, ML thiên về toán hơn thiên về tin. Hầu như không có việc \"engineer\" trong lĩnh vực AI . Để nghiên cứu sâu về ML thì toán là 1 điều bắt buộc. Tuy nhiên đấy là cho các bạn định hướng nghiên cứu, sáng tạo ra cái mới. Còn mới đầu nên học cách tìm hiểu việc sử dụng thư viện, rồi dần dần mày mò xem thư viện nó đang làm cái khỉ gì trong đó? Lúc đó thì giải thuật, toán học","relevance":1},{"title":"Tự học machine learning nên bắt đầu từ đâu?","url":"http:\/\/genk.vn\/tu-hoc-machine-learning-nen-bat-dau-tu-dau-20170427124352756.chn","content":"Machine learning (ML) đang ngày càng trở thành lĩnh vực có tiềm năng ứng dụng rộng lớn mà không ai trong giới công nghệ còn có thể làm ngơ. Tuy nhiên, không phải ai cũng có may mắn được theo học ML chính thống ở trường. Harper Maddox, CTO của startup EdgeTheory đã chia sẻ về kinh nghiệm cá nhân của anh trong việc tự học ML ngay cả khi vô cùng bận rộn với ba con nhỏ cùng công việc tại công ty. Nếu gõ tìm hướng dẫn lộ trình học ML lên Google, bạn sẽ nhận về vô số kết quả với những kho tài nguyên đồ sộ do cộng đồng tích lũy được. Tuy nhiên, nếu chưa có chút kinh nghiệm gì về mảng này thì hãy bắt đầu một cách nhẹ nhàng đơn giản trước đã. Tiếp cận Học nền tảng – Khóa online miễn phí Đầu tiên, theo Maddox gợi ý, bạn hãy tham gia ngay khóa học Machine Learning \"huyền thoại\" trên Coursera của Giáo sư Andrew Ng, một trong những chuyên gia hàng đầu về AI hiện nay. Đây chính là khóa học được hầu hết những người làm việc trong ngành gợi ý. Nó sẽ cung cấp cho bạn những nguyên lý căn bản cũng như cách sử dụng hiệu quả các công cụ như Tensor Flow và Keras. Nếu cảm thấy khó khăn với việc học bằng tiếng Anh, hãy thử bắt đầu với khóa Machine Learning cơ bản bằng tiếng Việt trên blog của anh Vũ Hữu Tiệp, một nghiên cứu sinh ngành Machine Learning and Computer Vision tại ĐH Bang Pennsylvania, Mỹ. Ứng dụng AI – Email Newsletter Maddox đăng ký nhận newsletter qua email từ Technically Sentiment, kênh thông tin chuyên cập nhật những diễn biến mới nhất trong các mảng AI, ML, robot cũng như khía cạnh kinh doanh, thương mại hóa của chúng. Thường newsletter sẽ được chuyển tới bạn vào một ngày cố định trong tuần để cập nhật những thông tin nổi bật cũng như bài báo đáng đọc nhất. Podcast Podcast gần giống như các kênh Youtube, cũng có thể subscribe theo dõi thường xuyên qua các ứng dụng podcast (Apple Podcast trên iOS hay Stitcher trên Android) hoặc vào thẳng website của kênh, chỉ khác là thường ở dạng audio nhiều hơn là video. Một số kênh podcast nổi bật được Maddox gợi ý là: - Machine Learning Guide của OCDevel: chuyên đưa ra bình luận về từng tiết học trong khóa Machine Learning của Andrew Ng) - TWiML (This Week in Machine Learning – ML tuần này có gì mới) của Xavier Amatriain, lãnh đạo nhóm ML tại Netflix. - Machine Learning is Hard của Zayd Enam, chuyên gia đến từ Stanford AI Lab – bàn luận cả những chủ đề gai góc mà không nhiều người nhắc đến trong AI. Thực hiện Maddox chia sẻ anh thường theo dõi khóa học online của Coursera vào ban đêm nhưng cũng có khi tận dụng thời gian nghỉ trưa để xem luôn qua app Coursera (mỗi video trong khóa thường chỉ kéo dài vài phút). Một vài điều rút ra trong quá trình học: - Dựa vào một lượng lớn dữ liệu, chúng ta có thể dự đoán khá chính xác những gì xảy ra kế tiếp. - Bạn không nhất thiết phải giỏi toán mới học được: Tự nhận mình không hề giỏi đại số, Maddox vẫn có thể nắm bắt rất nhanh các khái niệm tầm cao. Nghe đến việc phải xử lý dữ liệu và thiết lập thuật toán trong ML, những người không khá toán có thể sẽ lo sợ nhưng thực tế, một khi đã hiểu bản chất, bạn sẽ thấy công việc ở đây chủ yếu sẽ là nhập dữ liệu đầu vào rồi xử lý chúng bằng một số công cụ trong Matlab, không giống toán bạn vẫn học ở phổ thông. - Mỗi loại phần mềm lại được dùng cho một phạm vi riêng: Gradient Descent không phải thứ gì quá thần thánh. Những vấn đề tương tự có thể được giải quyết bằng ứng dụng Calculus qua những phương trình bình thường. Tuy nhiên, cách làm này lại không hiệu quả với những set dữ liệu có trên 10.000 đặc tính. - Hãy quen với sự không chắc chắn: Ngay cả các chuyên gia cũng thường dựa vào những quy tắc bất thành văn và cũng có những điểm không thực sự hiểu rõ về ML. - Debug gần như không thể thực hiện được: Mạng thần kinh nhân tạo cũng giống như những chiếc hộp đen, và thời gian để hoàn thành việc chỉnh sửa code có thể sẽ không nhanh chút nào. - Các câu hỏi (quiz) đưa ra trong khóa học cũng không hề dễ: Bạn phải trả lời đúng 80% số câu hỏi đưa ra trong một bài quiz thì mới gọi là qua được bài đó. Bí quyết ở đây là hãy save các file tài liệu học PDF và đọc kỹ lại trước khi bắt tay vào làm quiz, và đừng quên kiểm tra kỹ câu trả lời trước khi ấn nút nộp bài.  Bình luận TIN NỔI BẬT Chịu trách nhiệm quản lý nội dung: Bà Nguyễn Bích Minh Hà Nội: Tầng 20, Tòa nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Email: info@genk.vn Điện thoại: 024.73095555, máy lẻ 62374 VPĐD tại TP.HCM: Tầng 4, Tòa nhà 123 Võ Văn Tần, Phường 6, Quận 3, Tp. Hồ Chí Minh © Copyright 2010 - 2017 - Công ty Cổ phần VCCorp Tầng 17, 19, 20, 21 Toà nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Trang tin điện tử trên internet: Giấy phép số 460\/GP-TTĐT do Sở Thông tin và Truyền thông Hà Nội cấp ngày 03\/02\/2016 Hotline hỗ trợ quảng cáo: 0942 86 11 33 Email: giaitrixahoi@admicro.vn Hỗ trợ & CSKH: Admicro Address: Tầng 20, Tòa nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội.","relevance":0},{"title":"Bạn nào có đam mê với Machine Learning (Học máy), hay Artifical Intelligence (Trí tuệ nhân tạo) xin mới vào đây cùng giao lưu và học hỏi! - VNOI","url":"http:\/\/vnoi.info\/forum\/6\/4956\/","content":"Mình thấy học máy là một chủ đề hay, cũng có một số người yêu thích và mình là một trong số đó, mình thì mới chỉ bắt đầu tìm hiểu, bây giờ chúng ta cần phải có kế hoạch và lộ trình học tập, điều này cần những anh chị nào đi trước có kinh nghiệm ak? Mình cũng rất thích ML, nên mình cũng đã đề xuất việc cho thêm ML vào VNOI, hi vọng có thể trao đổi & chia sẻ kiến thức với mọi người :D Mình cũng rất thích ML, nên mình cũng đã đề xuất việc cho thêm ML vào VNOI, hi vọng có thể trao đổi & chia sẻ kiến thức với mọi người :D Vâng anh RR, bây giờ thì thế giới cũng đang chú trọng ngành khoa học này nhiều rồi ak, nó có thể ứng dụng tốt cho tương lai, nhưng ở Việt Nam mình thì nó vẫn còn khá mới mẻ ak!  Trước mình học cái Machine Learning của Prof. Andrew Ng trên Coursera (link). Sau khi học khóa này mình nghĩ là bạn sẽ nắm được tương đối về các thuật toán cơ bản & những chủ đề cơ bản mà người ta đang nghiên cứu. Sau đấy thì tùy vào bạn thích cái gì thì có thể tìm tài liệu & nghiên cứu sâu thêm. VD nếu bạn thích nhận dạng ảnh thì cũng có thể học tiếp Convolutional Neural Network. 1 cách khác là bạn có thể thử thi mấy contest trên Kaggle. Cái này thì bạn sẽ luyện được theo hướng ứng dụng hơn :D P.S. Trong quá trình học bạn thấy có gì hay \/ thắc mắc thì hãy post lên VNOI mọi người cùng trao đổi nhé ^_^ Trước mình học cái Machine Learning của Prof. Andrew Ng trên Coursera (link). Sau khi học khóa này mình nghĩ là bạn sẽ nắm được tương đối về các thuật toán cơ bản & những chủ đề cơ bản mà người ta đang nghiên cứu. Sau đấy thì tùy vào bạn thích cái gì thì có thể tìm tài liệu & nghiên cứu sâu thêm. VD nếu bạn thích nhận dạng ảnh thì cũng có thể học tiếp Convolutional Neural Network. 1 cách khác là bạn có thể thử thi mấy contest trên Kaggle. Cái này thì bạn sẽ luyện được theo hướng ứng dụng hơn :D P.S. Trong quá trình học bạn thấy có gì hay \/ thắc mắc thì hãy post lên VNOI mọi người cùng trao đổi nhé ^_^ Vâng ak, cảm ơn anh! E nói chung cũng là kiểu yêu thích tự phát thôi ak, chứ trên giảng đường thì chưa được học về mấy cái này. trên Kaggle e cũng mới tham gia nhưng lúc đầu vẫn bỡ ngỡ chưa biết được nhiều lắm ak!  Vâng ak, cảm ơn anh! E nói chung cũng là kiểu yêu thích tự phát thôi ak, chứ trên giảng đường thì chưa được học về mấy cái này. trên Kaggle e cũng mới tham gia nhưng lúc đầu vẫn bỡ ngỡ chưa biết được nhiều lắm ak!  Mình thấy nếu bạn thi Kaggle, có thể post lên forum giới thiệu + rủ mọi người cùng thi + nói những cái bạn đã làm đc (sau khi contest kết thúc). Mình nghĩ là những chia sẻ như vậy sẽ vô cùng hữu ích cho cộng đồng :D Mình thấy nếu bạn thi Kaggle, có thể post lên forum giới thiệu + rủ mọi người cùng thi + nói những cái bạn đã làm đc (sau khi contest kết thúc). Mình nghĩ là những chia sẻ như vậy sẽ vô cùng hữu ích cho cộng đồng :D Vâng ak, vậy để khi nào e tham gia có kinh nghiệm một chút e sẽ cố gắng chia sẻ những gì em biết ak, chứ bây giờ em cũng mới tìm hiểu thôi ak :) ! Vâng ak, vậy để khi nào e tham gia có kinh nghiệm một chút e sẽ cố gắng chia sẻ những gì em biết ak, chứ bây giờ em cũng mới tìm hiểu thôi ak :) ! Hiện tại em cũng đang học môn Trí Tuệ Nhân Tạo, tuy nhiên vẫn chưa hứng thú lắm vì giảng viên không cho lớp áp dụng thực tế nhiều. Nếu có trang web nào có nhiều problem về trí tuệ nhân tạo kiểu như code 1 game nào đó rồi đấu với nhau giống tin học trẻ bảng C toàn quốc thì hay. :D Hiện tại em cũng đang học môn Trí Tuệ Nhân Tạo, tuy nhiên vẫn chưa hứng thú lắm vì giảng viên không cho lớp áp dụng thực tế nhiều. Nếu có trang web nào có nhiều problem về trí tuệ nhân tạo kiểu như code 1 game nào đó rồi đấu với nhau giống tin học trẻ bảng C toàn quốc thì hay. :D Giờ chắc là có khá nhiều trang web có contest cho AI, ví dụ mình vừa Google thử thì ra cái này. Nhân đây, mình cũng xin bon chen giới thiệu 1 khóa học Online về Machine Learning (Hay và có thể nói là khó hơn khóa học của Anrew). Đó là https:\/\/work.caltech.edu\/telecourse.html Trong khóa học này có 18 lectures, chia ra là 3 phần: theory - Lý thuyết về toán học, technique - Kỹ thuật ứng dụng và analysis - Những khái niệm. Và có 10 bài (cứ sau 2 tiết học là có 1 bài tập, và 1 bài tổng kết). Bạn nào có hứng thú thì học khóa học này và thảo luận cho vui. :) Nhân đây, mình cũng xin bon chen giới thiệu 1 khóa học Online về Machine Learning (Hay và có thể nói là khó hơn khóa học của Anrew). Đó là https:\/\/work.caltech.edu\/telecourse.html Trong khóa học này có 18 lectures, chia ra là 3 phần: theory - Lý thuyết về toán học, technique - Kỹ thuật ứng dụng và analysis - Những khái niệm. Và có 10 bài (cứ sau 2 tiết học là có 1 bài tập, và 1 bài tổng kết). Bạn nào có hứng thú thì học khóa học này và thảo luận cho vui. :) Mình cũng từng đọc qua course trên nhưng thiếu người để trao đổi \/ hỏi bài \/ hướng dẫn nên học nửa đường đứt gánh =)). Nếu có điều kiện thì tạo 1 group slack hoặc fb để trao đổi cho tiện. email: dung1@e.ntu.edu.sg.  Mình cũng từng đọc qua course trên nhưng thiếu người để trao đổi \/ hỏi bài \/ hướng dẫn nên học nửa đường đứt gánh =)). Nếu có điều kiện thì tạo 1 group slack hoặc fb để trao đổi cho tiện. email: dung1@e.ntu.edu.sg.  Hi bạn, oke. Mình mới tạo 1 group trên slack: https:\/\/mlvngroup.slack.com\/ Khóa học này mình cũng nghe sơ qua và đuối giữa chừng vì tiếng Anh mình kém :) Nên hi vọng sẽ cùng nhau trao đổi \/ thảo luận để cùng nhau học xong khóa này :) Email mình: ntthanhpy@gmail.com Nhân đây, mình cũng xin bon chen giới thiệu 1 khóa học Online về Machine Learning (Hay và có thể nói là khó hơn khóa học của Anrew). Đó là https:\/\/work.caltech.edu\/telecourse.html Trong khóa học này có 18 lectures, chia ra là 3 phần: theory - Lý","relevance":0},{"title":"Sự khác nhau giữa Ai, Machine learning và deep learning | Tech Talk","url":"https:\/\/techtalk.vn\/su-khac-nhau-giua-tri-tue-nhan-tao-may-hoc-va-deep-learning.html","content":"Đây là bài viết đầu tiên trong series nhiều phần giải thích các nguyên tắc cơ bản của deep learnining – nhà báo Michael Copeland. Trí tuệ nhân tạo (AI) là tương lai. Trí tuệ nhân không chỉ là khoa học viễn tưởng mà còn là một phần của cuộc sống hàng ngày của chúng ta. Nó phụ thuộc vào mục tiêu phát triển AI của bạn Ví dụ: Khi  AlphaGo của Google đánh bại kì thủ cờ vây quốc tế người Hàn Quốc Lee Se-Dol vào năm 2016. Thuật ngữ AI, machine learning và deep learning được giới truyền thông sử dụng để mô tả chiến thắng của DeepMind. Cả AI, machine learning và deep learning đều góp phần tạo nên chiến thắng của AlphaGo trước kì thủ Se-Dol. Nhưng chúng không giống nhau. Cách đơn giản nhất để hình dung về mối quan hệ của 3 khái niệm trên là dùng sơ đồ Venn. AI – ý tưởng đầu tiên – lớn nhất, sau đó là machine learning, và cuối cùng là deep learning – yếu tố thúc đẩy sự bùng nổ của AI ngày nay .  AI là một phần trong trí tưởng tượng của chúng ta và là chủ đề bàn luận sôi nổi trong các phòng thí nghiệm nghiên cứu kể từ khi một nhóm các nhà khoa học máy tính sử dụng thuật ngữ này tại Hội nghị Dartmouth vào năm 1956 – lĩnh vực AI bắt đầu từ đó. Trong nhiều thập kỷ sau đó, AI được dự đoán là chìa khóa mở ra một tương lai tươi sáng nhất của nền văn minh nhân loại, khái niệm harebrained của over-reach propellerheads sẽ bị vứt bỏ. Thành thật mà nói, cho đến năm 2012, nó có một chút là sự kết hợp cả hai. Trong vài năm trở lại đây, AI thật sự bùng nổ, đặc biệt là từ năm 2015. Phần lớn trong số đó liên quan đến những tiện ích sẵn có của GPU khiến cho việc xử lý song song nhanh, rẻ và mạnh mẽ hơn. Nó cũng liên quan đến cả vấn đề lưu trữ vô hạn trong thực tiễn và nhóm dữ liệu trên mỗi vạch (toàn bộ quá trình Big Data) – hình ảnh, văn bản, giao dịch, sơ đồ dữ liệu… Cùng điểm qua chặng đường các nhà khoa học máy tính đã phát triển AI từ mờ nhạt để trở thành một sự bùng nổ với các ứng dụng được sử dụng bởi hàng trăm triệu người mỗi ngày.  Trở lại mùa hè năm 1956, ước mơ của những nhà tiên phong về công nghệ bấy giờ là xây dựng các máy móc phức tạp – có đặc điểm giống với trí thông minh con người. Đây là khái niệm mà chúng ta nghĩ là “General AI” – những thiết bị hoàn hảo có tất cả các giác quan của con người (có thể nhiều hơn), có khả năng suy đoán, suy nghĩ như chúng ta. Có thể bạn đã nhìn thấy nó trong một loạt các bộ phim như friend —  C-3PO —  and foe —  The Terminator. Tuy nhiên, General AI vẫn còn nằm trong các bộ phim và tiểu thuyết khoa học viễn tưởng vì lý do nhân đạo. Chúng ta không thể thực tế nó, hoặc ít nhất là chưa phải lúc này. Những gì chúng ta có thể làm, rơi vào khái niệm “Narrow AI“. Các công nghệ có khả năng thực hiện các nhiệm vụ cụ thể tương đương, hoặc tốt hơn con người có thể làm. Ví dụ về Narrow AI là những thứ như phân loại hình ảnh trên một dịch vụ như Pinterest và nhận dạng khuôn mặt trên Facebook. Đó là những ví dụ về Narrow AI trong thực tế. Những công nghệ này thể hiện một số khía cạnh của trí thông minh con người. Nhưng bằng cách nào? Trí tuệ đó ​​đến từ đâu? Điều đó đưa chúng ta tới vòng tròn tiếp theo, Machine learning.  Machine learning theo định nghĩa cơ bản là ứng dụng các thuật toán để phân tích cú pháp dữ liệu, học hỏi từ nó, và sau đó thực hiện một quyết định hoặc dự đoán về các vấn đề có liên quan. Vì vậy, thay vì code phần mềm bằng cách thức thủ công với một bộ hướng dẫn cụ thể để hoàn thành một nhiệm vụ cụ thể, máy được “đào tạo” bằng cách sử dụng một lượng lớn dữ liệu và các thuật toán cho phép nó học cách thực hiện các tác vụ. Machine learning bắt nguồn từ các định nghĩa về AI ban đầu, và các phương pháp tiếp cận thuật toán qua nhiều năm bao gồm:logic programming, clustering, reinforcement learning, and Bayesian networks. Như chúng ta đã biết, không ai đạt được mục tiêu cuối cùng của General AI, và thậm chí cả Narrow AI hầu hết là ngoài tầm với những phương pháp tiếp cận Machine learning sơ khai. Một trong những lĩnh vực ứng dụng tốt nhất cho Machine learning trong nhiều năm qua là computer vision, mặc dù nó vẫn đòi hỏi rất nhiều kỹ năng code thủ công để có thể hoàn thành công việc. Mọi người vẫn sẽ viết các lớp phân loại bằng tay như các bộ lọc để chương trình có thể xác định nơi mà một đối tượng bắt đầu và kết thúc. Phát hiện hình dạng để xác định nếu nó có tám mặt. Một phân loại để nhận dạng các chữ cái “S-T-O-P”. Từ tất cả những ứng dụng phân loại, họ sẽ phát triển các thuật toán để làm cho hình ảnh và “học” khả năng nhận diện dấu hiệu liệu nó có phải là kí hiệu stop hay không? . Tốt, nhưng không hoàn toàn hoàn hảo. Đặc biệt vào một ngày sương mù khi tầm nhìn không thấy rõ, hoặc cây che khuất một phần. Đó là lý do khiến computer vision và image detection không gây được thiện cảm, vì nó quá nhạy cảm và dễ phát sinh lỗi. Thời gian, và ứng dụng đúng thuật toán đã tạo ra sự khác biệt.  Một phương pháp tiếp cận thuật toán khác từ cộng đồng machine-learning, Artificial Neural Networks, được nhắc đến nhiều thập kỷ qua. Neural Networks được lấy cảm hứng từ sự hiểu biết về sinh học của bộ não loài người – sự liên kết giữa các nơ-ron. Tuy nhiên, không giống như một bộ não sinh học nơi mà bất kỳ nơ-ron nào cũng có thể liên kết với các nơ-ron khác trong một khoảng cách vật lý nhất định, các mạng thần kinh nhân tạo này có các lớp rời rạc, các kết nối, và các hướng truyền dữ liệu. Chẳng hạn, bạn có thể lấy một hình ảnh, cắt nó thành một nhóm được đặt vào lớp đầu tiên của mạng thần kinh nhân tạo. Trong lớp đầu tiên các nơ-ron cá nhân truyền dữ liệu đến lớp thứ hai. Lớp thứ hai của nơ-ron làm nhiệm vụ của nó, và như vậy, cho đến khi lớp cuối cùng và cho ra sản phẩm cuối cùng. Mỗi nơ-ron đả","relevance":0},{"title":"Tất tần tật về Machine Learning & ứng dụng trong những ngành công nghiệp lớn | Tech Talk","url":"https:\/\/techtalk.vn\/tat-tan-tat-moi-kien-thuc-co-ban-ve-machine-learning.html","content":"Có 2 định nghĩa khá rõ ràng về Machine Learning như sau: Ví dụ cho định nghĩa của Tom Mitchell Tác vụ T: Xác định 1 tin nhắn có phải SPAM hay không? Kinh nghiệm E: Xem lại những tin nhắn đánh dấu là SPAM xem có những đặc tính gì để có thể xác định nó là SPAM. Độ đo P: Là phần trăm số tin nhắn SPAM được phân loại đúng. T: Là nhận dạng được ảnh chứa ký tự số. E: Đặc trưng để phân loại ký tự số từ tập dữ liệu số cho trước. P: Độ chính xác của quá trình nhận dạng.     Mối liên hệ giữa Trí Tuệ Nhân Tạo với các nhánh học như Máy Học, Biểu Diễn Tri Thức và Suy Luận, Xử Lý Ngôn Ngữ Tự Nhiên, Thị Giác Máy Tính… Nhờ vào công nghệ điện toán, ngày nay Machine Learning không còn là máy tính “học” những chuyện trong quá khứ nữa. Machine Learning được sinh ra từ khả năng nhận diện pattern và từ lý thuyết các máy tính có thể “học” mà không cần phải lập trình để thực hiện các tasks cụ thể đó. Về phía các nhà nghiên cứu quan tâm đến trí tuệ nhân tạo, họ lại muốn xem thử liệu máy tính có thể học dữ liệu như thế nào. Yếu tố lặp trong Machine Learning rất quan trọng vì khi các models tiếp xúc với dữ liệu mới, Machine Learning có thể thích ứng được 1 cách độc lập. Machine Learning sẽ “học” các computations trước để trả về các kết quả, các quyết định đáng tin cậy, lặp lại được. Từ lâu đã có nhiều thuật toán Machine Learning nổi tiếng nhưng khả năng tự động áp dụng các phép tính phức tạp vào Big Data – lặp đi lặp lại với tốc độ nhanh hơn – chỉ mới phát triển gần đây. TopDev Techtalk #52: Công nghệ của tương lai: Đột phá gì từ Machine Learning? *Hồ Chí Minh: 18h00 – 21h00 ngày 02\/12\/2016.  Các ứng dụng của Machine Learning đã trở nên quá quen thuộc như: Hầu hết mọi ngành công nghiệp đang làm việc với hàm lượng lớn dữ liệu đều nhận ra tầm quan trọng của công nghệ Machine Learning. Những insights từ nguồn dữ liệu này – chủ yếu dạng realtime – sẽ giúp các tổ chức vận hành hiệu quả hơn hoặc tạo được lợi thế cạnh tranh so với các đối thủ. Ngân hàng và những doanh nghiệp hoạt động trong lĩnh vực tài chính sử dụng công nghệ Machine Learning với 2 mục đích chính: xác định insights trong dữ liệu và ngăn chặn lừa đảo. Insights sẽ biết được các cơ hội đầu tư hoặc thông báo đến nhà đầu tư thời điểm giao dịch hợp lý. Data mining cũng có thể tìm được những khách hàng đang có hồ sơ rủi ro cao hoặc sử dụng giám sát mạng để chỉ rõ những tín hiệu lừa đảo. Các tổ chức chính phủ hoạt động về an ninh cộng đồng hoặc tiện ích xã hội sở hữu rất nhiều nguồn dữ liệu có thể khai thác insights. Ví dụ, khi phân tích dữ liệu cảm biến, chính phủ sẽ tăng mức độ hiệu quả của dịch vụ và tiết kiệm chi phí. Machine Learning còn hỗ trợ phát hiện gian lận và giảm thiểu khả năng trộm cắp danh tính. Machine Learning là 1 xu hướng phát triển nhanh chóng trong ngành chăm sóc sức khỏe, nhờ vào sự ra đời của các thiết bị và máy cảm ứng đeo được sử dụng dữ liệu để đánh giá tình hình sức khỏe của bệnh nhân trong thời gian thực (real-time). Công nghệ Machine Learning còn giúp các chuyên gia y tế xác định những xu hướng hoặc tín hiệu để cải thiện khả năng điều trị, chẩn đoán bệnh. Dựa trên hành vi mua hàng trước đây, các trang web sử dụng Machine Learning phân tích lịch sử mua hàng, từ đó giới thiệu những vật dụng mà bạn có thể sẽ quan tâm và yêu thích. Khả năng tiếp nhận dữ liệu, phân tích và sử dụng những dữ liệu đó để cá nhân hóa trải nghiệm mua sắm (hoặc thực hiện chiến dịch Marketing) chính là tương tai của ngành bán lẻ. Tìm kiếm những nguồn nguyên liệu mới. Phân tích các mỏ dầu dưới đất. Dự đoán tình trạng thất bại của bộ cảm biến lọc dầu. Sắp xếp các kênh phân phối để đạt hiệu quả và tiết kiệm chi phí. Có thể nói, số lượng các trường hợp sử dụng Machine Learning trong ngành công nghiệp này cực kì lớn và vẫn ngày càng mở rộng. Phân tích dữ liệu để xác định patterns & các xu hướng là trọng tâm trong ngành vận tải vì đây là ngành phụ thuộc vào khả năng tận dụng hiệu quả trên mỗi tuyến đường và dự đoán các vấn đề tiềm tàng để gia tăng lợi nhuận. Các chức năng phân tích dữ liệu và modeling của Machine Learning đóng vai trò quan trọng với các doanh nghiệp vận chuyện, vận tải công cộng và các tổ chức vận chuyển khác. Hai methods của Machine Learning được chấp nhận rộng rãi chính là supervised learning (học có giám sát) và unsupervised learning (học không giám sát) nhưng cũng có những methods khác như semisupervised learning (học bán giám sát), reinforcement learning (học tăng cường) Dưới đây là khái niệm chung về 2 phương pháp phổ biến nhất: Supervised Learning (SL) là một kĩ thuật học máy để học tập từ tập dữ liệu được gán nhãn cho trước. Tập dữ liệu cho trước sẽ chứa nhiều bộ dữ liệu. Mỗi bộ dữ liệu có cấu trúc theo cặp {x, y} với x được xem là dữ liệu thô (raw data) và y là nhãn của dữ liệu đó. Nhiệm vụ của SL là dự đoán đầu ra mong muốn dựa vào giá trị đầu vào. Dễ nhận ra, học có GIÁM SÁT tức là máy học dựa vào sự trợ giúp của con người, hay nói cách khác con người dạy cho máy học và giá trị đầu ra mong muốn được định trước bởi con người. Tập dữ liệu huấn luyện hoàn toàn được gán nhãn dựa vào con người. Tập càng nhỏ thì máy tính học càng ít. SL cũng được áp dụng cho 2 nhóm bài toán chính là bài toán dự đoán (regression problem) và bài toán phân lớp (classification problem). Kỹ thuật SL thực chất là để xây dựng một hàm có thể xuất ra giá trị đầu ra tương ứng với tập dữ liệu. Ta gọi hàm này là hàm h(x) và mong muốn hàm này xuất ra đúng giá trị y với một hoặc nhiều tập dữ liệu mới khác với dữ liệu được học. Hàm h(x) cần các loại tham số học khác nhau tùy thuộc với nhiều bài toán khác nhau. Việc học từ tập dữ liệu (training) cũng chính là tìm ra bộ tham số học cho hà","relevance":1},{"title":"Khái niệm máy học hay học máy (machine learning) và các mốc phát triển – Trịnh Minh Giang | Weblog","url":"https:\/\/gmtvn.wordpress.com\/2016\/02\/29\/may-hoc-machine-learning-la-gi-va-cac-moc-phat-trien\/","content":"Máy học (machine learning) là một phần của trí tuệ nhân tạo trong đó các thuật toán máy tính được sử dụng để tự học từ dữ liệu và thông tin. Trong machine learning, máy tính không cần phải được lập trình một cách rõ ràng mà có thể tự thay đổi và cải thiện các thuật toán của mình. Theo wiki: machine learning là một lĩnh vực của trí tuệ nhân tạo liên quan đến việc nghiên cứu và xây dựng các kĩ thuật cho phép các hệ thống “học” tự động từ dữ liệu để giải quyết những vấn đề cụ thể. Ví dụ như các máy có thể “học” cách phân loại thư điện tử xem có phải thư rác (spam) hay không và tự động xếp thư vào thư mục tương ứng. Thế nhưng machine learning đã đi xa hơn những khái niệm ban đầu rất nhiều. (ND) Ngày nay, các thuật toán machine learning cho phép máy tính giao tiếp với con người, tự lái xe, viết và đăng các bản tin về các trận thi đấu thể thao, hay thậm chí tìm kiếm kẻ tình nghi khủng bố. Chắc chắn rằng học máy sẽ tác động mạnh mẽ lên hầu hết các ngành và các công việc của mỗi ngành. Đó là lý do tại sao mọi nhà quản lý cần phải có hiểu biết tối thiểu về machine learning và sự tiến hoá của nó. Trong bài này, tác giả đưa ra một lược sử thời gian xác định nguồn gốc machine learning cũng như các mốc thời gian quan trọng nhất. 1950 – Alan Turing tạo ra phép thử Turing (Turing Test) để xác định xem một máy tính có trí thông minh thực sự hay không. Để vượt qua các phép thử, máy tính phải có khả năng đánh lừa một người tin rằng nó cũng là con người. 1952 – Arthur Samuel đã viết chương trình máy học đầu tiên. Chương trình này là trò cờ đam, và máy tính IBM càng chơi càng tiến bộ, học được các nước đi tạo lập nên chiến lược để chiến thắng và tích hợp các nước đi đó vào chương trình của mình. 1957 – Frank Rosenblatt thiết kế hệ thần kinh (neural network) đầu tiên cho máy tính (gọi là “perceptron”) mô phỏng các quá trình tư duy của não người. 1967 – Thuật toán “điểm lân cận gần nhất” (nearest neighbor) được viết ra cho phép các máy tính bắt đầu sử dụng dạng mẫu nhận thức rất cơ bản. Thuật toán này có thể được sử dụng để vẽ một tuyến đường cho nhân viên bán hàng lưu động, bắt đầu từ một thành phố ngẫu nhiên nhưng đảm bảo họ tới tất cả các thành phố trong một chuyến đi ngắn. 1979 – Sinh viên Đại học Standford phát minh ra xe “Standford Cart” có thể tự xác định được vật cản trong phòng. 1981 – Gerald Dejong giới thiệu khái niệm Học qua giải thích (Explanation Based Learning – EBL), trong đó một máy tính phân tích dữ liệu huấn luyện và tạo ra một quy tắc chung mà nó có thể làm theo bằng cách loại bỏ các dữ liệu không quan trọng. 1985 – Terry Sejnowski phát minh ra NetTalk, học cách phát âm các giống như một đứa trẻ. 1990s – Các nghiên cứu về marchine learning chuyển từ cách tiếp cận hướng-kiến-​​thức sang cách tiếp cận hướng-dữ-liệu. Các nhà khoa học bắt đầu tạo các chương trình cho máy tính để phân tích một lượng lớn dữ liệu và rút ra kết luận – hay “học” – từ các kết quả. 1997 – Máy tính Deep Blue của IBM đánh bại nhà vô địch cờ vua thế giới. 2006 – Geoffrey Hinton tạo ra thuật ngữ “học sâu” (deep learning) để giải thích các thuật toán mới cho phép các máy tính “nhìn thấy” và phân biệt các đối tượng và văn bản trong hình ảnh và video. 2010 – Máy Microsoft Kinect có thể theo dõi 20 tính năng của con người ở tốc độ 30 lần mỗi giây, cho phép mọi người tương tác với máy tính thông qua các động tác và cử chỉ. 2011 – Máy IBM Watson đánh bại các đối thủ con người tại Jeopardy. 2011 – Google Brain được phát triển, và hệ thần kinh sâu (deep neural network) của nó có thể học để phát hiện và phân loại các đối tượng bằng với khả năng của một chú mèo. 2012 – X Lab của Google phát triển một thuật toán machine learning có khả năng tự duyệt video YouTube để xác định các video có chứa hình ảnh mèo. 2014 – Facebook phát triển DeepFace, một thuật toán phần mềm có thể nhận diện hoặc xác minh các cá nhân trong các bức ảnh ở mức độ ngang với con người. 2015 – Amazon ra mắt nền tảng machine learning riêng của mình. 2015 – Microsoft tạo ra bộ công cụ máy học được phân bổ (Distributed Machine Learning Toolkit), cho phép phân bổ hiệu quả machine learning trên nhiều máy tính. 2015 – Hơn 3.000 nhà nghiên cứu về AI và Robotics, được Stephen Hawking, Elon Musk và Steve Wozniak (và nhiều người khác) hậu thuẫn, đã ký một bức thư ngỏ cảnh báo nguy cơ của vũ khí tự hành có thể lựa chọn và nhắm vào các mục tiêu mà không cần sự can thiệp của con người. 2016 – Thuật toán trí tuệ nhân tạo (artificial intelligence algorithm) của Google đã đánh bại một cầu thủ chuyên nghiệp trong trò cờ Go của Trung Quốc, vốn được coi là trò cờ phức tạp nhất thế giới và khó hơn cờ vua gấp nhiều lần. Thuật toán AlphaGo do Google DeepMind phát triển đã giành chiến thắng năm trên năm trận đấu Go. Vậy liệu chúng ta đã tiến gần tới trí tuệ nhân tạo chưa? Một số nhà khoa học cho rằng đó thực ra là một câu hỏi sai. Họ tin rằng một máy tính sẽ không bao giờ “nghĩ” theo cách của bộ não con người, và việc so sánh các phân tích tính toán và thuật toán của một máy tính với mưu cao kế sâu của trí óc con người cũng giống như so sánh trái táo với trái cam vậy. Dù thế nào, khả năng nhìn, hiểu và tương tác với thế giới xung quanh của máy tính đang phát triển với một tốc độ đáng kể. Và khi lượng dữ liệu mà chúng ta tạo ra tiếp tục phát triển theo cấp số nhân thì khả năng xử lý và phân tích của máy tính cũng sẽ tăng lên tương ứng. — Trịnh Minh Giang | 29.02.2016 Dịch từ: Bernard Marr, “Machine Learning: What It Is And The Milestones Everyone Should Know About?”, LinkedIn Pulse, 24 Feb 2016. Fill in your details below or click an icon to log in: You are commenting using your WordPress.com a","relevance":1},{"title":"Machine Learning | Huy's Blog","url":"https:\/\/huytd.github.io\/posts\/machine-learning-com-binh-dan.html","content":"Disclaimer: Đây là một lĩnh vực vô cùng rộng và sâu, cho nên tất nhiên không thể nào tóm gọn hết trong một bài viết được, cho nên ở phạm vi bài này, mình chỉ cung cấp một vài khái niệm cơ bản và đưa ra 01 ví dụ về một dạng vấn đề đơn giản nhất mà Machine Learning có thể giải quyết được, mục đích là giúp cho các bạn hiểu được bản chất Machine Learning là gì, và nên nghiên cứu, tiếp cận nó ra sao. Machine Learning một số người gọi là “máy học”, có người gọi là “học máy”, nghe có vẻ khó hình dung, rốt cuộc ai học ai, máy học ai, ai học máy, máy học cái gì,… loạn quá nên thôi cứ gọi là Machine Learning cho khỏe nhé. Machine Learning là một mảng của ngành Khoa học máy tính, có nhiệm vụ nghiên cứu để giúp cho máy tính có khả năng “học hỏi” mà không cần lập trình cụ thể ngay từ đầu. Học hỏi ở đây tức là có khả năng tiếp nhận, xử lý thông tin và đưa ra nhận định, phân loại\/dự đoán sau đó. Tuy là một ngành khoa học máy tính nhưng ứng dụng của Machine Learning thì xuất hiện trong mọi ngành nghề, lĩnh vực trong đời sống: Machine Learning là một lĩnh vực rất gần, và đôi lúc có sự tương quan nhất định đối với toán học, điển hình như môn xác suất thống kê. Ở các phần sau của bài viết sẽ nói chi tiết về điểm này. Không cần giỏi toán, các bạn vẫn có thể theo đuổi việc nghiên cứu Machine Learning được. Tuy nhiên, nếu các bạn không chuẩn bị tinh thần để vò đầu bứt tai với một vài công thức toán học hay làm các bài đạo hàm cỡ vài chục dòng :joy: thì các bạn chỉ có thể tiếp cận Machine Learning ở phạm vi “biết đủ xài”, nhưng sẽ không thực sự “hiểu” được nó. https:\/\/www.analyticsvidhya.com\/blog\/2015\/08\/common-machine-learning-algorithms\/  Created with azeroth.js","relevance":1},{"title":"Google Phác Họa Qui Trình Máy Học (Machine Learning) – Phần 2 | ANTS Blog – Thông tin về Quảng cáo hiệu quả, DSP, Exchange, SSP, AdTech Việt Nam","url":"http:\/\/blog.ants.vn\/google-phac-hoa-qui-trinh-hoc-may-machine-learning-phan-2\/","content":"Nhiều người rất thắc mắc về thuật toán đã giúp hệ thống Machine Learning thực hiện các điều chỉnh rất nhỏ đối với các thông số để cải tiến mô hình như mô tả ở trên. Corrado nhấn mạnh rằng phần quan trọng nhất của hầu hết các thuật toán Machine learning liên quan đến khái niệm tối ưu hóa Gradient (Gradient learning). Nghĩa là bắt đầu từ một điểm được dự đoán là điểm tối ưu, hệ thống tiến hành “thử và sai”, thực hiện từng bước điều chỉnh ngày càng nhỏ, lặp đi lặp lại cho đến khi đạt được kết quả đúng nhất. Cũng tương tự như việc leo xuống một sườn núi dốc đứng, bạn không thể nhảy cóc hay chạy nhanh vì nguy cơ té ngã rất cao. Thay vào đó cẩn thận từng bước một sẽ giúp bạn đến đích an toàn.  Tóm lại, dù vấn đề trong thực tế có phức tạp đến đâu thì nó cũng có thể được giải quyết bởi các thuật toán Machine learning bởi sau cùng mọi thứ đều được qui về khía cạnh toán học thuần túy. Quan trọng nhất là khả năng của máy tính có đủ sức thực hiện các bước tối ưu hóa lặp đi lặp lại trong một thời gian dài hay không. Điều đáng mừng là hiện nay hệ thống xử lý máy tính ngày một phát triển nhanh chóng, biến những thuật toán vài năm trước đây được cho là ‘bất khả thi’ trở thành các ứng dụng thực tế. Ví dụ về kết quả học tập ở phần trước chỉ là một ứng dụng đơn giản của Machine learning. Về cơ bản, một hệ thống Machine learning thường được sử dụng cho các công việc phức tạp hơn. Ví dụ như nhận dạng vật thể thông qua các bức tranh. Máy tính không thể quan sát theo cách con người nhìn mọi thứ xung quanh mình. Vậy làm thế nào chúng có thể nhận dạng vật thể – như cách mà ứng dụng Google Photos chọn ra rất nhiều vật thể chính xác từ trong các bức ảnh của người dùng? Tất cả là nhờ quá trình Machine learning. Ví dụ như bạn muốn máy tính nhận dạng chú mèo trong bức ảnh. Đầu tiên, bạn xây dựng một mô hình gồm các yếu tố giúp nhận dạng một con mèo, gồm màu sắc hình dáng và một số tính năng khác. Sau đó bạn đưa ra một tập huấn luyện gồm các bức tranh để xem mô hình khớp như thế nào với thực tế, và liệu có thực sự nhận dạng đúng được con mèo trong các bức tranh này hay không. Cơ chế Learner sau đó sẽ thực hiện các điều chỉnh, và vòng lặp ‘huấn luyện’ sẽ tiếp tục cho đến khi nào hệ thống học được cách nhận dạng chính xác. Bên dưới là hình ảnh mô phỏng cách nhìn của máy tính đối với bức ảnh một chú mèo nằm trên thảm. Hệ thống trí tuệ nhân tạo mô phỏng hệ thần kinh của con người này được Google ra mắt với tên gọi DeepDream.    Nó có thể tự định nghĩa các khái niệm thông qua hàng nghìn bức ảnh dữ liệu đầu vào. Sau đó sử dụng các định nghĩa này để tự nhận biết, ví dụ như đâu là ngôi nhà, đâu là một chú chó trong một bức ảnh. Hệ thống này vẫn chưa thực sự hoàn thiện, khiến cho những hình ảnh mà nó tạo ra theo định nghĩa của mình chưa rõ ràng và lẫn lộn. Thực tế quá trình nhận dạng mèo, hay bất cứ vật thể nào khác khá phức tạp bởi có vô vàn thông số liên quan được sử dụng cho mô hình, và Google vẫn đang trong quá trình cải tiến. Hãy thử tưởng tượng phức tạp hơn một chút, thay vì nhận dạng vật thể, bạn muốn máy tính nhận dạng được các sự kiện. Google giải thích rằng bạn cần phải giúp bổ sung vào hệ thống máy tính một số nguyên tắc nhận thức cơ bản và một vài lời hướng dẫn giúp qui trình Machine learning hiểu được cách các vật thể khác nhau tác động và góp phần tạo nên một sự kiện.  Ở ví dụ trên, hệ thống Machine learning thấy được 1 cậu bé, 1 giỏ đồ và 1 quả trứng. Nhưng thứ con người nhận thấy từ các thông tin trên chính là “hoạt động tìm trứng phục sinh của một bé trai”. Vậy làm thế nào Machine learning có thể nhận biết được sự kiện thông qua các hình ảnh như não bộ con người ở trên. Tại sự kiện Machine Learning 101, Google không đi vào chi tiết vấn đề này. Chính xác hơn là gần như không đề cập trong suốt buổi thảo luận chính thức và chỉ có một ít được tiết lộ qua buổi trò chuyện lúc nghỉ giải lao. Cũng dễ hiểu vì các thông tin này là chìa khóa tạo nên thành công cho bộ máy tìm kiếm khổng lồ Google. Nhưng ít nhất chúng ta đã có được cái nhìn cơ bản về cách Machine learning hoạt động, và có quyền hy vọng nhiều hơn nữa về một tương lai mày máy tính có thể giúp con người xử lý vô vàn các vấn đề phức tạp với mức độ chính xác cao nhất và thời gian nhanh nhất có thể. (Theo www.marketingland.com) ANTS Blog is the leading source of news for data-driven marketing, adtech and digital performance advertising in Vietnam. It delivers insightful, forward-thinking content across various platforms. ANTS Blog is a must-read for CMOs, creatives, media publishers, content creators, agency heads and anyone looking to stay informed about the digital advertising landscape. Subscribe to our email newsletter .","relevance":1},{"title":"10 thuật toán học máy mà các kỹ sư cần biết - Viblo","url":"https:\/\/viblo.asia\/p\/10-thuat-toan-hoc-may-ma-cac-ky-su-can-biet-RQqKLn8ml7z","content":"Không còn nghi ngờ gì nữa, lĩnh vực học máy \/ trí tuệ nhân tạo (AI) đã ngày càng trở nên phổ biến hơn trong vài năm qua. Một nhánh nhỏ của nó là Big Data đang là xu hướng hot nhất trong ngành công nghệ cao hiện nay, học máy trở nên rất mạnh mẽ để đưa ra các dự đoán hoặc gợi ý được tính dựa trên số lượng lớn dữ liệu. Một số ví dụ phổ biến nhất về học máy là các thuật toán của Netflix để đưa ra các gợi ý về phim dựa trên những bộ phim mà bạn đã xem trong quá khứ hoặc các thuật toán của Amazon đề xuất các sách dựa trên sách mà bạn đã mua trước đây. Những hệ thống gợi ý đó (Recommended System) sẽ giúp ích khá nhiều cho những người dùng trong việc đưa ra những lựa chọn của mình. Ngoài ra, AI còn có những khả năng như nhận dạng biển số xe tự động, giúp sửa lỗi chính tả, tạo các con robot có khả năng giao tiếp với con người,...Còn nhiều nhiều những khả năng mà AI có thể làm được. AI đang phát triển và sẽ còn phát triển mạnh trong tương lai. Machine Learning được chia thành 3 nhánh chính: supervised learning (học có giám sát), unsupervised learning (học không có giám sát), và reinforcement learning (học tăng cường). Dưới đây là 10 thuật toán rơi vào 2 loại đầu tiên, hi vọng vẫn đủ để bạn quan tâm: Cây quyết định là công cụ hỗ trợ quyết định sử dụng biểu đồ dạng cây hoặc mô hình của các quyết định và kết quả có thể xảy ra của chúng, bao gồm kết quả sự kiện ngẫu nhiên, chi phí tài nguyên và lợi ích. Dưới đây là một ví dụ điển hình của cây quyết định: Cây quyết định này cho ta gợi ý về việc có đi đá bóng hay không. Ví dụ, quang cảnh có nắng, độ ẩm trung bình thì tôi sẽ đi đá bóng. Ngược lại, nếu trời mưa, gió mạnh thì tôi sẽ không đi đá bóng nữa. Cây quyết định tuy là mô hình khá cũ, khá đơn giản những vẫn còn được ứng dụng khá nhiều và hiệu quả. Đứng dưới góc nhìn thực tế, cây quyết định là một danh sách tối thiểu các câu hỏi dạng yes\/no mà người ta phải hỏi, để đánh giá xác suất đưa ra quyết định đúng đắn. Phân loại Bayes là một nhóm các phân loại xác suất đơn giản dựa trên việc áp dụng định lý Bayes với các giả định độc lập (naïve) giữa các đặc tính.  Trong đó: P(A|B) là xác suất có điều kiện A khi biết B, P(A) là xác suất giả thuyết A (tri thức có được về giải thuyết A trước khi có dữ liệu B), P(B|A) là xác suất có điều kiện B khi biết giả thuyết A, P(B) là xác suất của dữ liệu quan sát B không quan tâm đến bất kỳ giả thuyết A nào. Thuật toán này được áp dụng trong một số bài toán như: Nếu bạn biết thống kê, bạn có thể đã nghe nói về hồi quy tuyến tính trước đây. Bình phương nhỏ nhất là một phương pháp để thực hiện hồi quy tuyến tính. Bạn có thể suy nghĩ về hồi quy tuyến tính như là nhiệm vụ kẻ một đường thẳng đi qua một tập các điểm. Có rất nhiều chiến lược có thể thực hiện được, và chiến lược \"bình phương nhỏ nhất\" sẽ như thế này - Bạn có thể vẽ một đường thẳng, và sau đó với mỗi điểm dữ liệu, đo khoảng cách thẳng đứng giữa điểm và đường thẳng. Đường phù hợp nhất sẽ là đường mà các khoảng cách này càng nhỏ càng tốt. Một số ví dụ là người ta có thể sử dụng mô hình này để dự đoán giá cả (nhà đất, chứng khoán), điểm số,... Hồi quy logistic là một cách thống kê mạnh mẽ để mô hình hóa một kết quả nhị thức với một hoặc nhiều biến giải thích. Nó đo lường mối quan hệ giữa biến phụ thuộc phân loại và một hoặc nhiều biến độc lập bằng cách ước tính xác suất sử dụng một hàm logistic, là sự phân bố tích lũy logistic. Thuật toán này được sử dụng trong một số trường hợp: SVM là phương pháp phân loại nhị phân. Cho một tập các điểm thuộc 2 loại trong môi trường N chiều, SVM cố gắng tìm ra N-1 mặt phẳng để phân tách các điểm đó thành 2 nhóm. Ví dụ, cho một tập các điểm thuộc 2 loại như hình bên dưới, SVM sẽ tìm ra một đường thẳng nhằm phân cách các điểm đó thành 2 nhóm sao cho khoảng cách giữa đường thẳng và các điểm xa nhất có thể. Xét về quy mô, một số vấn đề lớn nhất đã được giải quyết bằng cách sử dụng SVM (với việc thực hiện sửa đổi phù hợp) ví dụ như hiển thị quảng cáo, phát hiện giới tính dựa trên hình ảnh, phân loại hình ảnh có quy mô lớn ... Phương pháp này dựa rên sự kết hợp của một vài phương pháp kể trên để dự đoán kết quả, sau đó sẽ đưa ra kết quả cuối cùng dựa vào trọng số của từng phương pháp Vậy phương pháp này hoạt động như thế nào và tại sao nó lại ưu việt hơn các mô hình cá nhân? Gom cụm là nhiệm vụ nhóm một tập hợp các đối tượng sao cho các đối tượng trong cùng một nhóm (cluster) giống nhau hơn so với các đối tượng trong các nhóm khác. Gom cụm có nhiều phương pháp khác nhau, sau đây là một vài trong số đó: PCA là một thuật toán thống kê sử dụng phép biến đổi trực giao để biến đổi một tập hợp dữ liệu từ một không gian nhiều chiều sang một không gian mới ít chiều hơn (2 hoặc 3 chiều) nhằm tối ưu hóa việc thể hiện sự biến thiên của dữ liệu. Phép biến đổi tạo ra những ưu điểm sau đối với dữ liệu: Một số ứng dụng của PCA bao gồm nén, đơn giản hóa dữ liệu để dễ dàng học tập, hình dung. Lưu ý rằng kiến thức miền là rất quan trọng trong khi lựa chọn có nên tiếp tục với PCA hay không. Nó không phù hợp trong trường hợp dữ liệu bị nhiễu (tất cả các thành phàn của PCA đều có độ biến thiên khá cao) Trong đại số tuyến tính, SVD là một thừa số của ma trận phức tạp thực sự. Đối với một ma trận m*n đã xác định M, tồn tại một sự phân rã sao cho M = UΣV, trong đó U và V là các ma trận đơn nhất và Σ là một ma trận chéo. PCA thực ra là một ứng dụng đơn giản của SVD. Trong khoa học máy tính, các thuật toán nhận dạng khuôn mặt đầu tiên được sử dụng PCA và SVD để biểu diễn khuôn mặt như là một sự kết hợp tuyến tính của \"eigenfaces\", làm giảm kích thước, và sau đó kết hợp khuôn mặt với các tính chất thông qua các phương ph","relevance":1},{"title":"Machine Learning thật đơn giản! - HVA Zone","url":"http:\/\/hvazone.com\/machine-learning-that-don-gian.1486.html","content":"Did you joined on our Facebook Group ? Unknown User Unknown User Tính năng DDE của Microsoft office cho phép chạy code mà không cần Macro bật Lỗi docker MariaDB image trên window 10 SQLi check lỗi Bài viết này mình viết trên blog của mình: http:\/\/baolan2005.com\/2017\/02\/24\/machine-learning-that-don-gian\/ Nay mình chia sẻ lên đây cho anh em để mong sự đóng góp từ anh em. --------   Nếu bạn đã từng nghe ở đâu đó cụm từ “máy học” hoặc “học máy” hoặc “machine learning” và bạn không hề hiểu hoặc chưa rõ khái niệm nó nói về cái gì thì bài viết này sẽ cho bạn biết nó là cái gì, nó ra sao một cách dễ hiểu và đơn giản nhất. Bài viết này sẽ dựa trên bài viết “Machine Learning is Fun!” ở Medium. Nào, chúng ta cùng bắt đầu! ****************** 1. Machine Learning là gì? Machine Learning ở Việt Nam thường dịch là máy học hoặc học máy, nhưng cụm từ này đôi lúc dịch sang tiếng Việt nó nghe khá củ chuối nên bài viết này tôi sẽ dùng từ gốc là machine learning (viết tắt là ML) để trình bày. Machine learning là một ý tưởng dùng một tập hoặc một họ các thuật toán nào đó để tìm ra điểm lý thú nào đó từ một bộ dữ liệu mà bạn hoặc ai đó cung cấp. Lấy ví dụ cho dễ hiểu, khi bạn nhận email, làm thế nào để đưa email bạn nhận được từ ai đó vào hộp mail của bạn hay đưa nó vào mục spam? Tất nhiên máy tính tự động làm rồi. Nhưng máy tính làm bằng cách nào? Câu trả lời là nó dùng machine learning để phân loại email từ dữ liệu bên trong email. Hoặc khi bạn đưa một bộ chữ số viết bằng tay thì máy tính làm sao biết được chữ số đó là chữ số nào? Tất nhiên nó cũng dùng machine learning rồi.    Tóm lại, machine learning là một thuật ngữ dùng để chỉ một hoặc một họ thuật toán để giúp máy tính có thể khám phá hoặc học hỏi từ dữ liệu được cung cấp.   2. Hai loại machine learning Machine learning được chia làm hai loại là supervised learning (học có giám sát) và unsupervised learning (học không có giám sát). Nghe có vẻ như quá trình học của máy tính giống như đứa trẻ học có thầy cô, cha mẹ đứng giám sát kế bên nhỉ? Vậy thực ra nó là gì? a. Supervised learning (học có giám sát) Để cho dễ hiểu chúng ta có thể lấy ví dụ sau:  Bảng trên biểu diễn các yếu tố ảnh hưởng đến quyết định chơi đá bóng hay không dựa trên các số liệu về Quang cảnh, Nhiệt độ, Độ ẩm và Gió. Vậy với một yếu tố chưa có trong bảng trên thì quyết định thế nào? Ví dụ mẫu như sau:  Đây được gọi là học có giám sát, nghĩa là dựa vào những dữ liệu đã được cung cấp, các thuật toán ML sẽ tìm ra quyết định có chơi đá bóng hay không. Nó cũng tương tự như khi bạn giải bài toán sau:  Bạn đã có những dữ liệu biết trước và bạn tìm ra được con số cần tìm dựa vào những liên hệ ở những dữ liệu biết trước, máy tính cũng học theo phương pháp học có giám sát cũng làm điều tương tự. b. Unsupervised learning (học không có giám sát) Quay trở lại với ví dụ quyết định chơi đá bóng ở trên, ở trường hợp này bộ dữ liệu bạn có không có dữ liệu quyết định có đá bóng hay không mà chỉ có các yếu tố thời tiết, vậy bạn làm gì với bộ dữ liệu như thế này?  Việc đầu tiên là bạn tìm ra sự tương đồng của các dòng dữ liệu và gom chúng thành các nhóm tương đồng với nhau. Nhưng gom xong rồi thì làm gì? Câu trả lời là tuỳ vào mục đích sử dụng, có thể gom thành các nhóm tương đồng rồi thì khi có một dữ liệu mới thì chúng ta cũng xác định nó thuộc nhóm nào rồi đưa nó vào nhóm đó chứ không thể biết câu trả lời là nhóm dữ liệu đó là có quyết định chơi đá bóng hay không. Trong ML, máy tính cũng làm điều tương tự như vậy và đây gọi là Học không có giám sát. Vậy học có giám sát hay học không có giám sát cái nào quan trọng hơn? Câu trả lời là tuỳ vào ngữ cảnh và mục đích sử dụng của bạn và bộ dữ liệu mà bạn có.   3. Học Machine Learning thế nào? Với những bạn học chuyên ngành Khoa học máy tính (Computer Science) thì chắc chắn có môn này trong chương trình đại học của bạn rồi, nhưng còn những bạn không có học thì sao? Rất đơn giản, bạn có thể vào Coursera để tham gia khoá học về Machine Learning của Andrew Ng (giáo sư Đại học Stanford), khoá học này hoàn toàn miễn phí, tất nhiên là bằng tiếng Anh, địa chỉ cho các bạn vào đăng ký khoá này như sau: https:\/\/www.coursera.org\/learn\/machine-learning PS: Chúng ta đang ở thời đại Cách mạng công nghiệp lần thứ 4, là cuộc cách mạng của công nghệ tri thức, trí tuệ nhân tạo, do đó, học về các kiến thức về Machine Learning không bao giờ là thừa cả. Chúc các bạn học có kết quả tốt.  ","relevance":0},{"title":"Trí tuệ nhân tạo và công nghệ máy học khác nhau thế nào?","url":"http:\/\/cafebiz.vn\/tri-tue-nhan-tao-va-cong-nghe-may-hoc-nghe-thi-tuong-la-mot-nhung-thuc-ra-lai-khac-biet-o-diem-nay-20170301091848799.chn","content":"Tin mới Lần đầu tiên, có một thương hiệu Việt Nam mang điện thoại của mình sang Dubai để bán cho người tây? Cáp AAG lại gặp sự cố, kết nối Internet Việt Nam đi quốc tế có thể chậm Chuyện công sở Việt Nam: Cứ 3 người làm thì có 1 người phá, toàn người trẻ từ 19-31 tuổi, nhiều nhất là trong ngành Giáo dục Thượng sách cho người Việt bây giờ là mua iPhone 7 thay vì mơ tưởng iPhone 8 hay iPhone X Cách thức đánh cắp mật khẩu Apple ID mới hoạt động như thế nào và biện pháp phòng tránh Việt Nam chế tạo được robot giúp đỡ người khiếm thị Tim Cook: Học code tốt hơn học tiếng Anh Vì sao VinFast chẳng nên bán xe hạng sang, cũng chẳng nên làm xe giá rẻ? Người muốn đổi mới tư duy để khởi nghiệp nhất định phải đọc cuốn sách này Làm việc với Elon Musk giúp tôi nhận ra: Thông minh không giúp bạn khởi nghiệp thành công, mà phải là 3 điều này Bắt quả tang nhân viên Cục Dự trữ Liên bang Mỹ đào Bitcoin trên máy chủ Ngân hàng Trung ương Startup Việt muốn liên kết các hãng taxi tại Việt Nam nhằm cạnh tranh Uber, Grab Cảnh báo: 37.000 người dùng đang sử dụng tiện ích chặn quảng cáo Adblock Plus giả mạo Người Việt bán cho người Việt: Mua robot hút bụi giá 500 ngàn trên mạng, về nhà nhận được món đồ chơi trẻ con với cục xi măng bên trong Hacker hì hục đột nhập máy chủ Amazon nhưng không đánh cắp tiền hay dữ liệu, tất cả đều té ngửa khi biết mục đích là để đào Bitcoin Google giúp đứa trẻ cũng hiểu được AI cơ bản là gì Khoa học nói người sinh nhật tháng 10 dễ ốm, hóa ra mối liên hệ giữa tháng sinh và sức khỏe là có thật Galaxy S8 dính lỗi lạ: Tin nhắn lúc nhận được, lúc không Chân dung CEO Hùng Đinh: Cha đẻ của JoomlArt - startup Việt vừa \"nuốt chửng\" người Tây sau 10 năm làm đối thủ Microsoft khai tử Office 2007 vào ngày mai, kết thúc một thập kỷ tận tụy phục vụ dân văn phòng Ai mà ngờ được phim khiêu dâm mới là nội dung được xem nhiều nhất trên kính thực tế ảo, thay vì thiết kế hay chơi game Điều gì xảy ra khi một chú chim đâm vào máy bay? Tận dụng lợi thế lớn nhất của mình như một loại vũ khí hạng nặng, Google đang khiến Apple bị bẽ mặt trước giới công nghệ Mảng sản xuất robot thú cưng của Sony chính thức hoạt động trở lại sau 12 năm đình chỉ Microsoft lý giải vì sao hãng không tiếp tục phát triển Windows Phone nữa Giám đốc thiết kế Apple: “Chúng tôi đã mất 5 năm thất bại để có thể tạo ra iPhone X” Vì những sai lầm trong tập luyện này, bạn đang đánh mất cơ bắp dần mòn mà không hay biết 01\/03\/2017 09:17 AM Trí tuệ nhân tạo – Artificial Intelligence (AI) và Công nghệ máy học – Machine Learning (ML) là hai xu hướng công nghệ được phát triển mạnh mẽ trong thời gian gần đây. Các hãng công nghệ lớn như Google, Facebook, Amazon, Microsoft... đều đầu tư rất lớn vào lĩnh vực này và đã tạo ra nhiều sản phẩm hữu ích phục vụ con người. Bạn có thể bắt gặp hai khái niệm về AI hay ML được đề cập trong các bài báo về thiết bị xe tự lái, hệ thống nhà thông minh, các robot thực hiện những công việc thay thế con người, và đôi lúc hai khái niệm này được xem là tương đương. Tuy nhiên thực tế không hẳn như vậy. Có thể hiểu, AI định nghĩa và thể hiện mong muốn của con người, còn công nghệ máy học – Machine Learning lại là một trong những phương tiện giúp chúng ta đạt được mục tiêu ấy. Theo định nghĩa của đại học Stanford, ML là ngành khoa học máy tính nhằm xây dựng hệ thống có thể thực hiện các hành vi giống con người mà không cần lập trình rõ ràng cho từng hành vi cụ thể này. Ta cần AI để tạo ra các thiết bị thông minh, nhưng để chúng thật sự thông minh và ứng xử như con người, ta cần phải có ML. Google đã dùng hệ thống máy chủ với 16.000 CPU, xử lý hơn 10 triệu video trên Youtube để có thể nhận dạng được hình ảnh con mèo với độ chính xác 74.8% Những ứng dụng của ML trong một thập kỷ qua là rất nhiều, như xe tự lái, nhận diện và hiểu được tiếng nói, cải thiện hiệu quả của ngữ cảnh tìm kiếm, hay ứng dụng trong việc tìm hiểu bộ gen con người. Vậy công nghệ máy học hoạt động như thế nào? Lấy một ví dụ đơn giản, khi bạn tìm kiếm trên Google, trang web sẽ trả lời kết quả tìm kiếm đồng thời có thêm một dòng gợi ý: \"Ý bạn có phải là...?\" Đó là kết quả của một trong những giải thuật máy học của Google. Giả sử bạn tìm trên Google từ khóa \"trí tuệ nhân tạo\", nhưng lại gõ nhầm là \"trí tuệ nhân tai\", sau khi có kết quả thì bạn mới nhận ra mình đã gõ sai và quay lại trang tìm kiếm để nhập từ khóa đúng là \"trí tuệ nhân tạo\". Google sẽ học và ghi nhớ quá trình \"lỗi – thử lại\" này, và khi có người gặp lỗi tương tự, nó sẽ đưa ra từ khóa gợi ý đúng cần tìm, hoặc thậm chí sửa sai và tìm kiếm luôn cho từ khóa đúng ấy. Có thể bạn không để ý, hoặc cho rằng việc trình duyệt tự sửa sai lỗi chính tả là điều hiển nhiên. Thật ra, đằng sau đấy là cả một hệ thống máy học của Google, nó đã tự học được hành vi của người dùng và giúp họ sửa sai. Trường hợp trên chỉ là một ví dụ đơn giản. Trên thực tế, các lập trình viên cần phải sử dụng rất nhiều các giải thuật phức tạp của ML nhằm hướng đến những khả năng mà trước đây được xem là ngoài khả năng của khoa học máy tính. Bằng cách học hỏi qua kinh nghiệm, các chương trình máy tính sẽ có khả năng tìm hiểu được cơ chế hoạt động của bộ gen người, hiểu được những hành vi khách hàng mà bạn sẽ khó có thể tưởng tượng được. Như công nghệ nhận diện hình ảnh như con người (Facebook), tính năng phiên dịch tự động theo thời gian thực (Skype),… Như vậy, bạn đã có thể phần nào hiểu được sự khác biệt cơ bản giữa trí tuệ nhân tạo – AI và công nghệ máy học – ML. Để hiểu rõ hơn, hãy cùng gặp bà Nidhi Chappell, Giám đốc dự án máy học của Intel: \"Trí tuệ nhân tạo, là định nghĩa làm thế nào để máy móc thông minh như con người. Còn công nghệ máy h","relevance":0},{"title":"Meetup VN","url":"https:\/\/meetup.vn\/detail\/Bat-dau-nghien-cuu-Machine-Learning-tu-dau-va-nhu-the-nao-125","content":"Nếu gõ tìm kiếm lộ trình học Machine Learning lên Google, bạn sẽ nhận về hàng chục ngàn kết quả hướng dẫn với những cách thức, phương pháp khác nhau. Liệu bạn có đang hoang mang chưa biết bắt đầu từ đâu?   Machine Learning được sinh ra từ khả năng nhận diện pattern và từ lý thuyết máy tính có thể “học” mà không cần phải lập trình để thực hiện những tasks cụ thể đó. Trước ngưỡng cửa Cách mạng Công nghiệp 4.0 đang đến gần, Machine Learning đang trở thành lĩnh vực nghiên cứu “nóng” của ngành Khoa Học Máy Tính, thu hút sự quan tâm của các tập đoàn lớn lẫn các chuyên gia IT có mong muốn khám phá những công nghệ tiềm năng, để tạo nên đột phá mới về quy trình làm việc, hoạt động kinh doanh...   Đến với buổi chia sẻ BẮT ĐẦU NGHIÊN CỨU MACHINE LEARNING TỪ ĐÂU & NHƯ THẾ NÀO?, trong vòng 180 phút, diễn giả sẽ giúp bạn xây dựng lộ trình nghiên cứu Machine Learning chuẩn mực, từ kiến thức nền tảng như kiến thức dữ liệu, hệ thống, kiến thức thuật toán cơ bản… đến những kinh nghiệm, bài học quý giá.   Đăng kí 1 trong 50 slot giới hạn để có những bước đầu tiên tiếp cận Machine Learning ngay từ bây giờ!   THÔNG TIN CHI TIẾT: http:\/\/meetup.vn\/ HOTLINE\/ LIÊN HỆ HỢP TÁC: - ngoc.do@applancer.net (Ms. Ngọc) | 0944 685 243 - event@applancer.net (Event team) | 08 6273 3497   **Lưu ý: Chúng tôi sẽ hoàn lại tiền nếu không đủ tối thiểu 20 người tham dự.  Hiểu sâu về trí tuệ nhân tạo & Machine Learning tại Apple Từ Over-fitting trong Machine Learning đến những triết lý cuộc đời Chia sẻ cơ bản sử dụng machine learning để giải quyết bài toán. Machine Learning thật thú vị (phần 1) Machine Learning thật thú vị (Phần 2: ví dụ đơn giản Neuron Network) Tìm hiểu về Microsoft Cognitive Services – Sức mạnh của machine learning    © 2017 Meetup.vn - Giải pháp tổ chức khóa học và sự kiện trọn gói","relevance":1},{"title":"Machine Learning – Học máy là gì? – zeal","url":"http:\/\/zeally.net\/machine-learning-hoc-may-la-gi\/","content":"Khi nghe cụm từ này, bạn thường nghĩ tới một người máy thông minh có thể làm các thao tác như con người. Cụ thể hơn, nó có thể “learn,” tức học. Ví dụ, bạn dạy người máy tiếng Anh, và rồi sau đó nó có thể đọc. Bạn dạy nó âm nhạc, và nó có thể viết một bản nhạc mới. Nghe thật không tưởng. Một ngày nào đó, người máy sẽ học đủ nhiều, trở nên đủ thông minh để chiếm lĩnh thế giới. Loài người sẽ tuyệt chủng. Có lẽ viễn cảnh này sẽ trở thành hiện thực. Nhưng cũng có lẽ bạn đã tưởng tượng quá nhiều sau khi xem “The Terminator”1. Nhưng bất kể viễn cảnh nào sẽ xảy ra chăng nữa, bạn cũng sẽ nghĩ tới machine learning (tạm dịch: học máy)2 như là một công nghệ siêu phức tạp với hàng triệu dòng mã được viết bởi ngôn ngữ ngoài hành tinh. Nhưng đừng cảm thấy ngại. Những thứ phức tạp thường được xây dựng dựa trên những điều giản đơn. Machine learning cũng vậy. Bạn sẽ ngạc nhiên khi biết rằng công nghệ machine learning cao siêu này thực ra cũng chỉ đến từ những kiến thức toán căn bản bạn học hồi phổ thông mà thôi. Trước khi ta đi vào chi tiết, ta cần định nghĩa lại từ ngữ. Ta đều biết “learning” là gì. Nhưng để thực sự hiểu từ “learning” trong “machine learning,” ta cần “hạ chuẩn” từ này xuống một tí. Thường thì từ “learning” gắn liền với việc thu thập thêm kiến thức mới. Khi ta học một khái niệm hay cơ chế mới, ta cố gắng hiểu chúng bằng suy luận logic hoặc tưởng tượng trực quan. Những khái niệm và cơ chế này trở thành kiến thức của chúng ta. Đó là một nghĩa “cấp cao” của từ “learning.” Có một nghĩa khác, cấp “thấp” hơn. Hãy nghĩ tới “learning” như việc phán đoán dựa trên kinh nghiệm quá khứ. Ví dụ, khi ta đi bộ trên đường, ta vấp phải một hòn đá và ngã xuống. Lần sau khi ta ra khỏi nhà, ta phán đoán rằng, nếu ta đi trên cùng con đường đó, ta sẽ gặp lại hòn đá, và nếu không tránh nó ra, ta sẽ lại vấp ngã. Đó là “learning.” Học nghĩa là phán đoán dựa trên quá khứ. Kinh nghiệm trong quá khứ (đi bộ trên đường, vấp phải hòn đá và ngã) nói với bạn rằng nếu bạn lặp lại những bước tương tự (đi trên cùng con đường đó, và vấp phải hòn đá) thì bạn chắc chắn sẽ gặp đúng một kết quả (ngã). Để cho đơn giản, ta nên nghĩ tới từ “learning” theo nghĩa hẹp này. Việc bạn làm gì với dự đoán này (ví dụ như chọn đường khác để đi, hay né hòn đá ra) là một câu chuyện khác. Đó là “learning.” Phán đoán dựa trên kinh nghiệm quá khứ. Nghe thật đơn giản. Nhưng con người thì phức tạp, và cách ta phán đoán thường không rõ ràng chút nào. Làm sao mà máy có thể “learn,” có thể phán đoán như người được? Giờ là lúc để “hạ chuẩn” thêm một lần nữa. Lần này, ta sẽ hạ chuẩn từ “kinh nghiệm.” Kinh nghiệm của con người bao gồm nhiều thứ. Những thứ này có thể là mùi, hình ảnh, cảm xúc… và những đặc tính khác. Kinh nghiệm đóng vai trò như “input,” một dạng thông tin đầu vào, đối với chúng ta. Con người xử lý “input” (kinh nghiệm quá khứ) để cho ra “output” (phán đoán). Nếu chúng ta thay “người” bằng “máy,” thì câu hỏi được đặt ra bây giờ là, “máy tính thì trải nghiệm gì?” Hiển nhiên, nó không thể trải nghiệm những đặc tính định tính như trực giác hay cảm xúc được. Thay đổi từ ngữ một chút, ta có một câu hỏi tương đương là, “Input của máy tính là gì?” Giờ thì ta có thể trả lời: “input” của máy tính là những con số. Máy tính xử lí dữ liệu được mã hoá dưới dạng rất nhiều con số. Machine learning nghĩa là máy tính xử lí những con số đã có để đưa ra phán đoán. Tới đây bạn sẽ hỏi tiếp, “vậy phán đoán dạng gì?” “input” như thế nào thì sẽ cho ra “output” như thế. Trong machine learning, một chiếc máy tính xử lí những con số để cho ra những con số khác. Giải thích ở trên vẫn còn trừu tượng lắm. Lấy một ví dụ cụ thể. Giả sử bạn đi vòng quanh trong khu phố và thu thập thông tin về nhà cửa. Bạn thu thập 2 số liệu cho mỗi căn nhà: giá và diện tích. Giả sử bạn hỏi 500 hộ dân trong khu. Vậy là bảng dữ liệu của bạn có hai cột, diện tích và giá, cùng với 500 dòng, tương ứng với 500 căn nhà. Trong thuật ngữ “machine learning,” diện tích căn nhà được gọi là một “feature” (tạm dịch: đặc điểm), và 500 là số lượng “training examples” (tạm dịch: dữ liệu mẫu). Nhiệm vụ của chuyên gia machine learning là bảo máy tính xử lí bảng dữ liệu 500 dòng và 2 cột này. Giả sử có căn nhà thứ 501 trong khu đang được xây, và bạn muốn biết giá trị của nó. Bạn lấy diện tích căn nhà 501 này, cho vào máy tính, và máy tính sẽ xuất ra cho bạn một con số chính là giá của căn nhà đó. Đó là machine learning. Máy tính xử lí những con số để cho ra những con số khác. Nếu bạn hỏi một chuyên gia nhà đất làm thế nào để định giá một căn nhà, thì cô ấy có thể cho bạn một danh sách dài “features” chứ không chỉ có diện tích. Cô ấy sẽ muốn biết địa điểm (căn nhà có ở trong khu nhà ở cao cấp hay không?), vật liệu xây dựng, số lượng phòng… Để cụ thể hơn, ta có thể “toán hoá” phán đoán của máy tính bằng phương trình: hθ(x) = x0 + θ1x1 + θ2x2 + θ3x3 + θ4x4 Tạm thời, bạn có thể bỏ qua x0. (x0 là phán đoán của máy khi các “features” khác bằng không. Thật vậy, khi x1=x2=x3=x4=0 thì hθ(x) = x0) Trong ví dụ của chúng ta, diện tích một căn nhà bằng 0 là điều vô lí, nên ta không cần quan tâm lắm đến x0 ở đây. Ta sắp xếp dữ liệu vào hàng và cột. Mỗi hàng chứa thông tin của một căn nhà. Mỗi hàng có 5 ô (tương ứng 5 cột), mỗi cột chứa giá trị của một “feature” (diện tích, vị trí, vật liệu, và số phòng). Hai cột vị trí và vật liệu chỉ chấp nhận 2 giá trị định lượng đại diện: 1 với địa điểm đẹp\/vật liệu tốt và 0 đối với địa điểm xấu\/vật liệu xoàng.  Bảng trên phản ánh thực tế: căn nhà này, với diện tích, vị trí, vật liệu và số phòng như thế này, đã được bán với giá này. Bảng trên là “kinh nghiệm qu","relevance":1},{"title":"tuan's blog: Machine Learning là gì?","url":"http:\/\/tuanvannguyen.blogspot.com\/2016\/11\/machine-learning-la-gi.html","content":"Post a Comment","relevance":1},{"title":"Bắt đầu với Machine Learning thông qua Tensorflow (Phần I.I)","url":"https:\/\/kipalog.com\/posts\/Bat-dau-voi-Machine-Learning-thong-qua-Tensorflow--Phan-I-I","content":"Bạn có chắc chắn muốn xóa bài viết này không ? Bạn có chắc chắn muốn xóa bình luận này không ? Bạn luôn có thể lựa chọn email hoặc các tài khoản mạng xã hội để đăng nhập hoặc đăng ký. Trần Đức Tâm viết ngày 02\/07\/2017 Mình nghiên cứu Machine Learning[Coursera] bắt đầu từ khoảng một năm về trước, mất khoảng sáu tháng để tự luyện lại bản thân kiến thức toán từ lớp 9 để làm quen lại với các dạng toán từ giải phương trình đến đạo hàm, tích phân... Cảm giác đó là một quãng thời gian tuy không hẳn là phí phạm lắm nhưng kết quả đạt được để hiểu về Machine Learning lại không nhiều. Nhất là với một lập trình viên Mobile như mình. Vậy nên mình tổng hợp lại một vài kiến thức cơ bản của Machine Learning dưới góc nhìn của một người ứng dụng lại các thành tựu có sẵn nhằm giải quyết các bài toán Machine Learning dành cho bạn nào cũng mới bắt đầu giống mình mà đã quên đi khá nhiều kiến thức toán phổ thông. Để theo dõi bài viết được hiệu quả, cách tốt nhất là kết hợp đọc cùng với bai tài liệu sau: Ngoài ra thì blogs của Huy Trần và bạn Khánh Nguyễn cũng là những blogs rất đáng được tham khảo. Theo như khóa học Machine Learning trên Coursera thì khái niệm Machine Learning có hai định nghĩa cổ đại và hiện đại. Định nghĩa cổ đại: Machine Learning is the field of study that gives computers the ability to learn without being explicitly programmed.(Machine Learning là một ngành học nghiên cứu về cách giúp cho máy tính điện tử có được khả năng có thể học tập mà không cần phải được lập trình một cách tỉ mỉ trước đó.) Theo như định nghĩa này thì mình cảm thấy là nó giống như việc dịch sát nghĩa từ Machine Learning vậy. Hoàn toán bị bối rồi về việc Machine Learning là gì? Làm sao để thực hành Machine Learning. Vậy nên một định nghĩa khác mở hơn được đưa ra giúp cho mọi người có cái nhìn dễ dàng hơn về Machine Learning. Định nghĩa hiện đại: A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P, if its performance at tasks in T, as measured by P, improves with experience E.(Một chương trình máy tính được gọi là học cách thực thi 1 nhóm nhiệm vụ tương đồng T thông qua trải nghiệm E dựa trên tiêu chí đánh giá P khi kết quả thực thi các nhiệm vụ trong nhóm T của chương trình đó, tăng lên theo trải nghiệm E thông qua đánh giá bằng tiêu chí P.) Dưới góc nhìn của Machine Learning, mọi bài toán đều có input và output, ở giữa của quy trình đó là một hàm. Hàm là một khái niệm toán học khá quen thuộc với chúng ta. Hàm là một tập hợp các quy tắc được dùng để các phần tử ở tập nguồn đến các phần tử ở tập đích sao cho mỗi một phần tử ở tập nguồn chỉ có một và chỉ một phần tử ở tập đích. Trong đó, một bộ phận nhỏ của hàm, khi tất cả các phần tử của cả hai tập đều là dạng số học, người ta gọi đó là hàm sô. Hình 1.1: Hàm số Cùng với sự phát triển của Computer Vision[Wiki], nhiệm vụ của người làm Machine Learning ở một mức cơ bản nào đó là giúp máy tính điện tử tìm ra được hàm quan hệ giữa tập input và tập output để từ đó máy tính có khả năng cải tiến hiệu xuất P của nhiệm vụ T thông qua trải ngiệm E. Hàm này được gọi là Hypothesis[Wiki] hoặc Model[Wiki] Cũng theo khóa học Machine Learning trên Coursera thì Machine Learning chia các bài toán ra làm hai loại chính là Supervised Learning(Học có giám sát)[SL] và Un-Supervised Learning(Học không có giám sát)[USL]. Học có giám sát là việc có sẵn một tập nguồn và một tập đích tương ứng để làm cơ sở xây dựng ra model mong muốn. Tập hợp kết hợp bởi hai tập này được gọi là tập Train[Wiki]. (Test sets và validate sets không được đề cập đến trong khuôn khổ bài viết này). Theo thời gian, khi đưa bài toán vào áp dụng thực tế, dữ liệu mới lại được sử dụng để train(Huấn luyện) lại nhằm cải tiến model hiện tại. Điều này chính là mô tả cho khái niệm học có giám sát. Các thuật toán nằm trong nhóm các bài toán học có giám sát được chia nhỏ thành hai phần dựa trên đặc tính của tập đích trong tập train. Khi dữ liệu của tập đích là một nhóm hữu hạn và có thể labled(Gắn nhãn) được, bài toán được xếp vào dạng classification(Bài toán phân loại). Ví dụ hay được sử dụng cho bài toán dạng này là bài toán gắn nhãn xem một email có phải là spam hay không, hoặc phân loại giữa cam và táo hay phân biệt chữ viết tay...  Dạng còn lại được gọi là regression(Bài toán hồi quy). Hồi quy là một thuật ngữ rất khó hiểu. Khi tìm hiểu cả bằng tiếng Trung và tiếng Nhật thì từ này trùng hợp là đều được dịch là hồi quy(回帰) cả. Thì ra là những cái gì có tính liên tục và tiếp nối với nhau thì người ta gọi là là hồi quy. Vậy khi tập đích trong tập train là một tập dữ liệu có dạng liên tục không thể phân thành nhóm mà là một dữ liệu cụ thể thì bài toán được xếp vào dạng hồi quy. Bài toán tiêu biểu cho dạng này thường được ví dụ là tính toán giá cả của sản phẩm dựa trên thông số trước đó, hoặc dự đoán biến động tài chính... Hình 1.3: Hàm số regression Được gọi là học không giám sát, chúng ta không hề có tập đích mà chỉ có tập nguồn, khi dữ liệu đủ lớn, chúng ta mặc dù không thể dự đoán được tấp đích nhưng bù lại thì có thể thực hiện phân nhóm hay làm giảm độ phức tạp của dữ liệu. Điều này đặc biệt có ích trong việc lưu trữ hoặc sử lí dữ liệu trong tương lai (Đưa về bài toán học có giám sát khi đã có dữ liệu thực tế) Các bài toán học không giám sát cũng được chia làm hai loại dựa vài tập nguồn của chúng. Với bài toán dạng này, ta buộc phải có một tập hợp các categories cho trước. Dữ liệu nguồn sẽ được Clustering(Bài toán gom nhóm) dựa trên các yếu tố có trong tập hợp categories cho trước. Điều này có vẻ tương tự với bài toán ở dạng Classification bị bỏ đi tập đichs nhưng trên thự","relevance":0},{"title":"[Machine Learning] Giới thiệu PredictionIO - Fullstack Station","url":"https:\/\/www.businesscard.vn\/blog\/gioi-thieu-predictionio\/","content":"Select Page Posted by Nguyễn Nhân | Th12 29, 2015 | Công nghệ, Lập trình | 0 | Nội dung chính Đây là một ngành trong khoa học máy tính, còn hay được gọi là “học máy“. Được dùng để nghiên cứu một số hành vi có chung hoặc khác đặc điểm, sau đó phân loại hoặc dự đoán, …Một số ví dụ như: dự báo thời tiết, dự báo tình trạng giao thông, hoặc dự báo chỉ số giá cả một số mặt hàng, chẩn đoán y khoa, hoặc một số ứng dụng trong truy tìm dữ liệu như phục hồi ảnh… (PredictionIO hoàn toàn có thể áp dụng được các lĩnh vực này) Như các ví dụ ở trên, bạn có thể thấy rằng học máy là một lĩnh vực không còn mới mẻ, và đặc biệt là khi có nhiều mã nguồn mở cung cấp khả năng thông minh đó cho hệ thống của bạn. Một trong các hệ thống đó là PredictionIO. PredictionIO về cơ bản cũng giống như các sản phẩm khác khi có thể làm cho hệ thống của bạn thông minh hơn như: sản phẩm tương tự, sản phẩm mà hệ thống nghĩ bạn sẽ thích, phân loại khách hàng tiềm năng,… Nhưng đặc biệt của PredictionIO là: Học máy là một công nghệ tiên tiến rất cần thiết trong tất cả các sản phẩm công nghệ ngày nay. Từ đơn giản là bạn muốn khuyến nghị những sản phẩm, nội dung tương tự có trong dịch vụ của bạn đến việc phân loại và dự đoán từ các nguồn dữ liệu cực kỳ phong phú trên internet. Hi vọng đọc xong bài viết, bạn sẽ có khái niệm tốt về máy học và sẽ áp dụng PredictionIO trong sản phẩm các sớm càng tốt để giúp dịch vụ của bạn tăng trưởng. Share: Rate: Xin chào, mình là kỹ sư công nghệ thông tin đang làm việc tại Tokyo, Nhật Bản. Đam mê lập trình web và mobile, mình đang cố gắng học Javascript để hoàn thiện bản thân để trở thành lập trình viên fullstack thực thụ. Mình yêu thích tối ưu tốc độ ứng dụng cũng như cải thiện quy trình làm việc để phát triển sản phẩm chất lượng và nhanh chóng. Sự động viên của bạn bằng các hình thức \"like\", \"share\", \"comment\" sẽ giúp cho mình có động lực để viết nhiều bài tốt hơn! 08\/06\/2016 01\/03\/2016 05\/15\/2017 03\/30\/2015 Thư điện tử của bạn sẽ không được hiển thị công khai. Các trường bắt buộc được đánh dấu * COMMENT Tên * Thư điện tử * Trang web    Công nghệ đang thay đổi nhanh chóng, hãy cũng vươn ra thế giới với những bài viết chất lượng từ Fullstack Station bạn nhé. Cám ơn bạn! Có lỗi xảy ra, xin vui lòng thử lại Bạn sẽ nhận được email thông báo khi có bài viết mới, mình không spam vì mình cũng rất ghét :) Designed by Elegant Themes | Powered by WordPress","relevance":1},{"title":"Bài toán phân lớp trong Machine Learning (Classification in Machine Learning)","url":"http:\/\/eitguide.net\/bai-toan-phan-lop-trong-machine-learning-classification-machine-learning\/","content":"Bài toán phân lớp (classification) và bài toán gom cụm (cluster) là hai bài toán lớn trong lĩnh vực Machine Learnig (ML). Bài toán phân lớp là quá trình phân lớp một đối tượng dữ liệu vào một hay nhiều lớp đã cho trước nhờ một mô hình phân lớp (model). Mô hình này được xây dựng dựa trên một tập dữ liệu được xây dựng trước đó có gán nhãn (hay còn gọi là tập huấn luyện). Quá trình phân lớp là quá trình gán nhãn cho đối tượng dữ liệu.  Liệu bi mới được thêm vào sẽ thuộc vào lớp bi xanh hay bi đỏ? Như vậy, nhiệm vụ của bài toán phân lớp là cần tìm một mô hình phần lớp để khi có dữ liệu mới thì có thể xác định được dữ liệu đó thuộc vào phân lớp nào. Có nhiều bài toán phân lớp dữ liệu như phân lớp nhị phân (binary), phân lớp đa lớp (multiclass), phân lớp đa trị. Bài toán phân lớp nhị phân là bài toán gắn nhãn dữ liệu cho đối tượng vào một trong hai lớp khác nhau dựa vào việc dữ liệu đó có hay không có các đặc trưng (feature) của bộ phân lớp Bài toán phân lớp đa lớp là quá trình phân lớp dữ liệu với số lượng lớp lớn hơn hai. Như vậy với từng dữ liệu chúng ta phải xem xét và phân lớp chúng vào những lớp khác nhau chứ không phải là hai lớp như bài toán phân lớp nhị phân. Và thực chất bài toán phân lớp nhị phân là một bài toán đặt biệt của phân lớp đa lớp. Ứng dụng của bài toán này được sử dụng rất nhiều và rộng rãi  trong thực tế ví dụ như bài toán nhận dạng khuôn mặt, nhận diện giọng nói,  phát hiện email spam…  Ví dụ bài toán phân lớp detect email spam Và đối với các bài toán phân lớp dữ liệu chúng ta sử dụng các thuật toán học có giám sát (supervised learning) để xây dựng mô hình cho bài toán này. Sau đây chúng ta sẽ tìm hiểu khái quát về quá trình phân lớp dữ liệu và sơ bộ về các phương pháp phân lớp sử dụng trong bài toán này. Để xây dựng được mô hình phân lớp và  đánh giá được mô hình chúng ta phải trải quá các quá trình như dưới đây: Bước 1: Chuẩn bị tập dữ liệu huấn luyện (dataset) và rút trích đặc trưng (feature extraction) Công đoạn này được xem là công đoạn quan trọng trong các bài toán về Machine Learning. Vì đây là input cho việc học dể tìm ra mô hình của bài toán. Chúng ta phải biết cần chọn ra những đặt trưng tốt (good feature) của dữ liệu, lược bỏ những đặc trưng không tốt của dữ liệu, gây nhiễu (noise). Uớc lượng số chiều của dữ liệu bao nhiêu là tốt hay nói cách khác là chọn bao nhiêu feature. Nếu số chiều quá lớn gây khó khăn cho việc tính toán thì phải giảm số chiều của dữ liệu nhưng vẫn giữ được độ chính xác của dữ liệu (reduce demension). Ở bước này chúng ta cũng chuẩn bị bộ dữ liệu để test trên mô hình. Thông thường sẽ sử dụng cross-validation (kiểm tra chéo) để chia tập datasets thành hai phần, một phần phục vụ cho training (training datasets) và phần còn lại phục vụ cho mục đích testing trên mô hình (testing dataset). Có hai cách thường sử dụng trong cross-validation là splitting và k-fold. Bước 2: Xây dựng mô hình phân lớp (classifier model) Mục đích của mô hình huấn luyện là tìm ra hàm f(x) và thông qua hàm f tìm được để chúng ta gán nhãn cho dữ liệu. Bước này thường được gọi là học hay training. f(x) = y                         Trong đó: x là các feature hay input đầu vào của dữ liệu y là nhãn lớp hay output đầu ra.  Thông thường để xây dựng mô hình phân lớp cho bài toán này chúng ta sử dụng các thuật toán học giám sát (supervised learning) như KNN, Neural Network, SVM, Decision Tree, Navie Bayers. Bước 3: Kiểm tra dữ liệu với mô hình (make prediction) Sau khi đã tìm được mô hình phân lớp ở bước 2, thì ở bước này chúng ta sẽ đưa vào các dữ liệu mới để kiểm tra trên mô hình phân lớp. Bước 4: Đánh giá mô hình phân lớp và chọn ra mô hình tốt nhất Bước cuối cùng chúng ta sẽ đánh giá mô hình bằng cách đánh giá mức độ lỗi của dữ liệu testing và dữ liệu traning thông qua mô hình tìm được. Nếu không đạt được kết quả mong muốn của chúng ta thì phải thay đổi các tham số (turning parameter) của các thuật toán học để tìm ra các mô hình tốt hơn và kiểm tra, đánh giá lại mô hình phân lớp. Và cuối cùng chọn ra mô hình phân lớp tốt nhất cho bài toán của chúng ta. Your email address will not be published. Required fields are marked *   ","relevance":0},{"title":"Machine learning là gì?","url":"http:\/\/trainghiemso.vn\/machine-learning-la-gi\/","content":"Tác giả: An Nhiên Machine learning là một nhánh trong trí tuệ nhân tạo, đang được áp dụng hàng ngày trên các website bạn truy cập, trên các ứng dụng quen thuộc chứ không phải chỉ có ở những sản phẩm xa xỉ như trợ lý ảo Siri, Cortana. Trí tuệ nhân tạo đang là nền tảng cốt lõi trong nền công nghệ hiện đại. Chúng ta từng nghe đến những thất bại của con người khi đấu trí với máy móc dùng trí tuệ nhân tạo, thông qua các cuộc đánh cờ vua trước đó hay cờ vây mới đây, cho thấy sự tiến bộ vượt bậc của máy móc mô phỏng trí tuệ con người. Là một nhánh của trí tuệ nhân tạo, Machine learning (được dịch là “máy học”, hay “học máy”) là các thuật toán mà máy móc sẽ được lập trình để tự “học”, nhằm đưa ra các kết quả phù hợp. Ví dụ phân tính một bức tranh, máy móc có thể biết đó là cảnh biển chứ không phải núi, hay giúp người dùng sửa lỗi chính tả, dịch thuật ngôn ngữ… Machine learning đã được ứng dụng trong rất nhiều dự án lớn ở nhiều công ty, và có đóng góp rất lớn trong quá trình vận hành những công ty này. Machine learning không phải chỉ có ở những sản phẩm mang tính định hướng tương lai như Siri hay các trợ lý ảo khác, cũng không chỉ có ở Google hay Microsoft – là những công ty chi đống tiền cho hoạt động R&D. Trong thực tế, hầu như mọi công ty trong danh sách Fortune 500 – 500 công ty hàng đầu thế giới – đều đang ứng dụng công nghệ này một cách thành thạo, và chắc chắn kiếm được bộn tiền từ nó. Dưới đây là những ứng dụng thực tế của Machine learning đang được sử dụng trong các hoạt động thường ngày.   Tối ưu nội dung đăng tải của người dùng Những thông tin đăng tải của người dùng trên các ứng dụng hay trên mạng Internet thực sự dính rất nhiều lỗi. Đó là các đoạn viết sai chính tả, các nội dung thô tục hay các nội dung xuyên tạc. Bằng cách lọc các nội dung này, Machine learning có thể loại bỏ hoặc che giấu các nội dung xấu và làm nổi bật thông tin lành mạnh lên mà không cần con người can thiệp. Trước đây và hiện nay Google vẫn làm rất tốt trong việc lựa chọn thông tin từ nguồn tin cậy để hiển thị đầu tiên trong kết quả tìm kiếm của người dùng, nhưng không chỉ Google mới làm được việc đó. Bạn có nhớ email rác đã làm phiền mình tới mức nào trước đây hay không? Tuy nhiên hiện nay với các bộ lọc xây dựng từ Machine learning, các email đó đã bị ẩn hoặc loại bỏ khỏi hộp thư điện tử người dùng, rất ít email rác lọt vào hòm thư ưu tiên, hầu hết bị đưa vào mục tin rác (spam). Sau này, bộ lọc nội dung tương tự sẽ được áp dụng rộng rãi trong nhiều ứng dụng hay website khác, và các thông tin rác sẽ bị loại bỏ. Hiện nay, mạng xã hội Pinterest đã dùng Machine learning để đưa lên đầu những nội dung thú vị nhằm thu hút người dùng. Yelp dùng công nghệ này để sắp xếp các hình ảnh được người dùng tải lên. NextDoor dùng nó để lựa chọn nội dung hiển thị trên bảng tin nhắn. Trong khi đó Disqus dùng Machine learning để xóa những bình luận spam.   Tìm sản phẩm nhanh hơn Không có gì ngạc nhiên khi gã khổng lồ tìm kiếm Google luôn trả lương cao để tuyển những nhà nghiên cứu về Machine learning. Trong thực tế, người đứng đầu bộ phận tìm kiếm hiện nay của Google là một chuyên gia về trí tuệ nhân tạo. Không dừng lại ở việc lục lọi thông tin trên mạng để đưa ra nội dung người dùng tìm kiếm như trước, hiện nay Google đã “thông minh” hơn, lựa chọn những thông tin phù hợp giữa vô vàn dữ liệu trên mạng để đưa ra kết quả cho người dùng, khiến họ thấy bộ máy tìm kiếm là hữu ích, chứ không trưng ra tất cả nội dung tìm kiếm không liên quan. Tất nhiên Google là một ví dụ tiêu biểu cho việc dùng Machine learning để đưa kết quả tìm kiếm phù hợp. Nhưng những hãng khác cũng đang áp dụng công nghệ này với mục đích tương tự. Như nhà bán lẻ Home Depot phải dùng thuật toán để tìm ra một bồn tắm phù hợp trong vô vàn bồn tắm của mình để vừa với một nhà tắm có thiết kế khác lạ. Apple cũng phải đưa ra các kết quả tìm kiếm phù hợp khi người dùng tìm kiếm trên App Store. Hàng loạt các công ty khởi nghiệp khác tại Mỹ cũng đang ứng dụng Machine learning vào việc đưa ra các nội dung thu hút trong khi người dùng tìm kiếm, nhằm giữ chân người dùng với ứng dụng.   Tương tác với khách hàng Một ví dụ khác về Machine learning chính là ô “Liên hệ” (Contact us) có hầu hết trên các website. Trước đây phần này khá đơn giản nhưng hiện nay đã được cải tiến rất nhiều. Chúng được ứng dụng Machine learning nhằm tương tác tốt nhất với khách hàng, là những người truy cập website. Nếu trước đây bạn phải điền vào đó rất nhiều thông tin, rồi chọn nhiều mục để gửi đi yêu cầu của mình đến nhà cung cấp, thì hiện nay công nghệ mới chỉ dựa trên một vài thông tin bạn cung cấp, hệ thống sẽ tự động điều hướng đến những danh mục cần thiết để tiết kiệm thời gian cho bạn. Đối với các công ty càng lớn thì sự đầu tư cho mục này càng nhiều. Vì người điền thông tin mục này thường là khách muốn liên hệ mua hàng, hay là những người muốn than phiền về bất kỳ vấn đề gì của công ty. Một khi lọc được các từ khóa hay nhận thấy những dấu hiệu cần thiết, yêu cầu của khách hàng sẽ được ưu tiên đẩy nhanh đến phòng kinh doanh hay phòng chăm sóc khách hàng để xử lý yêu cầu nhanh nhất. Những ưu tiên dạng này ngoài con người trực tiếp xem nội dung và phân loại thì chỉ có Machine learning nhận ra, giúp tiết kiệm nhân lực và tạo sự chuyên nghiệp cho công ty.   Hiểu hành vi khách hàng Machine learning cũng là những nhà phân tích đại tài. Nhờ những phân tích này mà người ta biết được thói quen người dùng để đưa ra các quyết định hợp lý. Ví dụ, một hãng phim khi tung ra trailer, họ có thể theo dõi những đoạn bình luận của người xem để tìm ra đâu là khách hàng mục tiêu của mình, nhờ các phân tích của Machine learning","relevance":0},{"title":"Oracle ra mắt Ứng dụng Học Máy (Machine Learning)","url":"http:\/\/ictvietnam.vn\/tin-nong-chuyen-muc\/oracle-ra-mat-ung-dung-hoc-may-machine-learning.htm","content":"Ông Ellison đã giới thiệu giải pháp Đám mây Cơ sở Dữ liệu Tự động của Oracle (Oracle Autonomous Database Cloud) - cơ sở dữ liệu tự động vận hành 100% đầu tiên trên thế giới, cùng chuỗi ứng dụng bảo mật tự động với tính năng phát hiện và khắc phục các cuộc tấn công mạng một tức thời. Với quá trình tự động hóa toàn bộ dựa trên công nghệ học máy (machine learning), Đám mây Cơ sở Dữ liệu Tự động của Oracle giúp cắt bỏ lực lượng nhân sự chuyên quản lý cơ sở dữ liệu, nhờ khả năng cho phép cơ sở dữ liệu tự động nâng cấp, sửa lỗi và điều chỉnh ngay khi đang vận hành. Không còn những sai sót gây ra bởi yếu tố con người, cũng như không đòi hỏi quy trình thử nghiệm hiệu suất giữa người và máy - Oracle đã có thể giảm thiểu tối đa thời gian “chết” (downtime) vô cùng tốn kém của hệ thống xuống dưới 30 phút mỗi năm, từ đó, các doanh nghiệp có thể cắt giảm chi phí chỉ còn một nửa so với khi sử dụng các giải pháp tương tự của Amazon. Ông Ellison cũng đã trực tiếp mô phỏng và chứng minh hiệu suất của việc tích hợp Cơ sở Dữ liệu của Oracle trên nền tảng Điện toán Đám mây của Oracle, so với việc tích hợp công nghệ này trên nền tảng hỗ trợ Dịch vụ Đám mây Cơ sở Dữ liệu Oracle tốt nhất của Amazon - Amazon Relational Database Service (RDS). Qua đó có thể nhận thấy, nếu độ tin cậy và sẵn sàng của dịch vụ (SLA) trên Amazon đạt 99,95%, thì con số này có thể đạt mức 99,995% đối với nền tảng của Oracle. Tuấn Trần  Kỳ 1 tháng 6 năm 2017 Kỳ 2 tháng 3 năm 2017 Các công trình nghiên cứu, phát triển và ứng dụng CNTT-TT- Số 34-2015 Tri thức thời đại số 48 Ngành TT&TT: tiên phong với sứ mệnh phát triển kinh tế tri thức Sáng ngày 12\/8, tại Hà Nội, Cục Viễn thông (trực thuộc Bộ TT&TT) đã tổ chức Lễ đón nhận Huân chương Lao động hạng Nhất và kỷ niệm 5 năm ngày thành lập. 19\/08\/2016 Thời điểm chính thức tắt sóng truyền hình tương tự tại 4 thành phố này là 24 giờ ngày 15\/8\/2016. 19\/08\/2016 Bộ trưởng Trương Minh Tuấn tiếp Đại sứ các nước ASEAN và Khai mạc Triển lãm về Cộng đồng ASEAN 09\/08\/2016 Ngành Thông tin và Truyền thông đi đầu trong hội nhập quốc tế Việt Nam - Nhật Bản tăng cường hợp tác về Thông tin và Truyền thông Lễ chào cờ tại đảo Lý Sơn - cộng đồng CNTT-TT Việt Nam hướng đến biển đảo Giấp phép số 69\/GP-TTĐT cấp ngày 26\/12\/2014 Tổng biên tập: Vũ Chí Kiên. Tòa soạn: Tầng 5, tòa nhà 115, Trần Duy Hưng, Hà Nội Điện thoại: 04. 37737136 Fax: 04. 37737130 Email: tapchibcvt@mic.gov.vn Ghi rõ nguồn “Tạp chí Thông tin và Truyền thông” khi phát hành lại thông tin từ website này Tin nổi bật Hội nhập Tương tác Dịch vụ Truyền thông Tiêu điểm Xã hội số Công nghệ Nghiên cứu Lãnh đạo CNTT Lịch sử truyền thống Tôn chỉ mục đích Cơ cấu tổ chức Quảng cáo và Phát hành Tạp chí Online Facebook Youtube Twitter LinkedIn RSS Cộng tác viên Góp ý Đặt mua tạp chí Hỏi đáp Online","relevance":0},{"title":"Machine Learning là gì? ~ Cáp Hữu Quân's Blog","url":"https:\/\/caphuuquan.blogspot.com\/2016\/05\/machine-learning-la-gi.html","content":"(y)   ","relevance":1},{"title":"Machine learning tăng cường bảo mật mạng - PC World VN","url":"http:\/\/www.pcworld.com.vn\/articles\/cong-nghe\/an-ninh-mang\/2016\/12\/1250109\/machine-learning-tang-cuong-bao-mat-mang\/","content":"Thực tế từ nhiều vụ rò rỉ dữ liệu, mất cắp dữ liệu trong vài năm vừa qua đã khiến doanh nghiệp phải đặt trọng tâm vào vấn đề an ninh mạng. Một loại giải pháp bảo mật mới đang dần hình thành, trong đó có “học máy” (machine learning). Những công cụ mới này có khả năng phân tích, học hiểu và nhận diện những điều bất thường xảy ra trên hệ thống, từ đó bảo vệ doanh nghiệp chống lại những hiểm hoạ từ mạng. Vậy machine learning có phải là câu trả lời cho những thách thức mạng hiện nay hay không? Các nhà phân tích và công ty bảo mật cho rằng đang có sự gia tăng nhu cầu về bảo mật và có những phản ứng tích cực từ người dùng khi áp dụng machine learning. Theo phân tích, machine learning là xu hướng bảo mật chính trong năm 2016. Các chuyên gia bảo mật hiện nay đều biết rằng việc phân tích hành vi là cơ hội tốt nhất để nắm bắt được các cuộc tấn công mạng và là cách phòng vệ tốt nhất, trong đó machine learning là trái tim. Machine learning có khả năng theo dõi hành vi của một người dùng, thiết bị hay trang web. Điều này rất quan trọng, vì nó mang lại một nền tảng về phân tích hành vi để ngăn ngừa những tác động nguy hiểm từ những cuộc tấn công vượt mặt được những lớp phòng vệ cơ bản. Ích lợi lâu dài của machine learning là hướng đến nền tảng bảo mật dựa trên khả năng dự đoán, dự báo và kết hợp với những phương pháp bảo mật phổ biến hiện nay. Những thách thức Như bất kỳ công nghệ mới khác, machine learning chắc chắn sẽ vấp phải những trở ngại khi triển khai. Trước hết, chất lượng của thuật toán về machine learning rất khác nhau giữa các nhà cung cấp, chất lượng tốt mới cho được kết quả tốt. Do vậy, cần có những dự án thử nghiệm, tập trung vào từng trường hợp cụ thể của người dùng, thiết bị và trang web để chứng minh thêm tính hiệu quả của sản phẩm. Mặc dù machine learning có thể là bước tiến bộ lớn về bảo mật nhưng nó cũng chưa phải là giải pháp tuyệt đối, cũng có những hạn chế và những mặt ứng dụng tốt. Tuy nhiên đây là công cụ rất tuyệt để nhận diện điều bất thường và nên sử dụng nó cho mục đính thăm dò, điều tra.  Các chuyên gia nhấn mạnh rằng machine learning có thể hoạt động tốt hơn với những thứ khác nhau, để cuối cùng chỉ ra được những bất thường trong các tập dữ liệu mà chúng được cung cấp. Do đó, chỉ tốt khi chúng ta cung cấp dữ liệu cho machine learning. Đây là công nghệ có bổ sung, không phải là công nghệ nền tảng. Lợi ích chính Những lợi ích quan trọng của machine learning là khả năng nhận diện được xu hướng, mẫu và tính bất thường trong khối dữ liệu lớn và khác nhau với tốc độ xử lý cao. Theo một nhà cung cấp giải pháp bảo mật thì machine learning nhanh hơn nhiều so với bất kỳ công cụ nào khác, vì nó có thể hoạt động trong thời gian thực, và không cần sắp xếp dữ liệu. Do đó, machine learning có được hai yếu tố mới, quan trọng mà doanh nghiệp cần. Một là thường phải rất lâu doanh nghiệp mới nhận diện được sự xâm nhập, và trong nhiều trường hợp, chỉ nhờ công ty bảo mật bên thứ ba thông báo, và khi đó dữ liệu của doanh nghiệp đã bị rò rỉ. Do vậy, doanh nghiệp cần có khả năng cho phép họ đối mặt hiểm họa, xác định và loại bỏ trước khi chúng gây hại. Ngoài ra, doanh nghiệp nhận ra họ không thể xử lý được mọi kiểu tấn công mạng và không thể tự tạo ra được quy luật chung để nhận diện và ngăn ngừa các cuộc tấn công đó. Do vậy, nhu cầu của họ là tự động hóa quá trình phân tích dữ liệu liên quan đến bảo mật để nhận diện điều bất thường. Dưới đây là tóm tắt một số công cụ bảo mật dựa trên machine learning: Ngân hàng với machine learning Những công ty đang sử dụng machine learning cho biết họ đã có những thành công ban đầu. Một số ngân hàng chuyên cung cấp các dịch vụ tài chính cho người dùng thông thường, bắt đầu sử dụng machine learning để phát hiện giả mạo thẻ tín dụng và thẻ ghi nợ. Giả mạo thẻ ngân hàng đang rất phổ biến bởi lý do chính là rò rỉ dữ liệu thẻ từ những cửa hàng. Các giải pháp hiện nay chỉ nhận diện được thẻ giả ở mức rất cơ bản, hoặc có chi phí cao đối với một ngân hàng trung bình, không dư dả tài chính. Do vậy, nhiều ngân hàng đã sử dụng machine learning để xử lý vấn đề thẻ giả. Mặc dù nguyên gốc là được thiết kế để nhận diện các bất thường trong những dữ liệu doanh nghiệp nhưng sản phẩm của Prelert cũng có thể nhận diện được những hành vi bất thường của người dùng, trong đó có hành vi sử dụng thẻ.  \"Kẻ lừa đảo thường tuân theo một khuôn mẫu mua sắm khi sử dụng thẻ đánh cắp. Ví dụ, ban đầu chúng thường mua những món hàng ít tiền để xác nhận rằng thẻ đó có hiệu lực và hoạt động. Nếu giao dịch thành công, chúng nhanh chóng thực hiện một loạt giao dịch khác với mức tiền cao hơn”. Một chuyên gia cho biết. Công nghệ nhận diện giả mạo phát hiện điều bất thường trong cách sử dụng thẻ theo nhiều yếu tố khác nhau: thời gian trong ngày, lượng tiền, địa điểm, loại giao dịch... kết hợp với hiểu biết chuyên sâu về các mẫu giao dịch giả mạo mà ngân hàng có được trong quá khứ. Trên thực tế ứng dụng của ngân hàng, mặc dù chỉ mới triển khai giải pháp nhận diện giả mạo dựa trên machine learning trong thời gian ngắn nhưng kết quả giảm được tình trạng mất tiền do lừa đảo đến 50%. Vé quản lý bằng machine learning Một ứng dụng khác về machine learning là các dịch vụ phân phối lại vé, như StubHub tích hợp công nghệ được 18 tháng. Theo StubHub, nhiều mối hiểm hoạ bảo mật xuất hiện gần đây, nên machine learning trở thành một phần tích hợp trong chiến lược bảo mật chung của công ty, nhất là để chống lại nạn chiếm đoạt tài khoản người dùng. Giải pháp machine learning trong sản phẩm ứng dụng là học từ những mẫu có sẵn mà nó nhận diện bên trong hệ thống của StubHub, nên nó có thể dự đoán được mã độc nào đó nguy hại đ","relevance":1},{"title":"Giới thiệu về Machine Learning","url":"http:\/\/dotnet.edu.vn\/ChuyenMuc\/Gioi-thieu-ve-Machine-Learning-1043.aspx","content":"Nguồn bài viết: machinelearningcoban ©2015 DOTNET GROUP. All contents are copyright of their authors. ©2016 DOTNET GROUP. All contents are copyright of their authors.","relevance":0},{"title":"Machine Learning Offers a Path to Deeper Insight","url":"https:\/\/www.intel.sg\/content\/www\/xa\/en\/analytics\/machine-learning\/overview.html","content":"By signing in, you agree to our Terms of Service. Forgot your Intel username or password? Do you work for Intel? Sign in here. The browser version you are using is not recommended for this site. Please consider upgrading to the latest version of your browser by clicking one of the following links. Machine learning is becoming faster and more accessible. Our customers are using massive data sets to build smarter cities, power intelligent cars, and deliver personalized medicine…and that is just the beginning. Machine learning and artificial intelligence are at the heart of today’s technological innovations. Learn more from Intel leadership keynotes and industry panels on topics such as accelerating AI, using AI to improve our world, and making AI more accessible. Read more › Data scientists, developers, and researchers are using machine learning to gain insights previously out of reach. Programs that learn from experience are helping them discover how the human genome works, understand consumer behavior to a degree never before possible, and build systems for purchase recommendations, image recognition, and fraud prevention, among other uses. Now you can scale your machine learning and deep learning applications quickly – and gain insights more efficiently – with your existing hardware infrastructure. Popular open frameworks newly optimized for Intel, together with our advanced math libraries, make Intel® Architecture-based platforms a smart choice for these projects. Learn more about machine learning › Discover how Intel used machine learning to increase sales leads › Big speed jumps like those Intel is seeing in performance on specific algorithms are rarely possible in the traditional high-performance computing world, where problems are well-defined and optimization work has already been happening for many years. Machine learning algorithms still have room for improvement. Andrey Nikolaev, a software architect on the team in Russia, says that at given times, it appears that he and his colleagues have optimized an algorithm to the maximum extent possible. “Then tomorrow we will understand—or someone will come to us and show us—how we can make it faster,” he says. “Optimization is something you can do forever.” Explore more › The popular open-source development framework for image recognition is now optimized for Intel® Architecture. Learn how to install Caffe* Get the framework The Python library designed to help write deep learning models is now optimized for Intel® Architecture. Getting started with Theano* Visit the library Apache Spark* MLlib, the open-source data processing framework’s machine learning library, now includes Intel® Architecture support. Building faster applications on Spark clusters Get the library Intel’s open-source Trusted Analytics Platform provides prebuilt machine learning functions, making it easier to build public and private cloud analytics apps. Spark and Intel’s Trusted Analytics Platform Learn more Tools, techniques, and frameworks that boost machine learning performance on Intel® Architecture. Visit the Intel® Developer Zone A high-performance library with assets to help accelerate math processing routines and increase application performance. Get the Library Deep neural network technical preview for Intel® MKL Highly optimized library that helps speed big data analytics by providing algorithmic building blocks for all data analysis stages and for offline, streaming, and distributed analytics usages. Learn more about Intel® DAAL Open-source options for Intel® DAAL Technical resources and free training that help developers deliver multi-level parallel performance that scales. Access Intel® Modern Code High throughput scoring on existing server class infrastructure. Learn more about Intel® Xeon® processor E5 family Achieve shorter time to train deep neural networks on robust, scalable infrastructure. Learn more about Intel® Xeon Phi™ processor family Showcases the collaboration between Intel and university researchers. Visit the showcase Select software development products and user forum support for qualified students, educators, academic researchers, and open-source contributors. Get the free tools See the latest developments in efficient computing, immersive experiences, transportation, and other leading research areas. Learn more about Intel Labs Learn how Intel is moving machine learning from an academic pursuit to a driver of innovation. Read more As data volumes grow, so does the need for scalable systems that use machine learning to train complex models. Read more Discover how machine learning and advanced analytics can increase your competitive advantage. Read more At Intel, we are excited about the potential of AI to transform our world in amazing new ways. Read more","relevance":0}]}]}