{"collection":[{"query":"Sách hay","description":"Muốn tìm kiếm các loại sách đang hot nhất trên thị trường, các loại truyện dài.","sites":[{"title":"Sách bán chạy hàng Tuần 16\/10\/2017 - 22\/10\/2017 | Vinabook.com","url":"https:\/\/www.vinabook.com\/sach-ban-chay\/tuan","content":"Chưa có tài khoản vui lòng ĐĂNG KÝ Giỏ hàng rỗng CÔNG TY CỔ PHẦN THƯƠNG MẠI DỊCH VỤ MÊ KÔNG COM Địa chỉ: 292A Hòa Bình, Phường Hiệp Tân, Quận Tân Phú, Tp. Hồ Chí Minh MST: 0303615027 do Sở Kế Hoạch Và Đầu Tư Tp.HCM cấp ngày 10\/03\/2011 Tel: 08.73008182 - Fax: 08.39733234 - Email: hotro@vinabook.com","relevance":0},{"title":"SÁCH HAY - Các loại sách hay nhất mọi thời đại - Zing.vn","url":"https:\/\/news.zing.vn\/sach-hay.html","content":"Luis Sepúlveda và khúc ca đầy kiêu hãnh của một chú chó săn Sách hay Thiên tài kể chuyện người Chile lại một lần nữa khiến người đọc phải thổn thức. Ẩn trong cuốn sách nhỏ là bài học lớn về tình bạn và những giá trị vĩnh hằng của thiên nhiên. Cẩm nang dành cho người ôn luyện đề thi năng lực tiếng Hàn Sách hay  Có đau cũng phải đẹp và 'tình' Sách hay Đàn bà hiểu đàn bà không khó, nhưng đàn bà “yêu” đàn bà để viết về đàn bà tình và đẹp thì lại không hề dễ.  Đánh thức sức mạnh tiềm ẩn của lòng biết ơn Sách hay \"Tôi biết ơn & tôi giàu có\" đặt ra vấn đề về sức mạnh của lòng biết ơn giúp con người chạm vào được những điều kỳ diệu trong cuộc sống.  Bước ngoặt thay đổi cuộc đời bạn Sách hay Cuốn sách \"Đời thay đổi khi ta thay đồ\" mang đến cho bạn đọc những cách thức làm mới bản thân mình thông qua một vài sự thay đổi nhỏ trên trang phục thường ngày.  'Bến xe' - minh chứng cho một tình yêu bất diệt Sách hay Trong thế giới này nhiều người không cho tình thầy trò là đúng, không coi tình cảm ấy là tình cảm thanh thuần.  Có một tình yêu mang tên 'Hạ đỏ' Sách hay \"Hạ đỏ\" là câu chuyện tình yêu, chuyện tình thầm lặng và đau khổ của những cô bé cậu bé vẫn chưa trưởng thành hẳn, chuyện tình của cái thời vẫn còn ngô nghê và vụng dại.  'Hãy tiến lên, đi, khám phá, tận hưởng và yêu cuộc sống...' Sách hay Đọc \"Ở xứ đàn bà không chạy chợ\", bạn sẽ cảm nhận được sự thú vị, mới lạ trên từng mảnh đất mà tác giả đặt chân đến.  Cuốn sách giúp bạn giải đáp câu hỏi lớn nhất của cuộc đời Sách hay Không riêng các bạn trẻ, nhiều người trưởng thành vẫn quẩn quanh câu hỏi mình hợp với công việc nào. Tất cả sẽ có câu trả lời khi đến với bộ sách \"Mình có thể làm nghề gì?\".  ‘Chuyến đi bão táp’ của Uber Sách hay Cuốn sách “Chuyến đi bão táp” cho thấy hành trình đầy chông gai của Uber trên con đường trở thành một trong những hãng dịch vụ vận tải hàng đầu thế giới.  'Bụi đường tuổi trẻ': Cuộc hành trình hiểu về bản thân Sách hay Nếu đang cầm trên tay cuốn du ký của tác giả Tâm Bùi, thì chúc mừng bạn đã may mắn sở hữu chiếc vé cho chuyến phiêu lưu đầy cảm hứng và đam mê của tuổi trẻ.  Ra mắt sách về một bậc thầy sơn mài Việt Nam Sách hay Cuốn “Sơn mài Phạm Hậu” cung cấp thông tin về sự nghiệp của một họa sĩ quan trọng, qua đó cho thấy những đóng góp của ông với nghệ thuật sơn mài Việt. Xem thêm Lê Hoàng dùng tên Tổng thống Trump trong sách mới để gây chú ý? Tin tức xuất bản                     Quảng cáo Giấy phép báo điện tử số: 236\/GP-BTTTT. Tổng Biên tập: Ngô Việt Anh Cơ quan chủ quản: Hội Xuất bản Việt Nam. Tòa soạn: D29 Trần Thái Tông, Cầu Giấy, Hà Nội. Chỉ được phát hành lại thông tin từ website này khi có sự đồng ý bằng văn bản của báo.","relevance":1},{"title":"Tuyển tập sách hay nên đọc một lần trong đời - Downloadsach.com","url":"https:\/\/downloadsach.com\/top-10\/sach-hay-nen-doc.html","content":"Dưới đây là tuyển tập những quyển sách hay nên đọc một lần trong đời. Nội dung sách rất đa dạng từ sách kinh doanh, kỹ năng cho đến những quyển sách văn học kinh điển đã được bạn đọc yêu mến bình chọn.      Trong cuốn sách Tư duy như một kẻ lập dị, Steve D.Levitt & Steph J.Dubner, đồng tác giả của hai cuốn sách vô cùng lý thú pha chút hóm hỉnh Kinh tế học hài hước và Siêu kinh tế học hài hước, sẽ một lần nữa dùng lối văn phong phá cách của mình để “mở khóa tư duy” của độc giả. Xin nhắc lại đây không phải là một cuốn sách hài hước, đơn giản chỉ là để giải trí, mà ngoài những yếu tố, những ví dụ vui nhộn, hai tác giả này còn muốn người đọc có được một thái độ tích cực hơn với những gì bất ngờ xảy đến, hãy luôn thoát khỏi lối mòn và trang bị cho mình những cách giải thích đơn giản nhất có thể.     Nhưng sự thật đôi khi nghiệt ngã và diễn biến khó ngờ, dù đã rất nổ lực để đi học, thoát nghèo, để thực hiện ước mơ trở thành nhà toán học, nhưng Lintang vẫn không tránh khỏi số phận của cái nghèo. Thực tế cuộc sống ác nghiệt đến mức bóp tan tành và vùi dập giấc mơ của 1 đứa trẻ. Chấp nhận là chấp nhận thế nào???     Để những nguyện vọng của mình được thực hiện, ít nhất bạn phải thành công về mặt tiền bạc. Quyển sách này sẽ giúp bạn biết cách vận dụng những nguyên lý quan trọng để phát triển tài chính. Hãy để cuốn sách dẫn dắt bạn đi từ một hoàn cảnh khó khăn, tiêu biểu là một cái túi lép xẹp, đến một cuộc sống đầy đủ và hạnh phúc, tiêu biểu là một túi tiền căng phồng, sung túc. Khi nói đến tiền bạc, chúng ta thường đề cập đến quy luật trọng trường và nó luôn phổ quát và bất biến trong mọi trường hợp. Trải qua thời gian dài và phát triển, quy luật này đã được trải nghiệm và đúc rút thành những bí quyết không chỉ đảm bảo cho bạn một túi tiền đầy, mà còn giúp cho bạn có một cuộc sống cân bằng để có thể phát triển mỹ mãn hơn những tiềm năng của bản thân trong các lĩnh vực khác của cuộc sống. Bởi trên thực tế, không ai có thể phủ nhận rằng sự dồi dào về vật chất có thể làm cho đời sống con người trở nên tốt đẹp hơn. Riêng trong lĩnh vực kinh doanh, sức mạnh tài chính là phương tiện chủ yếu để đo lường mức độ thành đạt của các doanh nhân. Ngày nay, tiền bạc vẫn có những ảnh hưởng lớn đối với cuộc sống con người, cũng giống như cách đây năm ngàn năm nó đã chi phối mạnh mẽ cuộc sống của cư dân vương quốc Babylon, thúc đẩy họ tìm hiểu và nắm bắt các quy luật tạo ra tiền, nhằm có được một cuộc sống sung túc và sang trọng bậc nhất. Những trang sách này sẽ đưa chúng ta trở lại vương quốc Babylon cổ đại, cái nôi nuôi dưỡng những nguyên lý cơ bản về tài chính mà giờ đây con người hiện đại đã kế thừa và vận dụng trên toàn thế giới.     Bản chất của con người – và của bất cứ sinh vật nào – không phải là đầu hàng, hoặc phỉ nhổ và nguyền rủa sự tồn tại của mình; điều ấy thực ra đòi hỏi cả một quá trình suy đồi mà tốc độ của nó tuỳ thuộc mỗi người. Một vài người đầu hàng vào lần đầu tiên tiếp xúc với áp lực; một vài người mặc nhiên đầu hàng; một số khác đi xuống từ từ và cứ thế mất dần ngọn lửa mà chính họ cũng không hề nhận ra nó đã tàn lụi như thế nào. Sau đó, tất cả biến mất trong cái đầm lầy khổng lồ gồm những người già cỗi, những người rao giảng rằng trưởng thành bao hàm việc chối bỏ chính kiến, rằng sự ổn định bao hàm việc chối bỏ những giá trị riêng, và rằng sống thực tế có nghĩa là phải gạt bỏ sự tồn tại. Chỉ một số ít người kiên quyết không đầu hàng và tiếp tục tiến lên; họ biết rằng không thể phản bội ngọn lửa kia; họ học cách nuôi dưỡng nó, cho nó hình hài, mục đích và sự sống… Tóm lại, dù tương lai mỗi người khác nhau, ở vào thời điểm bắt đầu cuộc sống, nhân loại luôn tìm kiếm một hình ảnh cao cả về bản chất con người cũng như về cuộc sống. Có rất ít cột chỉ đường trong cuộc tìm kiếm này. Suối nguồn là một trong những cột chỉ đường đó. Đây chính là một trong những lý do cơ bản nhất khiến cho suối nguồn có sức hấp dẫn lâu dài; nó tái khẳng định tinh thần của tuổi trẻ, nó tuyên bố về chiến thắng của con người, nó chỉ ra người ta có thể làm được những gì…”.     Trong quyển sách Đừng bao giờ đi ăn một mình, Ferrazzi chỉ ra từng bước cách thức – và lý do – mà chính ông đã áp dụng để kết nối với hàng ngàn người là đồng nghiệp, bạn bè có tên trong số danh bạ, những người ông đã giúp đỡ và ngược lại cũng sẵn sàng giúp đỡ ông.    Để chiếm được sự yêu mến của mọi người và chủ động trong mọi mối quan hệ, yếu tố quan trọng nhất là khả năng ĐỌC một ai đó. Chắc chắn bạn đã từng băn khoăn không biết người ngồi đối diện đang nghĩ gì? Họ có đang nói dối bạn không? Đối tác đang ngồi đối diện với bạn trên bàn đàm phán đang nghĩ gì và nói gì tiếp theo? ĐỌC người khác là một trong những công cụ quan trọng, có giá trị nhất, giúp ích cho bạn trong mọi khía cạnh của cuộc sống. Những nguyên tắc được chia sẻ trong cuốn sách này không đơn thuần là những lý thuyết hay mẹo vặt chỉ đúng trong một số trường hợp hoặc với những đối tượng nhất định. Các kết quả nghiên cứu trong cuốn sách này được đưa ra dựa trên phương pháp S.N.A.P – cách thức phân tích và tìm hiểu tính cách một cách bài bản trong phạm vi cho phép mà không làm mếch lòng đối tượng được phân tích. Phương pháp này dựa trên những phân tích về tâm lý, chứ không chỉ đơn thuần dựa trên ngôn ngữ cử chỉ, trực giác hay võ đoán.    Nội dung sách là những trải nghiệm trong chuyến phiêu du theo đuổi vận mệnh của mình đã giúp Santiago thấu hiểu được ý nghĩa sâu xa nhất của hạnh phúc, hòa hợp với vũ trụ và con người. Tiểu thuyết Nhà giả kim của Paulo Coelho như một câu chuyện cổ tích giản dị, nhân ái, giàu chất thơ, thấm đẫm những minh triết huyền bí của phương Đông. Trong lần xuất bản đầu ti","relevance":1},{"title":"Những cuốn sách hay nên đọc - Giới Thiệu Sách Hay | Tiki.vn","url":"https:\/\/tiki.vn\/sach-hay-tiki-khuyen-doc","content":"Đăng nhập để theo dõi đơn hàng, lưu danh sách sản phẩm yêu thích, nhận nhiều ưu đãi hấp dẫn. Quên mật khẩu? Nhấn vào đây Vui lòng gửi email. Chúng tôi sẽ gửi link khởi tạo mật khẩu mới qua email của bạn. Tạo tài khoản để theo dõi đơn hàng, lưu danh sách sản phẩm yêu thích, nhận nhiều ưu đãi hấp dẫn. Khi bạn nhấn Đăng ký, bạn đã đồng ý thực hiện mọi giao dịch mua bán theo điều kiện sử dụng và chính sách của Tiki. Để Con Được Ốm  64.000 ₫ 80.000 ₫ Mua ngay Một Với Một Là Ba  99.000 ₫ 124.000 ₫ Mua ngay Cô Gái Trên Tàu  79.200 ₫ 99.000 ₫ Mua ngay Xuân Yến  104.000 ₫ 130.000 ₫ Mua ngay Sống Như Người Paris  72.000 ₫ 90.000 ₫ Mua ngay Con Mèo Triệu Kiếp  64.000 ₫ 80.000 ₫ Mua ngay Thành Phố Hồn Rỗng  94.400 ₫ 118.000 ₫ Mua ngay Ping - Vượt Ao Tù Ra Biển Lớn  54.000 ₫ 68.000 ₫ Mua ngay Bài Học Phần Lan 2.0  95.000 ₫ 119.000 ₫ Mua ngay Quân Vương  48.000 ₫ 60.000 ₫ Mua ngay Tuổi Trẻ Đáng Giá Bao Nhiêu  56.000 ₫ 70.000 ₫ Mua ngay Cà Phê Cùng Tony - Tái Bản  60.000 ₫ 85.000 ₫ Mua ngay Lĩnh Nam Chích Quái (Ấn Bản Kỉ Niệm 60 Năm NXB Kim Đồng)  280.000 ₫ 350.000 ₫ Mua ngay Lên Đường Với Trái Tim Trần Trụi - Tôi Là Một Con Lừa  46.400 ₫ 58.000 ₫ Mua ngay Thiện, Ác Và Smartphone  70.400 ₫ 88.000 ₫ Mua ngay Con Đường Hồi Giáo  64.000 ₫ 80.000 ₫ Mua ngay Bức Xúc Không Làm Ta Vô Can  57.600 ₫ 72.000 ₫ Mua ngay Cho Tôi Xin Một Vé Đi Tuổi Thơ (Tái Bản 2015)  44.000 ₫ 63.000 ₫ Mua ngay Trời Vẫn Còn Xanh, Em Vẫn Còn Anh  71.200 ₫ 89.000 ₫ Mua ngay Combo Nguyễn Nhật Ánh: Chuyện Xứ Lang Biang (Trọn Bộ 4 Tập) - Tặng Kèm 4 Sổ Thần Chú + 1 Túi Xách Màu Mùa Hè Rực Rỡ (Màu Ngẫu Nhiên - Số Lượng Có Hạn)  548.000 ₫ 730.000 ₫ Mua ngay Chuyện Con Mèo Dạy Hải Âu Bay (Tái Bản 2014)  31.500 ₫ 35.000 ₫ Mua ngay Your Name (Quà Tặng Postcard Cho Lần Đầu Phát Hành)  60.000 ₫ 75.000 ₫ Mua ngay Bí Mật Của Naoko  84.240 ₫ 108.000 ₫ Mua ngay Khu Vườn Ngôn Từ  76.000 ₫ 95.000 ₫ Mua ngay Chú Chó Gác Sao (Boxset 2 Tập)  64.000 ₫ 80.000 ₫ Mua ngay Không Gia Đình (Tái Bản 2014)  94.000 ₫ 119.000 ₫ Mua ngay Khi Lỗi Thuộc Về Những Vì Sao  84.000 ₫ 105.000 ₫ Mua ngay Harry Potter Và Hòn Đá Phù Thủy - Tập 1 (Tái Bản 2017)  101.000 ₫ 135.000 ₫ Mua ngay Hành Trình Về Phương Đông (Ấn Bản Đặc Biệt)  216.000 ₫ 270.000 ₫ Mua ngay Harry Potter Và Đứa Trẻ Bị Nguyền Rủa: Phần Một Và Hai  113.000 ₫ 150.000 ₫ Mua ngay Tôi Tài Giỏi - Bạn Cũng Thế  88.000 ₫ 110.000 ₫ Mua ngay 13 Nguyên Tắc Nghĩ Giàu Làm Giàu - Think And Grow Rich (Bản Gốc, Được Phục Hồi Và Chỉnh Sửa)  65.000 ₫ 80.000 ₫ Mua ngay Đọc Vị Bất Kỳ Ai - Để Không Bị Lừa Dối Và Lợi Dụng  49.000 ₫ 60.000 ₫ Mua ngay Thế Giới Phẳng  204.000 ₫ 272.000 ₫ Mua ngay Tuần Làm Việc 4 Giờ (Tái Bản 2015)  69.000 ₫ 85.000 ₫ Mua ngay Tôi Là Jack Ma  96.000 ₫ 120.000 ₫ Mua ngay Tỷ Phú Bán Giày (Tái Bản)  68.000 ₫ 85.000 ₫ Mua ngay Nhà Đầu Tư Thông Minh (Tái Bản 2016)  120.900 ₫ 155.000 ₫ Mua ngay Nghệ Thuật Bán Hàng Bậc Cao (Tái Bản)  101.000 ₫ 128.000 ₫ Mua ngay Điểm Bùng Phát (Tái Bản 2015)  87.000 ₫ 109.000 ₫ Mua ngay Đắc Nhân Tâm (Khổ Lớn)  61.000 ₫ 76.000 ₫ Mua ngay Tôi Tài Giỏi - Bạn Cũng Thế  88.000 ₫ 110.000 ₫ Mua ngay Chiến Thắng Con Quỷ Trong Bạn  62.000 ₫ 76.000 ₫ Mua ngay Đọc Vị Bất Kỳ Ai - Để Không Bị Lừa Dối Và Lợi Dụng  49.000 ₫ 60.000 ₫ Mua ngay Khuyến Học (Tái Bản 2014)  46.020 ₫ 59.000 ₫ Mua ngay Cuốn Sách Hoàn Hảo Về Ngôn Ngữ Cơ Thể - Body Language (Tái Bản 2014)  158.000 ₫ 198.000 ₫ Mua ngay Tuần Làm Việc 4 Giờ (Tái Bản 2015)  69.000 ₫ 85.000 ₫ Mua ngay Người Nam Châm - Bí Mật Của Luật Hấp Dẫn  34.000 ₫ 43.000 ₫ Mua ngay Tôi Tài Giỏi Bạn Cũng Thế 2 - Bí Quyết Thành Công Dành Cho Tuổi Teen  76.000 ₫ 95.000 ₫ Mua ngay Đời Thay Đổi Khi Chúng Ta Thay Đổi (Tập 1)  38.000 ₫ 47.000 ₫ Mua ngay Công Chúa Nhỏ  54.400 ₫ 68.000 ₫ Mua ngay Con Mèo Triệu Kiếp  64.000 ₫ 80.000 ₫ Mua ngay Trong Gia Đình (Đinh Tị)  70.000 ₫ 89.000 ₫ Mua ngay Charlotte Và Wilbur (Tái Bản 2014)  40.000 ₫ 50.000 ₫ Mua ngay Lũ Trẻ Đường Tàu (Tái Bản 2016)  51.200 ₫ 64.000 ₫ Mua ngay Con Mèo Trời  35.000 ₫ Mua ngay Truyện Ehon Nhật Bản - Ai Ở Sau Lưng Bạn Thế?  26.000 ₫ 29.000 ₫ Mua ngay Ehon Nhật Bản: Trường Mẫu Giáo Của Chú Voi Grumpa  26.000 ₫ 29.000 ₫ Mua ngay Ehon Nhật Bản: Bàn Tay Kỳ Diệu Của Sachi  34.000 ₫ 39.000 ₫ Mua ngay Ehon Nhật Bản: Chiến Công Đầu Tiên Của Bé Mi  26.680 ₫ 29.000 ₫ Mua ngay Để Con Được Ốm  64.000 ₫ 80.000 ₫ Mua ngay Nuôi Con Không Phải Là Cuộc Chiến  63.000 ₫ 79.000 ₫ Mua ngay Giờ Chơi Đến Rồi  73.600 ₫ 92.000 ₫ Mua ngay Con Cái Chúng Ta Đều Giỏi - Bí Quyết Làm Trỗi Dậy Tài Năng Trong Con Bạn  80.000 ₫ 100.000 ₫ Mua ngay Những Đứa Trẻ Thông Minh Nhất Thế Giới  79.000 ₫ 99.000 ₫ Mua ngay Mẹ Dắt Con Đi  53.000 ₫ 68.000 ₫ Mua ngay 33 Bài Thực Hành Theo Phương Pháp Shichida  44.000 ₫ 55.000 ₫ Mua ngay Một Túi Yêu Thương  87.000 ₫ 109.000 ₫ Mua ngay Dạy Con Kiểu Do Thái: Sự May Mắn Của Cái Đầu Gối Bị Trầy Xước  56.000 ₫ 69.000 ₫ Mua ngay Nuôi Dạy Con Kiểu Nhật Bản (Tập 2)  55.250 ₫ 85.000 ₫ Mua ngay Hotline: 1900-6035 Địa chỉ văn phòng: 52 Út Tịch, phường 4, quận Tân Bình, thành phố Hồ Chí Minh Tiki.vn nhận đặt hàng trực tuyến và giao hàng tận nơi, chưa hỗ trợ mua và nhận hàng trực tiếp tại văn phòng hoặc trung tâm xử lý đơn hàng Địa chỉ gửi hàng đổi\/trả\/bảo hành: Trung tâm xử lý đơn hàng TIKI - 367\/F370 Đường Bạch Đằng, P.2, Q.Tân Bình TP. Hồ Chí Minh (Tham khảo hướng dẫn đổi, trả, bảo hành hoặc liên hệ 1900-6035 để được hướng dẫn thêm) Giấy chứng nhận Đăng ký Kinh doanh số 0309532909 do Sở Kế hoạch và Đầu tư Thành phố Hồ Chí Minh cấp ngày 06\/01\/2010","relevance":1},{"title":"35 cuốn sách hay nên đọc trong đời","url":"http:\/\/tramdoc.vn\/tin-tuc\/35-cuon-sach-hay-nen-doc-trong-doi-ndAnW.html","content":"Có rất nhiều các Top sách hay nên đọc được các tờ báo, trang web nổi tiếng trên thế giới giới thiệu. Tuy nhiên, tôi ấn tượng nhất với Top 35 cuốn sách hay nên đọc ít nhất một lần trong đời do Business Insider giới thiệu lại từ Reddit. Đây là những cuốn sách mà bút lực của người viết đã vượt qua được giới hạn thể loại và đối tượng độc giả ban đầu họ muốn nhắm đến, chính vì vậy Top sách hay này xứng đáng để mọi người tìm đọc     Viết về một hành trình đi khắp nước Mỹ trong mùa hè của một người cha và cậu con trai, cuốn sách còn là một hành trình triết học với đầy những câu hỏi cơ bản về cuộc sống và cách sống trên đời.        Đồi thỏ viết về hành trình đi tìm vùng đất mới của một nhóm các chú thỏ khi biết trước nơi chúng đang ở sẽ bị con người và máy móc phá hủy. Cuốn sách thiếu nhi này gây ngạc nhiên với người đọc bởi vì có độ dày như sách dành cho người lớn. Tuy nhiên cũng chính bởi vậy, bạn đọc đặc biệt là trẻ em có thể trải qua nhiều cuộc phiêu lưu nối tiếp cùng nhóm thỏ. Với trẻ nhỏ các em sẽ hiểu được phần nào sự nguy hiểm khi sống giữa thiên nhiên hoang dã, ý chí vượt qua khó khăn và sức mạnh của tinh thần đoàn kết, nhưng độc giả lớn tuổi đã có ít nhiều trải nghiệm cuộc sống sẽ nhìn thấy ở đó câu chuyện của cuộc sống, xã hội. Sách đã được xuất bản tại Việt Nam và chuyển thể thành phim hoạt hình cùng tên.        Giáo sư khoa học máy tính tại Đại học Carnegie Mellon- Mỹ, trở nên nổi tiếng sau khi đưa ra một bài giảng lạc quan mang tên \"Bài giảng cuối: Để thật sự đạt được ước mơ thời thơ ấu của bạn\" ở thời điểm ông biết mình bị ung thư tuyến tụy và chỉ có thể sống tốt trong vòng 3-6 tháng nữa. Sau thành công của bài giảng, ông cùng một người bạn viết nên cuốn sách The Last Lecture- Bài giảng cuối cùng khuyến khích mọi người tận hưởng mọi giây phút của cuộc sống. Sách đã được xuất bản tại Việt Nam.        Trong cuốn sách A Short History of Nearly Everything - Lược sử vạn vật này Bill Bryson mô tả một cách đơn giản và thô mộc mọi thứ từ kích thước và lịch sử của vũ trụ cho tới lịch sử của nhân loại. Ông cũng dành thời gian nói về các nhà khảo cổ học lập dị, nhân chủng học, và các nhà toán học đã đóng góp cho những khám phá vĩ đại nhất của thế giới. A Short History of Nearly Everything- Lược sử vạn vật là cuốn sách về khoa học bán chạy nhất ở Anh năm 2005 với hơn 300,000 bản in được bán ra, đồng thời cũng là cuốn sách khoa học bán chạy nhất tại Mỹ. Cuốn sách cũng đồng thời đạt hai giải thưởng danh giá là Giải Aventis (2004) cho cuốn sách khoa học đại cương hay nhất, và giải Descartes (2005) về truyền thông khoa học. Sách đã được Alpha Books dịch và xuất bản tại Việt Nam.        Man's Search for Meaning  được viết bởi Viktor Frankl từ chính kinh nghiệm của mình là tù nhân trong trại tập trung Auschwitz trong Thế chiến II . Với sự hiểu biết phong phú và trải nghiệm tâm lý của người tù, Frankl ngẫm lại những ý nghĩa của cuộc sống, và cách làm thế nào mà xã hội lại có những người đứng đắn và không đứng đắn.        The Forever War viết về sự trở về của chiến binh miễn cưỡng William Mandella sau khi rời trái đất để chiến đấu với các chủng tộc người ngoài hành tinh bí ẩn Taurans. Nhưng vì thời gian giãn nở, nên William mới đi 10 năm, nhưng trên trái đất thì đã 700 năm trôi qua. Khi Mandella trở lại, trái đất đã biến thành một hành tinh hoàn toàn khác, khiến anh không còn nhận ra. Được viết bởi cựu binh tham gia chiến tranh Việt Nam, cuốn tiểu thuyết The Forever War là một ẩn dụ về cuộc sống của người lính sau khi tham gia cuộc chiến tranh này.        Cuốn sách Cosmos - Vũ trụ này giúp mọi độc giả, kể cả những người không có nhiều kiến thức về khoa học, cũng có thể hiểu được lịch sử 15 tỷ năm của vũ trụ của chúng ta. Sách đã được dịch và xuất bản tại Việt Nam.        Bartleby The Scrivener là một tiểu thuyết ngắn viết về câu chuyện ngớ ngẩn của một người đàn ông tên Bartleby làm việc tại một công ty luật New York. Bartleby là một nhân viên tuyệt vời, cho đến một ngày anh được yêu cầu đọc lại tài liệu bất kỳ và chỉ đơn giản nói \"Tôi không muốn!\", cho đến khi câu nói đó trở thành phản ứng thụ động và làm thay đổi cuộc sống của anh sau đó.        Maus là cuốn tiểu thuyết hoạt hình (graphic novel) đạt giải thưởng Pulitzer, kể về câu chuyện của một người sống sót của người Do Thái Holocaust và con trai ông, một họa sĩ truyện tranh đang cố gắng để dung hòa với câu chuyện của cha mình. Maus là sự thật ảm đạm và kinh hoàng về của cuộc sống dưới thời Hitler, cũng như câu chuyện về mối quan hệ của người con trai với người cha già của mình.        Tác phẩm truyện tranh này viết về Robert Jordan, một chuyên gia phá hủy trẻ và lý tưởng của Mỹ, chiến đấu cùng lực lượng chống phát xít trong nội chiến Tây Ban Nha năm 1937. For Whom the Bell Tolls - Chuông nguyện hồn ai diễn ra trong vòng 68 giờ, trong khi Jordan đang cố gắng tìm cách để thổi bay một cây cầu của địch, đấu tranh với các nhà lãnh đạo thụ động của lực lượng du kích, và rơi vào tình yêu với một người phụ nữ trẻ người Tây Ban Nha. Sách đã được xuất bản tại Việt Nam.        Kafka on the Shore - Kafka bên bờ biển là sự pha trộn các chương viết về hai nhân vật, cậu bé Kafka 15 tuổi trong hành trình chạy trốn lời nguyền: mày sẽ ngủ với mẹ và chị gái mày sau khi giết cha. Và nhân vật còn lại là ông già Nakata, bị một tai nạn từ nhỏ, mất trí nhớ và khả năng đọc, viết; bù lại ông có thể giao tiếp với loài mèo, vì thế ông nhận sứ mệnh đi tìm con quỷ giết mèo hàng loạt, tìm một phiến đá bí ẩn… Hai số phận tưởng chừng như không liên quan, mà đan xen vào nhau để trở thành một tấm gương phản chiếu lẫn nhau... thành một hành trình siêu hình đầy tính hiện thực huyền diệu. ","relevance":1},{"title":"Sách hay nên đọc mỗi ngày | Đọc sách & tải Ebook miễn phí","url":"https:\/\/kenhtuyensinh.vn\/sach-hay","content":"© Kenhtuyensinh.vn is completely powered by the Kenh Cong Ltd., ® Kenhtuyensinh.vn giữ bản quyền nội dung trên website này. 14:30 PM 28\/06\/2017 Dường như mỗi trang của Ngôi nhà số 11 đều ẩn chứa một nút thắt hay bí mật làm độc giả phải liên tục đưa ra các suy đoán. 13:30 PM 28\/06\/2017 \"Lỗi - Error 404\", một cuốn sách viết về vấn đề trầm cảm nhưng không mang lại cảm giác chán nản, bi lụy cho người đọc. Ngược lại, tác phẩm giúp bạn thấy tin hơn vào cuộc sống. 10:00 AM 27\/06\/2017 \"Ở Hà Nội\" giúp độc giả có thể học cách yêu từ những điều nhỏ nhất, biết thương bản thân mình trọn vẹn, từ đó nuôi dưỡng một niềm tin vững chắc về tình yêu và về cuộc sống. 09:00 AM 27\/06\/2017 Nguyễn Quang Thiều là nhà thơ được coi là tiên phong trong lĩnh vực đổi mới thơ hiện đại. Sáng tác của ông luôn là một tiếng nói độc đáo, khác lạ và giàu cá tính. 08:00 AM 27\/06\/2017 \"Nghệ sĩ hình thể\" là một câu chuyện nhỏ nhắn, thân mật, yên tĩnh và lạ lùng. 14:00 PM 26\/06\/2017 Một tác phẩm báo chí nhưng luôn được nhớ đến như một tiểu thuyết ly kỳ bậc nhất. 13:00 PM 26\/06\/2017 Nhật Bản thế kỷ 18 đã sản sinh ra một tác phẩm kinh điển của thể loại chí quái, không thua kém \"Liêu Trai chí dị\" hay... phim Hollywood ngày nay. 03:30 AM 21\/06\/2017 “Cuốn sách này sẽ tiết lộ cách thức hệ thống này đang vận hành và những điều chúng ta có thể làm để chiến đấu với nó… mang lại hòa bình...\", tác giả viết. 02:30 AM 21\/06\/2017 Nếu gặp rắc rối hãy hỏi các chuyên gia đừng hỏi những kẻ có kinh nghiệm. Đừng để sự do dự cản bước bạn. 01:30 AM 21\/06\/2017 Với những ai đang khao khát muốn khởi nghiệp thì \"Giữa dòng xoáy cuộc đời\" sẽ là cuốn sách bổ ích đúc kết kiến thức và kinh nghiệm thực tế về start-up ở Việt Nam. 03:30 AM 20\/06\/2017 Đợi mặt trời là một cuốn sách tuyệt đẹp cho thiếu nhi, là một cuốn sách tràn đầy hy vọng, bao dung, chờ đợi và tin cậy. 02:30 AM 20\/06\/2017 Một cuốn tiểu thuyết đậm đặc màu xanh u ám, thứ màu sắc mang tính hủy diệt tận cùng trong mọi sáng tác của nhà văn Ryu Murakami.a Tin tức mới Kỹ năng Kenhtuyensinh.vn cung cấp thông tin tuyển sinh, tư vấn hướng nghiệp, thông tin du học & học bổng… © Copyright 2017 Kenhtuyensinh.vn Giấy phép Mạng Xã Hội số 355\/GP-BTTTT do Bộ TTTT cấp. Liên hệ Quảng cáo: 0938 637 670 (Ms Đào)","relevance":1},{"title":"9 cuốn sách về bán hàng hay nhất mọi thời đại: Là dân sales nhất định không thể bỏ qua","url":"http:\/\/cafebiz.vn\/9-cuon-sach-ve-ban-hang-hay-nhat-moi-thoi-dai-la-dan-sales-nhat-dinh-khong-the-bo-qua-20171017143240764.chn","content":"Tin mới 5 thói quen hàng ngày ảnh hưởng rất xấu đến sức khỏe Nếu không đáp ứng được những điều kiện này, bạn nên xem lại sức khỏe của thận Rolex, Patek Philippe hay bất kỳ chiếc đồng hồ cao cấp nào cũng đều cần bảo quản đúng cách để luôn tốt như mới Khung cảnh thu lá vàng xuyến xao lòng người: Đâu phải ngẫu nhiên mà chúng ta yêu mùa thu đến vậy Bí mật của cây đàn 20 triệu USD: Chế tác bằng cây gỗ quý nghìn năm tuổi Món súp đắt nhất hành tinh nấu từ \"tử thần của biển cả\", được tôn vinh là một trong \"tứ đại món ngon\" Trung Hoa 2017 có thể là năm nắng nóng nhất hơn một thế kỷ qua Đi học, đi làm ở nước ngoài có sướng gì đâu, toàn những nỗi lòng chỉ người trong cuộc mới hiểu Lời giải nào cho bài toán 4,3 triệu đàn ông Việt ế vợ trong tương ai? Những sai lầm trong thiết kế phòng khách nếu mắc phải bạn cần thay đổi ngay lập tức Lá thư từ Thuỵ Điển - quốc gia được mệnh danh \"gần-như-hoàn-hảo\" 9 sai lầm bạn thường mắc phải khi tắm trong mùa đông 10 điều ai cũng phải khắc cốt ghi tâm nếu muốn có một cuộc đời suôn sẻ Chuyện công sở: Những kẻ nịnh hót tiến rất nhanh, nhưng có thể rơi xuống hố bất cứ lúc nào Ngắm những phòng ngủ nhỏ nhưng tiện và hiện đại đến không ngờ Suy gan nguy hiểm thế nào? Kê chân cao khi ngủ: tốt hay nguy hiểm? Học được 2 chữ này, cuộc đời mỗi người có thể trở nên thanh thản, an nhiên Nghệ thuật thoát khỏi sự bề bộn của người Nhật Người trẻ Mỹ thích \"ở nhà với mẹ\" Công ty được đầu tư bởi Bill Gates muốn phát triển một liệu pháp chữa bách bệnh bao gồm cả ung thư Khoảnh khắc phi công bị hút khỏi cửa sổ máy bay Cuộc sống sung sướng hơn người, ngập trong hàng hiệu của hai mẹ con đại gia sở hữu nhiều túi khủng nhất nhì thế giới TP HCM sẽ cấm công chức mặc quần jeans, áo thun trong giờ làm Trung Quốc: Một bà cụ ném tiền xu vào động cơ để cầu cho máy bay không có gián 14 điều chỉ những ai từng là \"dân văn phòng\" mới hiểu Nằm lòng 4 tuyệt chiêu chống trộm cực cần thiết khi gia đình đi nghỉ lễ dài ngày 20\/10\/2017 10:45 PM Trên Amazon có hàng ngàn tựa sách có chữ \"sales\" hoặc \"selling\". Nhưng theo Geoffrey James, biên tập viên gạo cội của tờ Inc - Tạp chí về quản trị kinh doanh nổi tiếng tại Mỹ, các chủ doanh nghiệp và các nhân sales chỉ cần đọc 9 cuốn sách hay nhất về bán hàng dưới đây là có thể thay đổi công việc kinh doanh của mình. 1. The Greatest Salesman in the World (Tạm dịch: Người bán hàng vĩ đại nhất thế giới) - Og Mandino Nằm trong danh sách 10 cuốn sách kinh doanh gây ảnh hưởng nhất trong lịch sử, với cuốn sách về bán hàng hàng đầu này, Og Mandino giúp người đọc khám phá những khía cạnh tích cực đằng sau nghề bán hàng. Đó là tái định hình lại hành vi bán hàng từ truyền cảm hứng sang thúc đẩy mọi người hành động và đạt đến mục tiêu. 2. How to Master the Art of Selling (Tạm dịch: Làm chủ nghệ thuật bán hàng) - Tom Hopkins Thật khó để đánh giá quá tầm ảnh hưởng to lớn mà Tom Hopkins đã tạo ra trong lĩnh vực bán hàng. Ông là người đầu tiên khám phá ra những thứ mà nhiều người bây giờ thừa nhận: Bán hàng là một quá trình quản lý nỗi sợ hãi của mình và tập trung vào những nhu cầu của khách hàng. Độc giả sẽ tìm thấy nhiều điều hấp dẫn và hữu ích trong cuốn sách sales đỉnh cao này. 3. The Sales Advantages (Tạm dịch: Lợi thế bán hàng) – J.Oliver Crom và Michael Crom Cuốn sách giúp các nhân viên bán hàng trau dồi các kĩ năng phát triển mối quan hệ lâu dài với khách hàng của mình, giúp khách hàng gặt hái được rất nhiều các thành công hơn. Đây là cuốn cẩm nang tư vấn chi tiết đối với từng bước trong 11 bước của quy trình bán hàng một cách đầy đủ và hiệu quả nhất. “Lợi thế bán hàng” là một cẩm nang đầy tính thực tiễn và đã được kiểm chứng của một tên tuổi nổi tiếng nhất trong lĩnh vực đào tạo kỹ năng bán hàng. 4. The Little Red Book of Selling (Tạm dịch: Bán hàng không phải ai cũng biết) - Jeff Gitomer Jeff Gitomer giống như \"Seth Godin\" của thế giới bán hàng. Ông có biệt tài “chưng cất” những vấn đề kinh doanh phức tạp xuống bản chất cơ bản của nó, và sau đó giải thích chính xác cách sử dụng tinh chất đó giúp cho việc bán hàng thành công hơn. Đây cũng là cuốn sách sale cực hay mà mọi người làm nghề bán hàng đều nên sở hữu. 5. The Psychology of Selling (Tạm dịch: Những đòn tâm lý trong bán hàng) - Brian Tracy Trong cuốn sách này, Brian Tracy đã đưa ra những động lực bên trong của cả người mua và người bán, giải thích cách họ tương tác để tạo ra cơ hội, lợi ích cho cả hai bên một cách sâu sắc và cần thiết. Bí quyết đơn giản tới mức gần như khó tin (chính vì thế mà nhiều người bán hàng bỏ qua) đó là: Khách hàng không quan tâm tới sản phẩm hay dịch vụ của bạn là gì. Điều duy nhất họ quan tâm là sản phẩm hay dịch vụ của bạn có lợi gì cho họ. Vì vậy thay vì chỉ quan tâm tới sản phẩm và suy nghĩ, cảm xúc của bản thân, người bán hàng thành công cần tập trung vào tâm lí và lợi ích của khách hàng. 6. Mastering the Complex Sale (Tạm dịch: Làm chủ các thương vụ phức tạp) - Jeff Thull Trước khi cuốn sách hay về bán hàng này ra đời, phần lớn mọi người đều cho rằng một nhân viên bán hàng tốt có thể \"bán bất cứ thứ gì cho bất cứ ai\". Nhưng trong cuốn sách này, tác giả Jeff Thull đã chỉ ra rằng, nhân viên bán hàng giỏi phải hiểu được bán hàng là quá trình mà ở đó một nhân viên bán hàng có thể giúp khách hàng hiểu rõ nhu cầu, lựa chọn thay thế của mình, và thực hiện những thay đổi cần thiết, để mua một giải pháp sẽ thay đổi toàn bộ công việc kinh doanh của họ. 7. Cỗ máy bán hàng tối ưu – Chet Holmes Chet Holmes là chuyên gia bán hàng hàng đầu thế giới. Cuốn sách “Cỗ máy bán hàng tối ưu” đưa đến 12 chiến lược bán hàng hiệu quả nhất từ trước đến nay. 12 chiến lược này thực chất là 12 công việc mà bất cứ nhân viên ","relevance":1},{"title":"Sách hay: Tuyển tập những cuốn sách hay nên đọc","url":"http:\/\/eva.vn\/sach-hay-c215.html","content":"© Copyright 2004-2017 EVA.VN, all rights reserved. Sử dụng phần mềm EVA OCM 5.1. Cơ quan chủ quản: Công ty Cổ phần Quảng cáo Trực tuyến 24H. Trụ sở: Tầng 12, Tòa nhà Geleximco, 36 Hoàng Cầu, Phường Ô Chợ Dừa, Quận Đống Đa, TP Hà Nội. Tel: (84-24) 73 00 24 24 hoặc (84-24) 3512 1806 - Fax: (84-24) 3512 1804. Chi nhánh: Tầng 5 – Toà nhà Hải Âu - 39B Trường Sơn, Phường 4, Q.Tân Bình, TP.Hồ Chí Minh. Tel: (84-28) 73 00 24 24 hoặc (84-28) 3848 9845 - Fax: (84-28) 3848 6519. Giấy phép số: 351\/GP-TTĐT ngày cấp 5\/2\/2015. SỞ THÔNG TIN VÀ TRUYỀN THÔNG TP HÀ NỘI. Chịu trách nhiệm trang tin: Nguyễn Thị Hồng Yến HOTLINE: 0903 288 624","relevance":1},{"title":"12 cuốn sách hay nên đọc dành cho các bạn trẻ - Thái Hà Books","url":"http:\/\/thaihabooks.com\/12-cuon-sach-hay-nen-doc-danh-cho-cac-ban-tre\/","content":"Chúc bạn luôn THÀNH CÔNG - HẠNH PHÚC - BÌNH AN “Trên thế gian này không có cuốn sách nào mà ai cũng phải đọc, chỉ có những cuốn sách mà một cá nhân phải đọc vào một thời điểm ở một nơi nhất định trong một hoàn cảnh nhất định, và vào một giai đoạn trong cuộc đời.” – Lâm Ngữ Đường – Bạn đã tìm được cuốn sách nào phù hợp cho mình chưa? Nếu chưa hãy thử xem những gợi ý dưới đây đó là những cuốn sách được tham khảo từ nhiều nguồn: từ những người thành công giới thiệu, những cuốn sách đạt giải sách hay hàng năm, hoặc những cuốn được rất nhiều bạn bè của tôi đã đọc và chia sẻ. Chúc bạn sẽ tìm được cuốn sách thích hợp với bản thân lúc này.  Một cuốn sách đã trở thành cuốn sách gối đầu giường của các nhà lãnh đạo trên thế giới. Năm 2002, cuốn sách đã được tạp chí Fobes đưa vào danh sách 10 cuốn về quản trị có ảnh hưởng nhất trên thế giới từ trước tới nay. Và hiện nay, trên thế giới đã tạo nên một nền văn hóa mới ở trên thế giới đó là nền văn hóa 7 thói quen hiệu quả. Đến 75% tập đoàn trong Fortune 500 và 90% tập đoàn Fortune 10 đã áp dụng 7 thói quen vào cho nhân viên để tăng năng lực lãnh đạo của nhân viên và tổ chức. Thế giới văn minh đã lên một làn sóng áp dụng thói quen hiệu quả này, còn bạn thì sao?  Ông Inamori Kazuo được coi là một huyền thoại kinh doanh của nước Nhật, Người sáng lập công ty cổ phần Kyoto Ceramic(hiện nay là Kyocera) và DDI hiện nay là KDDI. Người đã được mời về để vực dậy Japanese airline sắp bị rớt xuống nguy cơ phá sản, và với triết lý sống của mình ông đã làm Japanese Ariline cất cánh. Ông đã trở thành huyền thoại mà các nước phương tây phải nể phục. Cuốn sách cách sống được chính ông inamori Kazuo viết để đúc kết lại những triết lý của cuộc đời mà ông áp dụng trong cuộc đời đầy thăng trầm và hoài bão của mình. Đọc sách bạn sẽ thấy được cách ông suy nghĩ, cách ông sống, cách ông nỗ lực để có thể tạo nên những điều phi thường như ông đã làm.  Cuốn sách Đúng việc của tác giả Giản Tư Trung, sau khi xuất bản năm 2015 đã dần dần lan truyền trên cộng đồng yêu sách. Chắc hẳn tác giả là người Việt nên rất hiểu vấn đề của chúng ta và đâu là giải pháp. Tôi gặp trong xã hội, phần lớn mọi người đều rất làng nhàng: thời sinh viên học làng nhàng, đi làm làng nhàng? Rồi sống cũng làng nhàng? Nguyên nhân ở đâu? Đó là bởi vì họ không biết học để làm gì? Làm để làm gì? Sống để làm gì? Chắc hẳn mọi người bạn trẻ ai cũng từng có câu hỏi: Làm người là gì? Tôi là ai? Đâu là con người tôi phải trở thành? Khi trả lời được những câu hỏi đó thì sẽ đi trên con đường mới, không còn làng nhàng mà là dấn thân. Bàn về cuốn sách tác giả muốn nhấn mạnh, công việc chính trong đời của một người là: làm người, làm dân, và làm việc. Một con người thành công khi và chỉ khi họ làm đúng và làm tốt công việc của mình, một gia đình thành công khi và chỉ khi mọi thành viên trong gia đình làm đúng và làm tốt công việc của mình, một tổ chức thành công khi và chỉ khi mọi thành viên trong công ty làm đúng và làm tốt công việc của mình.  Trên đường băng là tập hợp những bài viết được ưa thích trên Facebook của Tony Buổi Sáng. Sách gồm 3 phần: “Chuẩn bị hành trang”, “Trong phòng chờ sân bay” và “Lên máy bay”, tương ứng với những quá trình một bạn trẻ phải trải qua trước khi “cất cánh” trên đường băng cuộc đời, bay vào bầu trời cao rộng. Những bài viết của Tony sinh động, thiết thực, hài hước và xuất phát từ cái tâm trong sáng của một người đi trước nhiều kinh nghiệm. Anh viết về thái độ với sự học và kiến thức nói chung, cách ứng phó với những trắc trở thử thách khi đi làm, cách sống hào sảng nghĩa tình văn minh…truyền cảm hứng cho các bạn trẻ sống hết mình, trọn vẹn từng phút giây.  Trong lần xuất bản đầu tiên tại Brazil vào năm 1988, sách chỉ bán được 900 bản. Nhưng, với số phận đặc biệt của cuốn sách dành cho toàn nhân loại, vượt ra ngoài biên giới quốc gia, Nhà giả kim đã làm rung động hàng triệu tâm hồn, trở thành một trong những cuốn sách bán chạy nhất mọi thời đại, và có thể làm thay đổi cuộc đời người đọc. Cuốn sách chia sẻ những trải nghiệm trong chuyến phiêu du theo đuổi vận mệnh của mình đã giúp Santiago thấu hiểu được ý nghĩa sâu xa nhất của hạnh phúc, hòa hợp với vũ trụ và con người.  Một cái tên sách rất dễ thương, cuốn sách thứ 2 của hòa thượng Minh Niệm sau cuốn sách Hiểu về trái tim được rất nhiều bạn đọc yêu thích. Gần 300 trang sách là những đúc kết của tác giả sau thời gian dạy thiền và tâm lý trị liệu ở trong và ngoài nước. Thầy Minh Niệm mong muốn đồng hành cùng với những người bận rộn, giúp họ có cuộc sống thư thái hơn, bình an hơn. Cuốn sách mang đến những phương thức để mọi người có thể “vừa làm, vừa sống” thay vì phải làm xong việc rồi mới có thể sống, hoặc làm mãi mà quên sống.  Jim Rohn được gọi là người thầy của những người thầy. Bởi vì ông là người đã truyền cảm hứng cho rất nhiều lãnh đạo trên thế giới như: Anthony robbin, Jack Canfield, Brian Tracy… Những Triết lý sâu sắc đã được ông chuyển lại về những ngôn từ hết sức gần gũi, ông đã gắn những triết lý phức tạp của cuộc sống vào hình ảnh quy luật thiên nhiên như 4 mùa cuộc sống, từ đó bạn dễ dàng rút ra bài học để áp dụng vào cuộc sống thường ngày.    Cuốn sách cực kỳ hữu ích cho các bạn sinh viên, đây giống như một cuốn cẩm nang trên con đường xây dựng sự nghiệp: Cuốn sách sẽ cho bạn những lời khuyên từ cách xây dựng một bộ hồ sơ xin việc, cách đi phỏng vấn, cách xây dựng sự tự tin, cách làm việc hiệu quả, trở thành lãnh đạo, … từng chủ đề các bạn có thể học hỏi và áp dụng ngay lời khuyên từ một CEO hàng đầu thế giới Alex Malley – CEO CPA Australia.  Được viết với độc quyền tiếp cận Musk, gia đình và bạn bè anh, cuốn sách lần theo cuộc hành ","relevance":1},{"title":"Sách hay, truyện hay, tác phẩm hay, văn học đa thể loại - VnExpress Giải Trí","url":"https:\/\/giaitri.vnexpress.net\/tin-tuc\/sach","content":"Người hâm mộ gào khóc khi thấy Sơn Tùng M-TP Ca sĩ từng thất vọng vì khán giả ngồi ăn khi xem anh hát ở liveshow \"M-TP Ambition\". Vì bố mẹ cấm đoán, ca sĩ quê Thái Bình từng phải đợi cả nhà ngủ say để được sống trong thế giới nhạc underground. Con gái tổng thống Mỹ viết về những câu chuyện truyền cảm hứng cho phụ nữ, chia sẻ kỹ năng nắm bắt cơ hội, khởi nghiệp. Nhà văn Anh gốc Nhật Kazuo Ishiguro giành Nobel Văn học 2017 \/ Nỗi buồn thời hậu chiến trong sách tân chủ nhân Nobel Văn học ‘Con ma nhà họ Can’ của Oscar Wilde trở lại màn bạc Tổng thống Pháp trao bản quyền in tự truyện ở Việt Nam Cựu Phó Tổng thống Mỹ viết tự truyện về con trai bị ung thư Tác phẩm bắt lỗi từ điển Giáo sư Nguyễn Lân nhận giải Sách Hay Nhà văn Anh gốc Nhật Kazuo Ishiguro giành Nobel Văn học 2017 Murakami tiếp tục được đặt cược cao ở Nobel Văn học 2017 Phim ngắn lấy cảm hứng từ truyện tranh Doraemon Nguyễn Bình Phương đoạt giải thưởng Hội Nhà văn Hà Nội Haruki Murakami tiếp tục được cược thắng Nobel Văn học 2016 'Miền hoang' của Sương Nguyệt Minh đoạt giải Sách Hay 2015 \/ Giải Sách Hay xin lỗi vì vinh danh cuốn sách 'tái bản cẩu thả' 'Cuộc đời tròn hay méo?' của blogger Cu Trí Andrea Pirlo và giải thưởng trọn đời cho người nghệ sĩ thầm lặng Khán giả háo hức với triển lãm ảnh nude đầu tiên ở Việt Nam Sơn Tùng M-TP khóc trước tình cảm của hàng nghìn fan Nhà văn Ma Văn Kháng ra mắt sách ở tuổi ngoài 80 Tác giả Mỹ gốc Việt kể chuyện cuộc đời mồ côi, bị xâm hại Thú dịch chuyển, khám phá thế giới trong sách 'Bụi đường tuổi trẻ' MC Quỳnh Hương khen ngợi 'bản sao' của Khánh Ly \/ MC Quỳnh Hương khóc khi nghe cụ ông 78 tuổi hát Hội chợ sách Việt Nam thu hút hàng nghìn độc giả 1 2 3 4 5 Trang chủ Tìm kiếm Trang chủ Tải VnExpress App © Copyright 1997 VnExpress.net, All rights reserved ® VnExpress giữ bản quyền nội dung trên website này. VnExpress tuyển dụng Liên hệ: Quảng cáo \/ Tòa soạn Đường dây nóng: 0123.888.0123 (HN) - 0129.233.3555 (TP HCM) © Copyright 1997 - VnExpress.net, All rights reserved. ® VnExpress giữ bản quyền nội dung trên website này.","relevance":0},{"title":"10 cuốn sách hay nên đọc có thể thay đổi cuộc đời bạn - Ohay TV","url":"https:\/\/www.ohay.tv\/view\/10-cuon-sach-hay-nen-doc-co-the-thay-doi-cuoc-doi-ban\/2ynhs","content":"Đắc nhân tâm được mệnh danh là quyển sách hay nhất, nổi tiếng nhất, bán chạy nhất và có tầm ảnh hưởng nhất mọi thời đại, Đắc Nhân Tâm của Dale Carnegie là một quyển sách hay nên đọc để biết về nghệ thuật thu phục lòng người và khiến cho mọi người phải yêu mến mình. Quyển sách này cũng nêu bật những nguyên tắc trong việc đối nhân xử thế khôn ngoan bắt đầu từ việc thấu hiểu, thành thật với chính bản thân mình cũng như gợi ý cho người đọc cách quan tâm đến những người xung quanh để hòa nhập, phát triển khả năng của chính mình và mọi người lên một tầm cao mới. Những người đã đọc sách Đắc Nhân Tâm có thể cũng cảm nhận được một tinh thần xuyên suốt mà tác giả muốn thể hiện trong quyển sách hay này. Đó là chữ “nhẫn”. Có chữ “nhẫn” thì mọi việc sẽ được thay đổi nhìn nhận theo một hướng khác mà nơi đó sẽ làm cho cuộc sống trở nên tốt đẹp hơn.  “Đời thay đổi khi chúng ta thay đổi” đem đến cho độc giả những tình huống vô cùng thực tế, thậm chí là những câu chuyện vừa “nhỏ nhặt” lại vừa “quan trọng” với cách ứng xử khôn ngoan, thú vị và hài hước... Đồng thời, độc giả như bắt gặp chính mình trong đó, với những khó khăn, thất bại, với những tình huống giao tiếp vừa chân thật lại vừa bổ ích. Thưởng thức bộ sách này của Andrew Matthews để học hỏi, giải trí và chắc chắn người đọc sẽ lĩnh hội được rất nhiều những bài học vô cùng hấp dẫn và bổ ích.  Đây là một siêu kinh điển của nền văn nước ngoài, tác phẩm đã từng làm mưa làm gió trong lòng bạn đọc yêu thích phong cách thần thoại kỳ ảo và kinh điển, “Anh chàng Hobbit” sở hữu bút pháp văn chương độc đáo khiến cho người đọc phải sững sờ, choáng váng với một thế giới Trung Địa bao la cùng núi cao, rừng thẳm, tiên rồng và những người khổng lồ … vô cùng phong phú. Tác phẩm “Anh chàng Hobbit” sẽ đưa người đọc lạc vào một thế giới cổ tích với những điều mới lạ, đầy quyến rũ và kì ảo. Người đọc sẽ bị cuốn hút bởi những tình tiết li kì và hấp dẫn.  Với “Cho tôi xin một vé đi tuổi thơ”, của Nguyễn Nhật Ánh đã thổi hồn vào các nhân vật xuyên suốt trong câu chuyện của mình. Từ cậu cu Mùi muốn tập tành làm “nhà cách mạng tí hon”, với trí tưởng tượng phong phú luôn muốn thay đổi những điều tất yếu và nhàm chán trong cuộc sống thường ngày đến những triết lí có lúc ngô nghê đôi lúc lại đầy sâu sắc của những đứa trẻ chưa đi hết 1 phần 8 cuộc đời. Thông qua những tình huống đầy gay cấn, thú vị và hài hước, tác giả cũng muốn gửi gắm vào quyển sách này những tình cảm, niềm nhung nhớ cho một thời tuổi thơ và những câu chuyện đầy sâu sắc, ý nghĩa trong cuộc sống gia đình và bạn bè. Chưa có một quyển sách nào mà 2 thế hệ người già và người trẻ lại gần nhau đến thế, đọc “Cho tôi xin một vé đi tuổi thơ” để nhặt lại kí ức, nhặt lại những kỉ niệm của 1 thời tuổi thơ đã xa rồi, đọc để trải nghiệm cái cảm giác ôm bụng cười mà trong lòng thấy tâm đắc, rưng rưng vì câu chuyện đó.  “Thấu Hiểu Tiếp Thị Từ A Đến Z” dành cho tất cả những ai đang làm công việc kinh doanh và tiếp thị với một đam mê nhằm thoả mãm các nhu cầu của khách hàng, đem thêm hạnh phúc cho khách hàng và cho xã hội. Trong cuốn “Thấu hiểu tiếp thị từ A đến Z” này, Philip kotler, nhà hiền triết đáng kính nhất về tiếp thị, đã chọn lọc và khảo sát các khái niệm quan trọng nhất của bộ môn này trong hiện tại và cả tương lai, đưa ra một đúc kết mới mẻ và thú vị về việc tiếp thị sẽ thay đổi như thế nào, và những người làm công việc tiếp thị phải thay đổi ra sao. Kotler đã nêu bật 80 khái niệm căn bản của tiếp thị, chia sẻ với chúng ta những suy giảm sâu sắc và sáng tạo thu thập được qua 40 năm kinh nghiệm từng trải của mình. Những lập luận xuất sắc của ông đã làm sáng tỏ những chủ đề như thương hiệu, lợi thế cạnh tranh, tính sáng tạo, quản lý quan hệ khách hàng, tiếp thị trên cơ sở dữ liệu, khác biệt hoá, đổi mới, định vị, và phân khúc thị trường.  Đọc và hiểu những tác phẩm này sẽ giúp bạn có lợi thế hơn những người khác trong cuộc sống, cho dù đó chỉ là những lợi thế rất nhỏ. Tuy nhiên, đôi khi những khác biệt nhỏ giữa mỗi người lại tạo ra sự chênh lệch rất lớn trong cuộc sống về sau.   1. “Thuyết phục bằng tâm lý”: Đây là một trong những cuốn sách thuộc đề tài nghệ thuật thuyết phục được đánh giá rất cao trên thế giới. Trong “Thuyết phục bằng tâm lý”, nhà tâm lý học Robert Cialdini đã chỉ ra và phân tích sáu nguyên tắc tâm lý của nghệ thuật thuyết phục bao gồm: sự nhất quán, sự đáp trả, bằng chứng xã hội, uy thế, thiện cảm và sự khan hiếm. Đây là những nguyên tắc tâm lý ảnh hưởng và chi phối đến quyết định của mỗi người và đặc biệt, chúng có sức ảnh hưởng vô cùng lớn nếu được kết hợp với nhau.  2. “Tìm kiếm sự khôn ngoan: Từ Darwin tới Munger”: Cuốn sách dành cho những người luôn yêu thích việc tìm kiếm tri thức với tinh thần của Charles Munger: “Tất cả những gì tôi muốn biết là nơi tôi sẽ chết vì vậy tôi sẽ không bao giờ đi đến nơi đó”. Hiểu được lý do và cách chúng ta “chết” sẽ giúp chúng ta tránh được điều tồi tệ. Hay nói cách khác, chúng ta không thể loại bỏ hoàn toàn sai lầm nhưng chúng ta có thể ngăn chặn chúng làm tổn thương mình.  3. “Lá thư từ Stoic”: Một điều rõ ràng khi đọc cuốn sách này chính là sự thông thái của Seneca. Bức thư của ông đề cập tới tất cả mọi thứ chúng ta đang phải đối phó: thành công, thất bại, sự giàu có, nghèo đói và nỗi buồn. Cuốn sách với những triết lý mang tính thực tế của Senena không chỉ trang bị cho bạn những kiến thức thực tế mà còn giúp ích cho bạn trong khả năng giao tiếp.  4. “Châm ngôn đạo đức của Publius Syrus\" Syrius, từng là một nô lệ của Syria là một nhà thông thái vượt thời gian.Một số câu nói của ông đã trở nên rất nổi tiếng như: “Một người khôn ngoan là người sửa chữa được sai lầm củ","relevance":1},{"title":"Dự án Văn hóa - Giáo dục Sách Hay","url":"http:\/\/sachhay.org\/","content":"Sách do Biên tập viên tuyển chọn Cảo thơm Sự kiện của \"sách hay\" THƯ PHÒNG CỦA CHUYÊN GIA Sách do đơn vị xuất bản tuyển chọn và giới thiệu Văn phòng Dự án Văn hóa Giáo dục Sách Hay Số 04 Bà Huyện Thanh Quan, Quận 3, TP. HCM ĐT: +84 (28) 3930 0188 - Email: info@SachHay.org","relevance":1},{"title":"Sách hay | MaxReading.com","url":"https:\/\/www.maxreading.com\/","content":"Giới thiệu về Sài Gòn Bí quyết ứng xử trong tình yêu Tìm hiểu về loài chuột Mẹo vặt y khoa thực dụng Truyện kể danh nhân lịch sử Trung Quốc Nhạc lý cơ bản Hán Sở tranh hùng Hướng dẫn hành nghề Bác sĩ vui tính Danh ngôn Kho tàng lục bát dân gian Sự kiện lịch sử Việt Nam Các ngày lễ kỷ niệm và lịch sử Hướng dẫn hành nghề Hán Sở tranh hùng Y học thường thức Bí quyết ứng xử trong tình yêu Truyện kể danh nhân lịch sử Trung Quốc Trang phục truyền thống Đại cương về Tiếng Việt Lịch sử các phát minh Truyền kỳ mạn lục Các nhà thơ Việt Nam thế kỷ 20 Mẹo vặt y khoa thực dụng Những câu chuyện Kinh Thánh Cựu Ước Nhân vật lịch sử Việt Nam Điển hay tích lạ Liêu trai chí dị Định hướng nghề nghiệp Giáo lý Công giáo Danh ngôn Ma túy và tác hại của việc sử dụng ma túy Trò chơi dân gian Việt Nam môi trường và cuộc sống Danh nhân Đất Việt Phép bỏ dấu hỏi - ngã trong Tiếng Việt Nhạc lý cơ bản Các kỹ năng cuộc sống Du lịch thế giới Truyện cổ Phật Giáo Đầm Jeans Hở Vai Họa Tiết Ngôi Sao 245.000đ Set áo và chân váy trẻ trung 315.000đ Set Áo Phối Lưới Và Chân Váy Xòe 345.000đ Đầm Sơ Mi Sát Nách Cột Dây Eo 325.000đ Địa Lý Khoa Học Kinh Doanh Lịch Sử Tâm Lý Tôn Giáo Triết Học Truyện Trung Hoa Văn Học Trong Nước Việt Nam Vui Cười Y Học - Sức Khỏe Thể loại khác © MaxReading.com. Email: [email protected]","relevance":0},{"title":"5 tựa sách hay về giá trị cuộc sống nên đọc trong đời - Vnwriter.net","url":"https:\/\/vnwriter.net\/top-10\/sach-hay-ve-gia-tri-cuoc-song-nen-doc-trong-doi.html","content":"Giá trị cuộc sống không chỉ có vật chất mới có thể mang lại mà đôi khi là những nghĩa cử cao đẹp mà bạn trao đi, hay khi bạn đón nhận lòng thành của một ai đó. Giá trị nằm ở bản thân mỗi con người nhận thức về chính mình. Bạn sẽ tìm thấy hạnh phúc khi và chỉ khi nhìn được giá trị của bản thân mình trong cuộc đời này và theo đuổi bằng tất cả đam mê. Có một câu nói rằng “Ý nghĩa cuộc sống là tìm thấy tài năng thiên phú của bạn, và mục đích sống chính là trao tặng nó đi.” Dưới đây 5 tựa sách hay về giá trị cuộc sống mà bạn nên đọc trong đời : Theo những biến cố thăng trầm trong đời sống của nữ nhân vật chính, sách cũng mở ra nhiều vấn đề về cuộc sống và những chiêm nghiệm đầy trí tuệ tương ứng. Những kinh nghiệm trưởng thành của nhân vật chính là để chúng ta chứng thực tính thực tiễn và quan trọng của những chiêm nghiệm ấy. Dưới sự chỉ dẫn của bậc trí giả, cô gái nhân vật chính cuối cùng cũng cải thiện được nội tại của mình, tiến thêm một bước thay đổi thế giới bên ngoài, giống như con sâu thoát kén hóa bướm đón gió xuân. Trước thực tại của một xã hội Nhật Bản mà con người ngày càng đánh mất đi giá trị truyền thống, Inamori Kazuo đưa ra một yêu cầu bức thiết là phải nhìn lại “lẽ sống” của con người thời hiện đại. Lẽ sống qua cái nhìn của tác giả không phải là cái gì xa vời mà là những điều giản đơn, những giá trị gần gũi hay những thói quen hằng ngày: “những nguyên tắc đạo đức chân phương”. Bởi lẽ, Thượng Đế khi tạo ra bạn đã cho bạn một sứ mệnh và không ai khác có thể hoàn thành điều đó tốt hơn chính bạn. Ngài không chờ đợi bạn hoàn hảo, nhưng Ngài muốn bạn sử dụng tất cả những tài năng, sức mạnh mà Ngài đã ban tặng cho bạn để làm chính con người mình.. Vnwriter Tham gia cộng đồng mọt sách trên Facebook nhé các bạn :https:\/\/www.facebook.com\/groups\/625230697658922\/ Thư điện tử của bạn sẽ không được hiển thị công khai. Các trường bắt buộc được đánh dấu * Bình luận Tên * Thư điện tử * Trang web    Don't have an account?","relevance":1},{"title":"Sách hay: Tạo dựng thói quen đọc sách như người siêu thành công: Chọn sách thông minh giúp bạn cải thiện bản thân không ngờ","url":"http:\/\/cafef.vn\/sach-hay.html.chn","content":"TIN MỚI! VN-Index: GTGD: tỷ VNĐ HNX-Index: GTGD: tỷ VNĐ Bill Gates, Mark Zuckerberg, Mark Cuban... là những cái tên đã quá nổi tiếng trên thế giới về sự thành công vượt trội trong nhiều lĩnh vực. Có lẽ một phần lớn đóng góp trong thành công... Tags: đọc sách, cuốn sách, sách tốt, tri thức, sách hay, Bill Gates, sách bán chạy nhất, sách điện tử, Phát triển bản thân, người nổi tiếng Một cuốn sách hay có thể làm bạn thấy thích thú song một cuốn sách ý nghĩa sẽ trở thành \"người bạn vô giá\" của bạn cả đời, đặc biệt khi cuộc sống vốn khó khăn trở nên bế tắc. Tags: sách hay, sách có ý nghĩa, sách về cuộc sống, cuộc sống khó khăn, sách bán chạy nhất, Thích Nhất Hạnh Làm sao để thuyết phục được khách hàng bỏ tiền ra mua sản phẩm của mình. Một câu hỏi không đơn giản. Tags: đọc sách, doanh nghiệp, sách hay, bán hàng, kinh doanh, Ngôn ngữ cơ thể Fooled by Randomness (tạm dịch: Bị ngẫu nhiên xỏ mũi) của Nassim Nicholas Taleb là một quyển sách đặt ra những vấn đề về tính ngẫu nhiên, sự may mắn, về quan điểm và các ngộ nhận của... Tags: may mắn, sách hay, black swan, Fooled by Randomness, Nassim Nicholas Taleb, tài chính hành vi, thiên nga đen Quiet đưa ra những tranh luận sôi nổi, những nghiên cứu ấn tượng và nhiều câu chuyện người thật việc thật kinh điển. Tags: doanh nghiệp, mỹ, văn hóa, nghiên cứu, ấn tượng, khoa học, khảo sát, tâm lý, sách hay, tranh luận  Tags: nổi tiếng, sách hay, kiều anh, sách kinh doanh, tăng tốc đến thành công, lâm minh chánh Cuốn sách kinh doanh ưa thích đầu tiên của tỷ phú Bill Gates là Business Adventures được mượn từ tỷ phú Warren Buffet. Tags: tài chính, mỹ, Bill Gates, phố wall, tỷ phú, kinh doanh, Warren Buffet, thử thách, thế giới, sách hay Muốn quản lý thời gian tốt cần phải quyết đoán trước mọi hành động, tư duy kỹ càng và sâu lắng. Tags: thành công, quyết đoán, cuộc sống, thời gian, tư duy, hành động, sách hay, tác giả, diễn giả  Tags: khởi nghiệp, kinh doanh, cuốn sách, nên đọc, sách hay  Tags: Bill Gates, nổi tiếng, obama, Madonna, Branson, sách hay, hemingway Cuốn sách này sẽ “thay đổi cả cách chúng ta suy nghĩ về xã hội và cách chúng ta nghiên cứu kinh tế học”. Tags: người giàu, dân chủ, cuốn sách, người nghèo, sách, xã hội, kinh tế học, sách hay, Thế Kỷ 21, tư bản Cuốn sách viết về người Việt Nam, cho người Việt Nam và do người Việt Nam viết! Tags: sách hay, alphabook, những người làm chủ số 1 việt nam, đàm linh “Samsung không phải là số 1 hay số 2. Chỉ duy nhất là hạng 1,5 mà thôi.” Tags: samsung, hàn quốc, sách hay, lee kun-hee, đứng đầu thế giới, kỳ tích Đọc và hiểu những tác phẩm này sẽ giúp bạn có lợi thế hơn những người khác trong cuộc sống, cho dù đó chỉ là những lợi thế rất nhỏ. Tags: cuốn sách, nên đọc, trước tuổi 30, tác phẩm, sách hay Ban biên tập CafeF Địa chỉ: Tầng 21 Tòa nhà Center Building. Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Điện thoại: 024 7309 5555 Máy lẻ 292. Fax: 024-39744082 Email: info@cafef.vn | Hotline: 0926 864 344 Chịu trách nhiệm nội dung: Ông Nguyễn Thế Tân Liên hệ quảng cáo Hotline: 0942 86 11 33 Email: doanhnghiep@admicro.vn  © Copyright 2007 - 2017 - Công ty Cổ phần VCCorp. Giấy phép thiết lập trang thông tin điện tử tổng hợp trên internet số 1084\/GP-STTTT do Sở Thông tin và Truyền thông Hà Nội cấp ngày 16 tháng 4 năm 2014.  Ghi rõ nguồn \"CafeF\" khi phát hành lại thông tin từ kênh thông tin này.","relevance":1},{"title":"6 cuốn sách bạn nên đọc trước khi tốt nghiệp","url":"http:\/\/kenh14.vn\/6-cuon-sach-ban-nen-doc-truoc-khi-tot-nghiep-20161101182650751.chn","content":"Bạn biết không? Những tháng năm học đại học của bạn là thời gian để bạn tập dượt và thu nạp kiến thức và kỹ năng cho sự nghiệp tương lai của bạn. Và nếu bạn thực sự muốn có được thành công thì đây không phải là thời gian để bạn lơi là. Trường đại học đã dạy bạn vô điều kiện về cuộc sống, ứng xử, kỹ năng giao tiếp và cả công việc nhà nữa.  Dưới đây là 6 cuốn sách sẽ giúp bạn chạm vào thế giới thực. Từ trường đại học đến sự nghiệp: Để thành công trong thế giới thực của Lindsey Pollak  Chắc chắn, bạn đã học được những điều cơ bản để tìm kiếm một công việc ở trường đại học của bạn, nhưng bạn có thực sự nhớ hết tất cả? Đây chính là cuốn sách sẽ hướng dẫn bạn chuẩn bị hồ sơ online, ngoại hình, đơn xin việc, và mạng lưới bạn cần thiết lập để tìm kiếm công việc của bạn. Pollack sẽ cho bạn biết lý do để làm từng bước trên và để bạn thấy rằng chẳng có bước nào là vô ích cả. Nếu bạn hoàn thành tất cả các nhiệm vụ có trong cuốn sách này, bạn sẽ là một ứng viên cực kỳ tiềm năng rồi. Sổ tay gia đình Martha Stewart’s: hướng dẫn cách chăm sóc mọi thứ trong nhà của Martha Stewart  Cho dù bạn sống trong một ký túc xá hoặc trong một căn hộ, dọn dẹp nhà cửa là điều quan trọng nhất bạn phải làm. Ở riêng đòi hỏi bạn phải biết giữ gìn, chăm sóc cho ngôi nhà của bạn. Cuốn sách này sẽ hướng dẫn bạn làm việc nhà theo cách tối giản và khoa học nhất. Và có thể bạn sẽ tìm cuốn sách này trước khi mẹ đến thăm nhà bạn đấy! Đắc nhân tâm của Dale Carnegie  Đây là một trong những cuốn sách nổi tiếng bán chạy nhất thế giới. Đắc nhân tâm giúp người đọc tự rèn luyện bản thân bằng cách đưa ra những lời khuyên về cách ứng xử, giao tiếp để đạt được thành công trong cuộc sống. Sách còn hướng dẫn cách \"trông mặt mà bắt hình dong\", cách gây thiện cảm, hướng dẫn và chỉ đạo người khác. Hãy tập những thói quen tốt mà cuốn sách cuốn sách đã chỉ dẫn để tập cho mình những kỹ năng tốt bạn nhé. 7 thói quen của bạn trẻ thành đạt của Stephen R. Covey  Đây là một trong những cuốn sách được tìm đọc nhiều nhất trên các kệ sạch.  Được coi như là một công cụ sản xuất và kinh doanh, cuốn sách này đã truyền cảm hứng và thúc đẩy thành công cho nhiều người. Khi bạn đang bắt đầu sự nghiệp của bạn, bạn cần có định hướng đúng đắn, và chính định hướng sẽ giúp bạn phát triển, tôi luyện nhưng thói quen dẫn đến thành công. Tôi tài giỏi, bạn cũng thế của Adam Khoo  Cuốn sách của Adam Khoo ngay sau khi phát hành với bản dịch tiếng Việt đã tạo ra kỷ lục mới cho ngành xuất bản Việt Nam với hơn 200.000 bản in được bán ra và hơn 400.000 e-book được phân phối. Đây là cuốn sách kể về chặng đường thành công của tác giả, từ một cậu bé bất tài vô dụng, từng xếp thứ hạng 156\/160 học sinh ở một trường tệ nhất Singapore, vươn lên trở thành học sinh giỏi nhất lớp, giỏi nhất trường và cuối cùng nhờ sự nỗ lực của mình, anh đã trở thành một diễn giả tài năng, một doanh nhân thành đạt và một triệu phú thành công khi mới 26 tuổi. Đây là cuốn sách đã truyền cảm hứng cho rất nhiều bạn sinh viên để có thể tự tin phát huy những kỹ năng, điểm mạnh của bản thân và thành công trong cuộc sống. Học khôn ngoan mà không gian nan của Kevin Paul  Đây là một cuốn sách thú vị giúp bạn có những mẹo hay để học tập, quản lý thời gian, ghi nhớ khoa học và đạt được những mục tiêu đã đề ra. Cuốn sách còn vạch trần những điều nhiều sinh viên đang hoang tưởng liên quan đến kỹ năng học tập để có thể học tập hiệu quả mà không tốn quá nhiều sức lực. Kenh14.vn rất hoan nghênh độc giả gửi thông tin và góp ý cho chúng tôi. trụ sở hà nội Tầng 20, tòa nhà Center Building, Hapulico Complex, số 1 Nguyễn Huy Tưởng, p. Thanh Xuân Trung, quận Thanh Xuân, Hà Nội. Điện thoại: 024.39743410, máy lẻ 230. trụ sở tp.hồ chí minh Tầng 6 Tòa nhà 123, 123 Võ Văn Tần, phường 6, quận 3, Tp. HCM Điện thoại: 028.73077979, máy lẻ 216 chịu trách nhiệm quản lý nội dung Bà Nguyễn Bích Minh hợp tác truyền thông 024.730.7797 (máy lẻ 62658) liên hệ quảng cáo 0942 86 11 33 Chính sách bảo mật © Copyright 2007 - 2017 – Công ty Cổ phần VCCorp Tầng 17, 19, 20, 21 Tòa nhà Center Building - Hapulico Complex, Số 1 Nguyễn Huy Tưởng, Thanh Xuân, Hà Nội. Giấy phép số 1082\/GP-STTTT do Sở Thông tin và Truyền thông Hà Nội cấp ngày 16 tháng 4 năm 2014","relevance":1},{"title":"Sách bán chạy hàng Tuần 16\/10\/2017 - 22\/10\/2017 | Vinabook.com","url":"https:\/\/www.vinabook.com\/sach-ban-chay\/tuan","content":"Chưa có tài khoản vui lòng ĐĂNG KÝ Giỏ hàng rỗng CÔNG TY CỔ PHẦN THƯƠNG MẠI DỊCH VỤ MÊ KÔNG COM Địa chỉ: 292A Hòa Bình, Phường Hiệp Tân, Quận Tân Phú, Tp. Hồ Chí Minh MST: 0303615027 do Sở Kế Hoạch Và Đầu Tư Tp.HCM cấp ngày 10\/03\/2011 Tel: 08.73008182 - Fax: 08.39733234 - Email: hotro@vinabook.com","relevance":0},{"title":"Sách hay nên đọc","url":"https:\/\/lamgiau247.com\/sach-hay-nen-doc\/","content":"Chiến Lược Kinh Doanh, Kiến Thức Kinh Doanh, Sách Hay Nên Đọc E – Myth: Để xây dựng Doanh nghiệp Hiệu quả Ở Mỹ, hàng năm, hơn một triệu người bước vào kinh doanh. Sau năm đầu tiên, ít nhất 40% trong số đó sẽ phá sản. Trong vòng 5 năm tiếp theo, hơn 80% số đó, khoảng 800.000 công ty sẽ phá sản. 80% doanh nghiệp nhỏ tồn tại trong 5 … Sách Hay Nên Đọc Lamgiau147 trân trọng giới thiệu tới bạn quyển sách rất hay “ Bí quyết xây dựng cơ nghiệp bạc tỷ, Biến ý tưởng kinh doanh thành cơ hội bạc tỷ trong vòng 18 tháng”, đây là một cuốn sách chỉ giành cho những ai muốn có một doanh nghiệp hàng triệu đô và mong muốn phát triển doanh của mình lên một … Sách Hay Nên Đọc Vị Giám Đốc Một Phút – Phương Pháp Quản Lý Hiệu Quả Nhất Thế Giới Tác giả: Ken Blanchard, Spencer Johnson Người dịch: Nhiều dịch giả Nhà xuất bản: Nxb Tổng hợp TP.HCM Nhà phát hành: Trí Việt,sách hay nên đọc “Vị Giám đốc Một phút” của tác giả Spencer Johnson và Ken Blanchard đã thật sự trở thành hiện tượng toàn cầu trong những … Sách Hay Nên Đọc Lamgiau247.com xin giới thiệu với bạn đọc cuốn sách 22 quy luật bất biến trong Marketing, là một trong những cuốn sách hay nên đọc không thể thiếu cho những ai đang kinh doanh. Tác giả viết về những quy luật không thể thay đổi trong marketing, là những chiết lý marketing vô cùng hữu ích cho những ai làm kinh … Sách Hay Nên Đọc Tải sách “Từ tốt đến vĩ đại”  TỪ TỐT ĐẾN VĨ ĐẠI Tác giả: JIM COLLINS Dịch giả: Trần Thị Ngân Tuyến Nhà xuất bản: NXB Trẻ; Tổ hợp giáo dục Pace Đánh máy và kiểm tra chính tả: ocech500, anhhung9x, minhthuong, Monica, alarm-clock, nutuongcuop, ttdd, Becon53 (Một phần trong chương 1 và 2 sử dụng dữ liệu của blogsach.com) … Sách Hay Nên Đọc Cuốn sách này dành cho những ai có thị lực tốt nhưng không nhìn thấy bản chất của sự việc bằng đôi mắt của mình. Allan và Barbara Pease là hai chuyên gia nổi tiếng thế giới trong lĩnh vực giao tế nhân sự và ngôn ngữ cơ thể. Với số bán được lên đến 20 triệu bản, họ đã trở … Sách Hay Nên Đọc Giới thiệu về nội dung Bạn mong muốn đi tắt đón đầu? Bạn muốn vững bước đến thành công? Công thức để làm được điều này, theo lời bậc thầy về kết nối là Keith Ferrazzi, chính là phải biết làm quen với mọi người. Ferrazzi đã khám phá từ khi còn trẻ rằng điểm khác biệt của những người … Sách Hay Nên Đọc   Cuốn sách của thời đại, một trong những cuốn sách hay nhất về làm giàu, Tư duy kỹ năng mềm.có lẽ bạn đã được nghe  rất nhiều về cuốn sách ở những thông tin khác về nó, cuốn sách giành cho những ai muốn thay đổi cuộc đời mình,muốn thay đổi tư duy. “Suy nghĩ là Làm Giàu.” Cái … Sách Hay Nên Đọc Donald Trump và Bill Zanker chính là tấm gương sống về những người có khả năng suy nghĩ lớn và biết được khi nào nên kiên quyết bảo vệ đến cùng quan điểm của mình – bất chấp những lời chỉ trích hoặc phản đối từ người khác – để đạt được thành công trong cuộc sống cũng như trong … Sách Hay Nên Đọc Tuần này tôi giới thiệu với các bạn đọc lamgiau247, 1 cuốn sách bestselling do Thời báo New York Times bình chọn. Cuốn sách này chỉ ra cho chúng ta cách sống thanh thản hơn, hạnh phúc hơn và sống để đạt được ước mơ của mình.Xem thêm những cuốn sách hay nên đọc tại đây. Tôi đã đọc cuốn sách … Sách Hay Nên Đọc Không có người nào hạnh phúc nếu họ suốt ngày hậm hực, bực tức cả. Luật hấp dẫn luôn đúng: “Người vui vẻ sẽ hấp dẫn những điều hạnh phúc” – Dù bạn có biết đến nó hay không, có tin hay nghi ngờ thì nó vẫn diễn ra. Vì vậy, trước khi trở thành 1 người giàu có, hãy … Sách Hay Nên Đọc Đánh cắp ý tưởng là một trong những cuốn sách hay nhất về cách tạo ra ý tưởng kinh doanh,những phương pháp khiến bạn tạo ra những ý tưởng kinh doanh độc đáo đáng giá hàng triệu đô,tác giả Steal These Ideas! Xem bài 3 cách tạo ra ý tưởng kinh doanh độc đáo mới lạ Những bí quyết giúp bạn … Sách Hay Nên Đọc Điện thoại thông minh ngày càng nhiều và xu hướng nhiều người dùng đọc sách trên thiết bị di động là điều tất yếu, chính vì thế các ứng dụng đọc sách và sách điện tử ngày càng nhiều giúp cho chúng ta tiết kiệm chi phí thời gian đọc sách, tất cả thư viện sách hay được đưa vào chiếc … Sách Hay Nên Đọc Sách hay nên đọc cho những ai muốn tìm ra con đường thành công. Sau đây chúng tôi xin giới thiệu với bạn những cuốn sách hay nên đọc được đánh giá rất cao mang lại cho bạn những kinh nghiệm sống quý giá, những phương pháp học tập cực kỳ hiệu quả, đánh thức con người phi thường trong … Sách Hay Nên Đọc Sách nhà Nhà đầu tư thông minh full pdf tiếng việt   Đây là Cuốn sách hay nhất về đầu tư từng được viết cho đến nay-Warren E. Buffet.,tác giả bẹjamin graham Nhà đầu tư thông minh là cuốn dạy cho chúng ta những kiến thức kỹ năng về đầu tư nói chúng,tác giả Benjamin graham là một bậc thầy về … Lamgiau247.com là website top 1 Việt Nam về phát triển cá nhân, Học làm giàu, khởi nghiệp, Ý tưởng kinh doanh. Cho đến nay sau hơn 3 năm phát triển, website đã chia sẻ những kiến thức hữu ích giúp cho hơn 1.200.000+ và nhiều người thay đổi cuộc sống và công việc. Xem thêm> Liên hệ Tài trợ Đối tác truyền thông Website: Học Làm Giàu Hotline: 0974612427 Email: info@lamgiau247.com Địa chỉ: Số 6 Tôn Thất Thuyết, Dịch Vọng Hậu, Cầu Giấy, Hà Nội","relevance":1},{"title":"Mỗi ngày một cuốn sách | VTV.VN","url":"http:\/\/vtv.vn\/chuong-trinh-dac-sac\/moi-ngay-mot-cuon-sach.htm","content":"TIN TỨC Tin Trong Nước Chính trị Xã hội Pháp luật Tin Thế Giới Tin tức Thế giới đó đây Kinh Tế Bất động sản Tài chính Thị trường VTV Truyền Hình Phim VTV Hậu trường Nhân vật Chuyển động 24h Vấn đề hôm nay Việt Nam & thế giới Góc khán giả ĐỜI SỐNG Văn Hóa - Giải Trí Điện ảnh Âm nhạc Đời sống Du lịch Làm đẹp Giới tính Sức khỏe Tấm lòng Việt THỂ THAO Bóng đá Việt Nam Bóng đá quốc tế Quần vợt Video Các môn khác Bên lề Góc doanh nghiệp Sản phẩm Doanh nghiệp Video KHÁC Công Nghệ Sản phẩm Thị trường Tư vấn Giáo Dục Tư vấn Học trực tuyến Hoạt động VTV Lịch Phát Sóng Đăng nhập Đăng ký 30.09.2017 VTV.vn - Cuốn sách giúp người đọc khám phá những câu chuyện thú vị về những cải tiến kỹ thuật-công nghệ, và cách chúng đã dần dà thay đổi cuộc sống của chúng ta. \"Thà cứ một mình rồi quen\" - Cứ tìm, hạnh phúc rồi sẽ tới! 30.09.2017 VTV.vn - Được biết đến là tác giả của nhiều truyện ngắn viết về thân phận những người phụ nữ, nhà văn Nguyễn Anh Đào tiếp tục giới thiệu tập truyện ngắn \"Thà cứ một mình rồi quen\" NỔI BẬT 24h Mỗi ngày một cuốn sách 09:33 PM VTV.vn - \"Mẹ Việt giúp con học tốt tiếng Anh\" là cuốn sách với nhiều kinh nghiệm giúp con chinh phục môn tiếng Anh của chị Nguyễn Hương Giang. BTV Khánh Ly bật mí bí kíp dạy con nói tiếng Anh như gió Mỗi ngày một cuốn sách 06:26 PM VTV.vn Độ tuổi từ 20 - 30 là giai đoạn vừa chập chững vào đời, là ngưỡng cửa giữa trẻ con và người trưởng thành, là thời điểm vô cùng khó khăn gian khổ nhưng lại rất quan trọng. “Hạnh phúc trong 5 lá thư của mẹ”: Cuốn sách đặc biệt về tình mẫu tử Mỗi ngày một cuốn sách 06:34 AM VTV.vn - \"Hạnh phúc trong 5 lá thư của mẹ\" là một tác phẩm văn học Pháp đặc biệt, đề cập về tình mẫu tử theo một cách riêng. Gặp gỡ Nguyễn Ngọc Thạch - tác giả cuốn sách bán chạy Thất tình không sao Mỗi ngày một cuốn sách 03:39 PM VTV.vn - “Tuổi 20 nhiệt huyết” nằm trong bộ sách bestseller “Sống không hối tiếc” của tác giả Ken Honda hứa hẹn sẽ mang tới nhiều câu chuyện thú vị cho các bạn trẻ. Bạn đã biết sự khác nhau giữa sách tranh và truyện tranh? Mỗi ngày một cuốn sách 05:38 PM VTV.vn - Soup – Công thức giúp nuôi dưỡng và xây dựng văn hóa cho đội ngũ của bạn hé lộ cho độc giả bí quyết để trở thành một người lãnh đạo tuyệt vời. NS Quốc Bảo ra mắt sách, tiết lộ về nàng thơ trong âm nhạc Mỗi ngày một cuốn sách 11:11 AM VTV.vn - Cuốn sách \"50 – Hồi ký không định xuất bản\" đã tiết lộ nhiều câu chuyện không phải ai cũng biết về nhạc sỹ Quốc Bảo. \"Hành trình yêu thương - Nhật ký Thiện Nhân\": Câu chuyện về tình yêu thương và niềm hy vọng Mỗi ngày một cuốn sách 02:19 PM VTV.vn - Những dòng nhật ký về hành trình của Thiện Nhân, cậu bé bị lỏ lại trong vườn chuối với nhiều vết thương trên mình đã lần đầu tiên đến với bạn đọc. Hành trình \"Thiện Nhân và những người bạn\" - Nơi hạnh phúc được hồi sinh Mỗi ngày một cuốn sách 06:27 PM VTV.vn - Bộ sách Giáo dục thành công theo kiểu Harvard sẽ lý giải tại sao trong hơn 300 năm qua trường ĐH Harvard có thể đào tạo nhiều nhân tài đến vậy? 30 ngày cùng con học hiểu về chống xâm hại Mỗi ngày một cuốn sách 02:33 PM VTV.vn-Với những thông tin hữu ích có trong cuốn sách, mỗi cha mẹ thầy cô sẽ có thể trở thành một chuyên gia, giúp con tiếp thu và sử dụng những kiến thức về xâm hại hiệu quả nhất. Ý tưởng vòng tay bảo vệ trẻ khỏi xâm hại Mỗi ngày một cuốn sách 02:31 PM VTV.vn - Sáng 27\/4, cuốn sách \"Biên bản chiến tranh 1-2-3-4.75\" phiên bản tiếng Anh vừa được NXB Quốc gia Sự thật và Đài Tiếng nói Việt Nam giới thiệu tới công chúng tại Hà Nội. Nhiều hoạt động hưởng ứng ngày Sách Việt Nam 21\/4 Mỗi ngày một cuốn sách 12:00 PM VTV.vn - Đời sống của người Việt ở nước ngoài là một đề tài được chú ý trong văn học. Mỗi tác phẩm cung cấp cho người đọc những góc nhìn khác nhau về cuộc sống của họ. Cộng đồng người Việt tại Ba Lan tưởng nhớ các Vua Hùng Mỗi ngày một cuốn sách 07:35 PM VTV.vn - Sáng 19\/4, tại TP.HCM nhà báo, nhiếp ảnh gia Giản Thanh Sơn đã tổ chức triển lãm ảnh và ra mắt cuốn sách \"Vị thế Việt Nam\". \"Hoàng tử trở lại\" - Cuốn sách cho người lớn đã từng là trẻ con Mỗi ngày một cuốn sách 06:00 AM VTV.vn - Ngay lần đầu tiên xuất bản tại Argentina, cuốn sách \"Hoàng tử trở lại\" đã bán được 120.000 bản. Hơn 20 quốc gia đã mua bản quyền phát hành, trong đó có Việt Nam. Sôi nổi khai mạc Ngày sách Việt Nam 2017 tại Hà Nội Mỗi ngày một cuốn sách 04:14 PM VTV.vn - Nếu bạn đang tìm một cuốn cẩm nang tìm hiểu về các khái niệm ngôn ngữ học, cuốn \"Từ điển khái niệm ngôn ngữ học\" sẽ là một gợi ý. Ra mắt cuốn sách âm nhạc \"Vị tướng của lòng dân\" Mỗi ngày một cuốn sách 06:47 PM VTV.vn - Hôm nay (10\/1), nhà sản xuất Quân đội Nhân dân tổ chức giới thiệu cuốn sách \"Vị tướng của lòng dân\". Gốc gác nông dân của Tổng thống Nga Putin: Chuyện bây giờ mới kể Mỗi ngày một cuốn sách 06:35 AM VTV.vn - Cuốn sách \"Làm mẹ không áp lực\" của bác sĩ dinh dưỡng Anh Nguyễn cung cấp những vấn đề cơ bản và thiết yếu nhất về sức khỏe, dinh dưỡng, phát triển tư duy của trẻ. \"Học làm cha mẹ hiệu quả\" - Cẩm nang cho bậc cha mẹ Mỗi ngày một cuốn sách 04:47 PM VTV.vn - \"Học làm cha mẹ hiệu quả\" của Tiến sĩ Thomas Gordon là cuốn sách tiên phong dạy cha mẹ cách giao tiếp hiệu quả hơn với con. Bộ sách Mèo Mog Mập - Những câu chuyện thú vị cho trẻ thơ Mỗi ngày một cuốn sách 10:07 PM VTV.vn - Bộ sách Mèo Mog Mập gồm 5 cuốn sách vô cùng thú vị gồm: \"Mog, cô mèo đãng trí\"; \"Mog và bà\"; \"Mog và em bé\"; \"Mog ở phòng khám\" và \"Giáng sinh của Mog\". Đặc trưng văn hóa Việt Nam Hàn Quốc, tương đồng và khác biệt Mỗi ngày một cuốn sách 06:15 PM VTV.vn - Những khác biệt giữa Việt Nam và Hàn Quốc được lý giải dưới góc độ văn hóa qua cuốn sách \"Đặc trưng văn hóa Việt Nam Hàn Quốc, tương đồng và khác b","relevance":1},{"title":"20 quyển sách hay nhất mọi thời đại, thay đổi hàng triệu người trên thế giới | 1BOOK.VN","url":"http:\/\/1book.vn\/20-quyen-sach-hay-nhat-moi-thoi-dai-thay-doi-hang-trieu-nguoi-tren-the-gioi\/","content":"Mỗi quyển sách một chân trời! 20 quyển sách này được Tiến sĩ Lê Thẩm Dương chọn lọc và khuyên các bạn trẻ nên đọc. Đây là những quyển sách đã khẳng định được giá trị qua thời gian và được bạn đọc mọi thời đại cũng như khắp nơi trên thế giới khẳng định. Tuy nhiên, 20 quyển sách hay nhất mọi thời đại này vẫn theo ý kiến chủ quan của mỗi người, hy vọng các bạn đọc có thể bổ sung thêm những quyển sách mà mình tâm đắc. 1. ĐẮC NHÂN TÂM Đắc Nhân Tâm cụ thể và chi tiết với những chỉ dẫn để dẫn đạo người, để gây thiện cảm và dẫn dắt người khác,… những hướng dẫn ấy, qua thời gian, có thể không còn thích hợp trong cuộc sống hiện đại nhưng nếu người đọc có thể cảm và hiểu được những thông điệp tác giả muốn truyền đạt thì việc áp dụng nó vào cuộc sống trở nên dễ dàng và hiệu quả.  2. ĐỜI THAY ĐỔI KHI CHÚNG TA THAY ĐỔI Quyển sách này nói về: hiểu được bản thân, biết khôi hài về bản thân, trở nên suôn sẻ thuận lợi, biết tha thứ cho bản thân. Sách cũng bàn về việc nhận thức được các quy luật tự nhiên để chúng ta có thể điều chỉnh bản tính chúng ta tốt hơn. Đây là quyển sách nói về làm thế nào để được hạnh phúc.  3. CÁCH NGHĨ ĐỂ THÀNH CÔNG Bí quyết kỳ diệu được viết trong cuốn sách đã giúp Carnegie có được một tài sản khổng lồ và ông muốn truyền bá những kinh nghiệm đó cho những người không có đủ thời gian để tìm hiểu bí ẩn thực sự phía sau mỗi thành công.” Bên cạnh Andrew Carnegie, quyển sách còn kể lại rất nhiều mẫu chuyện thành công của những nhân vật khác, họ từ những con người tay trắng, thất bại, đã từng bị cuộc đời dội vào mình những gáo nước lạnh nhưng vẫn không từ bỏ, vẫn tiếp tục vươn lên, vượt qua số phận và gặt hái được thành công.  4. 7 THÓI QUEN ĐỂ THÀNH ĐẠT Với sự thấu hiểu sâu sắc và những giai thoại đầy ý nghĩa, tác giả mở ra cho chúng ta một con đường để từng bước tiến đến một cuộc sống công bằng, trung thực, cống hiến và tự trọng – những nguyên tắc giúp chúng ta dễ dàng thích nghi với mọi thay đổi, đồng thời mang đến cho chúng ta trí thông minh và sức mạnh để có thể tận dụng được mọi cơ hội mà những thay đổi có mang đến.  5. CUỘC SỐNG KHÔNG GIỚI HẠN Cuộc Sống Không Giới Hạn không chỉ là một cuộc đời, cũng không chỉ rao giảng những bài học trống rỗng và vô hồn về sức mạnh của con người. Câu chuyện của Nick là câu chuyện đã làm rung động trái tim hàng triệu người về nghị lực sống, khát vọng chinh phục, sức mạnh vượt qua những khó khăn bất tận của cuộc sống để làm chủ cuộc đời mình.  6. NGƯỜI GIÀU CÓ NHẤT THÀNH BABYLON Những trang sách này sẽ đưa chúng ta trở lại vương quốc Babylon cổ đại, cái nôi nuôi dưỡng những nguyên lý cơ bản về tài chính mà giờ đây con người hiện đại đã kế thừa và vận dụng trên toàn thế giới.  7. QUẲNG GÁNH LO ĐI MÀ VUI SỐNG Quẳng Gánh Lo Đi Và Vui Sống khuyên bạn những cách để giảm thiểu lo lắng rất đơn giản như chia sẻ nó với người khác, tìm cách giải quyết vấn đề, quên tất cả những điều lo lắng nằm ngoài tầm tay,… Cố gắng thực tập điều này hàng ngày và trong cuộc sống chắc hẳn bạn sẽ thành công, có thể, không được như bạn muốn, nhưng chỉ cần bớt đi một chút phiền muộn thì cuộc sống của bạn đã có thêm một niềm vui.  8. BỘ SÁCH HẠT GIỐNG CHO TÂM HỒN Đúng như tên gọi, sách hạt giống tâm hồn mang những hạt mầm nhỏ đến gieo vào lòng mỗi người qua những câu chuyện ẩn chứa phần chìm nhiều hơn là phần nổi. Đọc truyện hạt giống tâm hồn, mỗi một câu chuyện sẽ góp phần tưới nước giúp cho những hạt mầm nảy hạt, thành cây lớn dần lên và đâm hoa kết trái. Trái đó phải ngọt, phải ngon, không bị sâu gặm thì hạt giống tâm hồn đó đã được nuôi đúng cách và chỉ cần cái cây đó học cách đứng vững trước những sóng gió của đời.  9. TÌM KIẾM SỰ KHÔN NGOAN TỪ DARWIN ĐẾN MUNGER Cuốn sách dành cho những người luôn yêu thích việc tìm kiếm tri thức với tinh thần của Charles Munger: “Tất cả những gì tui muốn biết là nơi tui sẽ chết vì vậy tui sẽ không bao giờ đi đến nơi đó”.  10. CHÂM NGÔN ĐẠO ĐỨC CỦA PUBLIUS SYRUS Syrius, từng là một nô lệ của Syria là một nhà thông thái vượt thời gian.Một số câu nói của ông đã trở nên rất nổi tiếng như: “Một người khôn ngoan là người sửa chữa được sai lầm của mình từ những sai lầm của người khác”; “Không phải tất cả các câu hỏi đều xứng đáng nhận được câu trả lời”; “Làm hai việc cùng lúc tức là không làm được gì cả”. Bạn có thể đọc cuốn sách trong vòng chưa tới một giờ nhưng có lẽ cần dành thời gian cả phần đời còn lại để tìm hiểu và áp dụng sự khôn ngoan của ông.  11. NHÀ GIẢ KIM Tiểu thuyết Nhà giả kim của Paulo Coelho như một câu chuyện cổ tích giản dị, nhân ái, giàu chất thơ, thấm đẫm những minh triết huyền bí của phương Đông. Trong lần xuất bản đầu tiên tại Brazil vào năm 1988, sách chỉ bán được 900 bản. Nhưng, với số phận đặc biệt của cuốn sách dành cho toàn nhân loại, vượt ra ngoài biên giới quốc gia, Nhà giả kim đã làm rung động hàng triệu tâm hồn, trở thành một trong những cuốn sách bán chạy nhất mọi thời đại, và có thể làm thay đổi cuộc đời người đọc.  12. TỐC ĐỘ CỦA NIỀM TIN Là một cuốn sách khai phá và làm thay đổi nhận thức, Tốc độ của niềm tin thách thức giả định lâu nay của chúng ta cho rằng niềm tin chỉ là một đức hạnh xã hội mềm yếu, dễ vỡ và thay vào đó chứng minh rằng niềm tin là một động lực kinh tế, có sức mạnh vật chất – một kỹ năng có thể học hỏi và đo lường được qua đó giúp các công ty làm ra nhiều lợi nhuận hơn con người dễ thăng tiến hơn và các mối quan hệ trở nên gắn bó hơn.  13. THÓI QUEN THỨ 8 Thói quen thứ 8 là câu trả lời cho những ai đang kiếm tìm sự vĩ đại, cho các tổ chức đang phấn đấu đạt những thành tích có ý nghĩa vượt bậc và cho cả cuộc đi tìm Tiếng nói của Nhân loại. Sâu sắc, hấp dẫn, thuyết pục, ra đời đúng thời điểm một cách ","relevance":1},{"title":"Khám phá những cuốn sách hay về Python - FPT TechInsight","url":"https:\/\/tech.fpt.com.vn\/kham-pha-nhung-cuon-sach-hay-ve-python\/","content":"Python là một ngôn ngữ lập trình thông dịch do Guido van Rossum tạo ra năm 1990, được sử dụng cho nhiều loại ứng dụng từ các trò game đơn giản đến các thuật toán tìm kiếm phức tạp. Python luôn nằm trong top 10 ngôn ngữ lập trình phổ biến nhất ở tất cả các bảng xếp hạng lớn (TIOBE, RedMonk, PYPL), đó là một minh chứng mạnh mẽ để tuyên bố rằng Python có tốc độ phát triển rất nhanh, mạnh mẽ và có mặt ở khắp mọi nơi. Ban đầu, Python được phát triển để chạy trên nền Unix. Nhưng rồi theo thời gian, nó đã “bành trướng” sang mọi hệ điều hành từ MS-DOS đến Mac OS, OS\/2, Windows, Linux và các hệ điều hành khác thuộc họ Unix. Theo đánh giá của Eric S. Raymond, Python là ngôn ngữ có hình thức rất sáng sủa, cấu trúc rõ ràng, thuận tiện cho người mới học lập trình. Cấu trúc của Python còn cho phép người sử dụng viết mã lệnh với số lần gõ phím tối thiểu, như nhận định của chính Guido van Rossum trong một bài phỏng vấn ông. Bạn muốn tìm hiểu về Python, website http:\/\/pythonbooks.org\/ là địa chỉ bạn nên ghé qua dù bạn đang ở bất cứ trình độ nào. Dưới đây là link chi tiết phù hợp với trình độ của bạn: Hãy bắt đầu với Python ngay hôm nay! Bộ sưu tập này cũng khá nhiều sách hay: http:\/\/loda92.com\/category\/it\/python\/ (y) ","relevance":1},{"title":"Top 10 cuốn sách tuyệt vời nhất mọi thời đại - Vnwriter.net","url":"https:\/\/vnwriter.net\/top-10\/top-10-cuon-sach-tuyet-voi-nhat-moi-thoi-dai.html","content":"Luôn có những danh sách các bộ phim hay nhất do các nhà phê bình phim bầu chọn, vậy còn sách thì sao? Sự hay dở của một cuốn sách vốn không dựa trên thước đo nào cố định mà dựa vào cảm tính của người đọc rất nhiều. Vậy một danh sách do ai lập nên sẽ tạo có sự khách quan cao nhất? Vào năm 2007, biên tập viên sách J.Peder Zane của tờ báo Raleigh News and Observer (Thời báo Tin tức và Quan sát của Raleigh) đã nảy ra ý định lập nên một danh sách những cuốn sách hay nhất mọi thời đại, do chính các tiểu thuyết gia bình chọn. 125 tiểu thuyết gia, bao gồm cả những tên tuổi như Stephen King (nhiều giải thưởng), Annie Proulx (Núi Brokeback – đề cử Pulitzer 2000), Micheal Chabon (Cuộc phiêu lưu của Kavalier và Clay – Giải Pulitzer 2001), đã ủng hộ nhiệt tình dự án này và gửi lại câu trả lời của mình. Từ danh sách xếp hạng của mỗi người, người ta đã tính toán và lập nên danh sách được biết đến là “Top 10 của Top”. Hãy cùng xem 10 cuốn sách tuyệt phẩm của mọi tuyệt phẩm: 1. Anna Karenina (Leo Tolstoy) Cuốn sách cũng được các nhà phê bình nhận định là sự chuyển giao giữa hai thế hệ văn học, là cầu nối giữa lối viết thực tế cổ điển với văn phong hiện đại. Lối viết đào sâu vào nội tâm suy nghĩ nhân vật đã nhiều lần được các nhà văn hiện đại sử dụng lại trong các tiểu thuyết của mình. 2. Bà Bovary (Gustave Flaubert) Tiểu thuyết đứng thứ nhì của danh sách một lần nữa kể một câu chuyện tình yêu và tình nhân Pháp lãng mạn. Bà Bonvary, dù là vợ của một bác sĩ giàu có, không hề có hạnh phúc với cuộc sống nhàm chán ở nông thôn cạnh người chồng tốt bụng nhưng ngây ngô. Mang trong mình những giấc mơ lãng mạn viển vông, bà Bovary mơ tưởng đến những cuộc tình nồng cháy và nhiệt thành. Một loạt các cuộc tình vụng trộm diễn ra, và kết cục bi kịch là không thể tránh khỏi. 3. Chiến tranh và Hòa bình (Leo Tolstoy) Thêm một cuốn tiểu thuyết của nhà văn Nga Leo Tolstoy xuất hiện trong danh sách này. 5 gia đình, hơn 27 nhân vật là đại diện cho cả xã hội Nga dưới triều đại Nga Hoàng Alexander I, cuộc sống bị đảo lôn do sự xâm lăng của Napoleon. Tuy vậy, chính tác giả tự nhận cuốn sách không thể gọi là một cuốn tiểu thuyết: một số chương của cuốn sách hầu như chỉ luận bàn về triết học và không kể nhiều về cốt truyện. Đây là một trong những tiểu thuyết dài nhất từng được viết ra. 4. Lolita (Vladimir Nabokov) Cuốn sách gây nhiều tranh cãi khi mới ra đời của Vladimir Nabokov một lần nữa khẳng định vị trí của mình trong hàng ngũ những tuyệt phẩm. Câu chuyện của vị giáo sư văn học rơi vào vòng xoáy cuộc tình với một cô bé mới dậy thì đã thể hiện chiều sâu của nó, hơn chỉ là một cuốn sách gợi dục như bị lầm tưởng ban đầu. 5. Những cuộc phiêu lưu của Huckleberry Finn (Mark Twain) Xuất hiện lần đầu tiên trong vai bạn của Tom Sawyer, Huckleberry Finn trở thành một nhân vật bất hủ với thời gian trong cuốn sách duy nhất có mang tên cậu – phần thứ hai trong loạt sách kể về cuộc phiêu lưu giữa hai cậu bé. Đây cũng là tác phẩm đi đầu trong việc đưa ngôn ngữ địa phương vào văn học. Mark Twain thực sự đã phá bỏ nhiều rào cản với cuốn sách đột phá này. 6. Hamlet (Shakespeare) Khi vua cha của mình qua đời, Hamlet đang du học trở về nhà chịu tang và bất ngờ nhận ra người mẹ – hoàng hậu đã tái hôn với chú mình. Trước sự trùng hợp quá thuận lợi, anh không khỏi nghi ngờ và đau lòng từng bước chấp nhận sự thật. Anh quyết trả thù cho vua cha để lập lại công bằng. Trên hành trình của mình, anh nhiều lần bị dằn vặt bởi đạo làm con, cũng như nghi ngờ về tình yêu và tấm lòng người phụ nữ thực sự thủy chung. “To be or not to be” – Tồn tại hay không tồn tại, câu thoại ấn tượng nhất trong cuộc vật lộn dữ dội nhất của Hamlet, đã trở thành câu thoại kinh điển của nền văn học thế giới. 7. Đại gia Gatsby (F.Scott Fitzgerald) Sau gần một thế kỉ ra đời, Đại gia Gatsby đã trở thành kinh điển của văn học hiện đại Mỹ, được đưa vào tất cả các chương trình giảng dạy văn học ở các trường trung học. Giấc mơ Mỹ không có gì hơn chỉ là một màn kịch lừa đảo, đưa con người vào mê hồn trận, và rồi tàn nhẫn đẩy xuống bờ vực những con người ngây thơ tin tưởng vào “hạnh phúc mãi mãi”. 8. Đi tìm thời gian đã mất (Marcel Proust)  Bộ tiểu thuyết hiện đại 7 phần này được viết trong hơn 50 năm, được viết như một câu truyện hồi kí của nhân vật chính. Nhiều nhân vật trong tiểu thuyết được lấy hình mẫu từ chính những người quen biết của tác giả ngoài đời thật. Trên hành trình của nhân vật chính để trở thành nhà văn, truyện dẫn dắt người đọc qua những kí ức đầy sống động trong cảm giác về cuộc sống xung quanh, qua những nỗi sợ hãi và lo âu của tác giả khi dần trở nên lãnh cảm với chính những con người thân thương, qua những suy nghĩ về nghệ thuật mang ý nghĩa đời sống, và qua những cuộc tình đồng giới. Lối viết hiện thực rất chi tiết, gợi cảm của tác giả làm nhiều nhà văn phải thốt lên khao khát có được tài năng xuất chúng như vậy. 9. Truyện ngắn của Anton Chekhov Khi ông qua đời, các tác phẩm của ông một lần nữa khẳng định vị trí trong lòng nhân dân Nga: ông trở thành tác giả có tầm ảnh hưởng lớn thứ nhì chỉ sau Leo Tolstoy. Các câu chuyện và phát kiến của ông trong văn học – kịch nghệ là nguồn cảm hứng cho nhiều tác giả như Ernest Hemingway, Vladimir Nabokov hay các nghệ sĩ thế giới như Marlon Brando, Robert De Niro… 10. Middlemarch (Geogre Eliot) “Một trong những tiểu thuyết Anh quốc hiện đại thực sự được viết dành cho người lớn” – như nữ nhà văn Virginia Woofl nhận xét, ám chỉ một thời kì nền văn học Anh quốc đầy rẫy những tác phẩm lãng mạn vô ích. Một vài nhà văn đánh giá, đây là tiểu thuyết hay nhất từng được viết bằng tiếng Anh về người Anh. Phan Lê Tham gia cộng đồng mọt sách trên Fac","relevance":1},{"title":"20 quyển sách hay nhất mọi thời đại, thay đổi hàng triệu người trên thế giới","url":"http:\/\/vitalk.vn\/threads\/20-quyen-sach-hay-nhat-moi-thoi-dai-thay-doi-hang-trieu-nguoi-tren-the-gioi.2584962\/","content":"Giãn cách tên bằng dấu phẩy (,).","relevance":1},{"title":"10 cuốn sách bán chạy nhất mọi thời đại - Sách hay - Zing.vn","url":"https:\/\/news.zing.vn\/10-cuon-sach-ban-chay-nhat-moi-thoi-dai-post604075.html","content":"Đứng đầu danh sách 10 cuốn sách bán chạy nhất mọi thời đại do Wikipedia thống kê là tác phẩm \"Don Quixote\" của tác giả Miguel de Cervantes với 500 triệu bản từng được bán ra. Hoa Khang sách hay 10 cuốn sách bán chạy nhất mọi thời đại Mật mã Da Vinci Hoàng tử bé Hồng Lâu Mộng Harry Potter Chúa tể những chiếc nhẫn Don Quixote Bình luận  Dàn xe đặc chủng tập luyện bảo vệ APEC 17:06 22\/10\/2017 Thời sự 21 5656  Thanh Lam: Ngạo mạn diva, bản năng đàn bà và những phát ngôn tranh cãi 13:37 22\/10\/2017 Nhạc Việt 128 1508  Quốc hội khóa XIV làm công tác nhân sự trong tuần đầu kỳ họp thứ 4 19:00 22\/10\/2017 Thời sự 0 0  Vì sao bờ sông Sài Gòn phải cõng dày đại dự án? 18:01 22\/10\/2017 Kinh doanh 7 343  Thắng đậm Liverpool, Tottenham cân bằng điểm số với MU 21:23 22\/10\/2017 Bóng đá Anh 3 73  Đoàn Văn Hậu thử làm tiền đạo, ghi bàn đầu tiên tại V.League 22:27 22\/10\/2017 Bóng đá Việt Nam 2 840  Võ thuật điêu luyện của nữ cảnh sát cơ động chuẩn bị bảo vệ APEC 16:11 22\/10\/2017 Ảnh & Video 24 1521  Hai cô gái váy ngắn, lộ hình xăm nơi làm việc gây tranh cãi tuần qua 18:56 22\/10\/2017 Cộng đồng mạng 0 505  Messi phiên bản nhái đến sân Camp Nou cổ vũ thần tượng 16:40 22\/10\/2017 Bóng đá Tây Ban Nha 11 1146  Nông trại kiểu mẫu vắng bóng nông dân của Triều Tiên 11:44 22\/10\/2017 Du lịch 0 104 Có thể bạn quan tâm  10 cuốn sách đình đám được fan 'Harry Potter' yêu thích 14:00 18\/11\/2015 Sách hay 1 0  Lê Hoàng dùng tên Tổng thống Trump trong sách mới để gây chú ý? 07:57 22\/10\/2017 Tin tức xuất bản 1 0  Lê Hoàng dùng tên Tổng thống Trump trong sách mới để gây chú ý? 07:57 22\/10\/2017 Tin tức xuất bản 1 0  Lê Hoàng dùng tên Tổng thống Trump trong sách mới để gây chú ý? 07:57 22\/10\/2017 Tin tức xuất bản 1 0  Auto Huy Hoàng và hành trình 10 năm chở hạnh phúc lứa đôi 10:00 21\/10\/2017 Thông tin doanh nghiệp 0 0  Như Minh Tú Beauty Center mang đến giải pháp làm đẹp toàn diện 09:00 21\/10\/2017 Thông tin doanh nghiệp 0 0  Thương hiệu rượu vang Việt phục vụ APEC 2017 17:00 20\/10\/2017 Thông tin doanh nghiệp 0 0  4 chương trình khuyến mãi hấp dẫn dịp 20\/10 từ Shopee 12:00 20\/10\/2017 Thông tin doanh nghiệp 0 0  Hồ Ngọc Hà mang 'Cả một trời thương nhớ' lên sân khấu Lavie En Rose 11:00 20\/10\/2017 Thông tin doanh nghiệp 0 0  Gia Lai sắp khai trương siêu thị Co.opmart thứ hai tại Chư Sê 10:00 20\/10\/2017 Thông tin doanh nghiệp 0 0  Phát triển nhanh, Bách hóa Xanh tuyển hàng trăm nhân viên mỗi tháng 10:00 20\/10\/2017 Thông tin doanh nghiệp 0 0  Điện máy Xanh đặt mục tiêu bán 4 triệu mặt hàng gia dụng mỗi tháng 09:00 20\/10\/2017 Thông tin doanh nghiệp 0 0  Thăm vườn hồng, làng phù thủy ấn tượng tại AEON Mall Bình Dương Canary 19:00 19\/10\/2017 Thông tin doanh nghiệp 0 0  Điều gì giúp gắn kết gia đình trong thời công nghệ số? 14:00 19\/10\/2017 Thông tin doanh nghiệp 0 0  Luis Sepúlveda và khúc ca đầy kiêu hãnh của một chú chó săn 09:00 21\/10\/2017 Sách hay 0 43  Cẩm nang dành cho người ôn luyện đề thi năng lực tiếng Hàn 17:00 20\/10\/2017 Sách hay 0 2  Có đau cũng phải đẹp và 'tình' 15:00 20\/10\/2017 Sách hay 0 0  Đánh thức sức mạnh tiềm ẩn của lòng biết ơn 11:00 20\/10\/2017 Sách hay 0 184  Bước ngoặt thay đổi cuộc đời bạn 16:00 19\/10\/2017 Sách hay 1 0  'Bến xe' - minh chứng cho một tình yêu bất diệt 09:00 19\/10\/2017 Sách hay 0 0  Có một tình yêu mang tên 'Hạ đỏ' 16:00 18\/10\/2017 Sách hay 3 0  'Hãy tiến lên, đi, khám phá, tận hưởng và yêu cuộc sống...' 09:05 18\/10\/2017 Sách hay 1 0  Cuốn sách giúp bạn giải đáp câu hỏi lớn nhất của cuộc đời 07:58 18\/10\/2017 Sách hay 2 0  ‘Chuyến đi bão táp’ của Uber 16:26 16\/10\/2017 Sách hay 0 0 Quảng cáo Giấy phép báo điện tử số: 236\/GP-BTTTT. Tổng Biên tập: Ngô Việt Anh Cơ quan chủ quản: Hội Xuất bản Việt Nam. Tòa soạn: D29 Trần Thái Tông, Cầu Giấy, Hà Nội. Chỉ được phát hành lại thông tin từ website này khi có sự đồng ý bằng văn bản của báo.","relevance":1},{"title":"Top 10 cuốn sách hay nhất mọi thời đại | Sách hay 2014 2015","url":"https:\/\/kenhtuyensinh.vn\/top-10-cuon-sach-hay-nhat-moi-thoi-dai","content":"© Kenhtuyensinh.vn is completely powered by the Kenh Cong Ltd., ® Kenhtuyensinh.vn giữ bản quyền nội dung trên website này. 10:30 AM 11\/08\/2014 Sách là viên ngọc tri thức của nhân loại và có ảnh hưởng rất lớn tới cuộc sống con người. Nhờ đọc được những cuốn sách hay mà người ta có thể thay đổi cách sống, cải thiện tinh thần và có những định hướng đúng đắn cho sự nghiệp. Dưới đây là 10 cuốn sách hay nhất mọi thời đại đã mang lại động lực sống mạnh mẽ cho nhiều người. Đắc Nhân Tâm là nghệ thuật thu phục lòng người, là làm cho tất cả mọi người yêu mến mình. Đắc nhân tâm và cái Tài trong mỗi người chúng ta. Đắc Nhân Tâm trong ý nghĩa đó cần được thụ đắc bằng sự hiểu rõ bản thân, thành thật với chính mình, hiểu biết và quan tâm đến những người xung quanh để nhìn ra và khơi gợi những tiềm năng ẩn khuất nơi họ, giúp họ phát triển lên một tầm cao mới. Đây chính là nghệ thuật cao nhất về con người và chính là ý nghĩa sâu sắc nhất đúc kết từ những nguyên tắc vàng của Dale Carnegie.  Từ khi “Đắc nhân tâm” đến tay độc giả, nó đã khiến người đọc nhận ra rằng họ có thể tiết chế được các mối quan hệ trong và ngoại lề công việc, và trên thực tế thì hai mối quan hệ ấy không bao giờ tách rời nhau. Câu trích hay nhất trong cuốn sách này đó là: “Có một sự thật là tất cả những người bạn gặp đều tự cảm thấy họ hơn bạn theo một cách nào đấy, và con đường thẳng dẫn tới trái tim họ là để họ nhận ra rằng bạn công nhận tầm quan trọng của họ, và sự ghi nhận đó là chân thành”. Cách nghĩ để thành công là cuốn sách đầu tiên đưa ra triết lý thành đạt - một triết lý đầy đủ và toàn diện về thành công của cá nhân, đồng thời cung cấp cho bạn phương pháp để tạo ra kế hoạch sơ bộ và chi tiết để đạt được thành công đó. Được viết ra từ vô số những câu chuyện có thật của những người vĩ đại như Edison - nhà phát minh lỗi lạcmà thời gian rèn luyện trong trường học chỉ... vỏn vẹn 3 tháng, như Henry Ford - người bị coi là không có học vấn nhưng đã trở thành ông trùm trong nền công nghiệp xe hơi với một gia tài kết xù..., tác phẩm có một sức thuyết phục và lay động rất lớn,. Napoleon Hill đã dành hầu như toàn bộ thời gian và công sức trong suốt gần ba mươi năm để phỏng vấn hơn 500 người nổi tiếng và thành công nhất trong nhiều lĩnh vực khác nhau, cùng hàng ngàn doanh nhân khác - cả những kẻ thất bại và những người thành công. Với hơn 60 triệu bản đã được bán trong 70 năm kể từ khi ra đời, những đúc kết về thành công của Napoleon Hill đến nay vẫn không hề bị lỗi thời, ngược lại, thời gian chính là minh chứng sống động cho tính đúng đắn của những bí quyết mà ông chia sẻ. Câu trích hay nhất của cuốn sách này đó là: “Những đột phá cần có trong cuộc đời đang nằm trong chính trí tưởng tượng của bạn. Trí tưởng tượng là xưởng máy trong đầu bạn, có thể biến năng lượng tư duy thành thành tựu và của cải”. Tác giả Steven Covey đã vẽ nên tấm bản đồ hướng đi cho cuộc sống và đưa nó vào trang sách để giúp người đọc không chỉ hình thành những thói quen sinh hoạt hợp lý mà còn giúp họ trở thành người tốt, sống có ích hơn. Câu trích hay nhất trong cuốn sách này là: “gieo mầm suy nghĩ sẽ gặt hái hành vi, gieo mầm hành vi sẽ gặt hái thói quen, gieo mầm thói quen sẽ gặt hái tính cách, gieo mầm tính cách sẽ gặt hái số phận”. Cuộc Sống Không Giới Hạn - Nick Vujic- Câu Chuyện Diệu Kỳ Của Chàng Trai Đặc Biệt Nhất Hành Tinh“. \"Bạn đẹp đẽ và quý giá hơn tất cả những viên kim cương trên thế gian này. Dẫu vậy, chúng ta nên luôn luôn đặt ra cho mình mục tiêu trở thành những con người tốt hơn, toàn thiện hơn, đẩy lùi và loại bỏ những giới hạn bằng cách mơ những giấc mơ lớn lao. Trong hành trình đó, chúng ta luôn cần có những điều chỉnh (bởi vì cuộc đời này không phải lúc nào cũng toàn là màu hồng), nhưng cuộc đời này luôn đáng sống. Tôi đến đây để nói với bạn rằng cho dù bạn đang ở trong hoàn cảnh nào, miễn là bạn còn thở, thì bạn vẫn có thể đóng góp cho cuộc đời này…” Hành trình về phương đông” là một phần trong bộ hồi ký nổi tiếng của giáo sư Blair T. Spalding (1857 – 1953). Cuốn sách kể chuyện một đoàn khoa học gồm các chuyên môn khác nhau Hội Khoa học Hoàng gia Anh (tức Viện Hàn lâm Khoa học) cử sang Ấn Độ nghiên cứu về “huyền học”. Sau hai năm trời lang thang khắp các đền chùa Ấn Độ, chứng kiến nhiều cảnh mê tín dị đoan, thậm chí “làm tiền” du khách, của nhiều pháp sư, đạo sĩ rởm, họ được tiếp xúc với những vị chân tu sống ẩn danh ở thành phố hay trên rặng Tuyết Sơn. Nhờ thế, họ được chứng kiến, hiểu biết đúng đắn về các khoa học cổ xưa và bí truyền của văn hóa Ấn Độ như yoga, thuật chiêm tinh, các phép dưỡng sinh và chữa bệnh, quan niệm về cõi sống và cõi chết. “Mọi vật trong vũ trụ đều quân bình tuyệt đối, không dư, không thiếu, từ hạt bụi bé nhỏ đến những dãy thiên hà vĩ đại. Đời người quá ngắn, và luôn bị lôi cuốn vào sinh hoạt quay cuồng. Đâu mấy ai ý thức được sự phung phí hôm nay, dọn đường cho sự đau khổ ngày mai. Tất cả chỉ là những ảo ảnh chập chờn, thế mà người ta cứ coi như thật. Nếu biết thức tỉnh quan sát, ta có thể học hỏi biết bao điều hay. Tiếc rằng khi đắc thời người ta quên đi quá khứ rất nhanh. Chỉ trong đau khổ, nhục nhã ê chề mới chịu học. Có thể đó cũng là lý do luôn luôn có các biến động vô thường, thúc dục con người học hỏi.” Những trang sách trong cuốn sách Người giàu có nhất thành Babylon sẽ đưa chúng ta trở lại vương quốc Babylon cổ đại, cái nôi nuôi dưỡng những nguyên lý cơ bản về tài chính mà giờ đây con người hiện đại đã kế thừa và vận dụng trên toàn thế giới. Cuốn sách nói về những thành công, những thành quả đạt được của từng cá nhân sống trong thành Babylon cổ đại. Từ đó, giúp mọi người hiểu rõ hơn về vấn đề tài chính và cống hiến c","relevance":1},{"title":"Top 10 Cuốn Sách Tuyệt Vời Nhất Mọi Thời Đại","url":"http:\/\/ybox.vn\/gia-vi\/top-10-cuon-sach-tuyet-voi-nhat-moi-thoi-dai-zjzqhuazgp","content":"Kênh thông tin chất lượng cao của sinh viên & giới trẻ Việt Nam  Luôn có những danh sách các bộ phim hay nhất do các nhà phê bình phim bầu chọn, vậy còn sách thì sao? Sự hay dở của một cuốn sách vốn không dựa trên thước đo nào cố định mà dựa vào cảm tính của người đọc rất nhiều. Vậy một danh sách do ai lập nên sẽ tạo có sự khách quan cao nhất? Vào năm 2007, biên tập viên sách J.Peder Zane của tờ báo Raleigh News and Observer (Thời báo Tin tức và Quan sát của Raleigh) đã nảy ra ý định lập nên một danh sách những cuốn sách hay nhất mọi thời đại, do chính các tiểu thuyết gia bình chọn. 125 tiểu thuyết gia, bao gồm cả những tên tuổi như Stephen King (nhiều giải thưởng), Annie Proulx (Núi Brokeback – đề cử Pulitzer 2000), Micheal Chabon (Cuộc phiêu lưu của Kavalier và Clay – Giải Pulitzer 2001), đã ủng hộ nhiệt tình dự án này và gửi lại câu trả lời của mình. Từ danh sách xếp hạng của mỗi người, người ta đã tính toán và lập nên danh sách được biết đến là “Top 10 của Top”. Hãy cùng xem 10 cuốn sách tuyệt phẩm của mọi tuyệt phẩm: 1. Anna Karenina (Leo Tolstoy)  Đứng đầu các tuyệt phẩm, cuốn sách hay nhất mọi thời đại chính là cuốn tiểu thuyết kinh điển của nhà triết học, nhà văn Nga Leo Tolstoy. Được mệnh danh là cuốn sách “không một khuyết điểm” bởi Dostoyevsky (tác giả Thép đã tôi thế đấy), Anna Karenina kể song song hai chuyện tình. Cùng có một khởi đầu là phải đấu tranh để được ở bên nhau, một cặp đôi lại dần rơi vào ngờ vực và chia cách, còn một cặp đôi vượt qua được những thử thách của cuộc sống chung. Câu chuyện của Anna Karenina khám phá những chủ đề khác nhau của cuộc sống lứa đôi, từ khát khao, đam mê đến dối trá, lọc lừa, đến tin tưởng, thực tế và hạnh phúc. Cuốn sách cũng được các nhà phê bình nhận định là sự chuyển giao giữa hai thế hệ văn học, là cầu nối giữa lối viết thực tế cổ điển với văn phong hiện đại. Lối viết đào sâu vào nội tâm suy nghĩ nhân vật đã nhiều lần được các nhà văn hiện đại sử dụng lại trong các tiểu thuyết của mình. 2. Bà Bovary (Gustave Flaubert) Tiểu thuyết đứng thứ nhì của danh sách một lần nữa kể một câu chuyện tình yêu và tình nhân Pháp lãng mạn. Bà Bonvary, dù là vợ của một bác sĩ giàu có, không hề có hạnh phúc với cuộc sống nhàm chán ở nông thôn cạnh người chồng tốt bụng nhưng ngây ngô. Mang trong mình những giấc mơ lãng mạn viển vông, bà Bovary mơ tưởng đến những cuộc tình nồng cháy và nhiệt thành. Một loạt các cuộc tình vụng trộm diễn ra, và kết cục bi kịch là không thể tránh khỏi. Tác phẩm Bà Bovary của Gustave Flaubert. Tuy cốt truyện không có gì phức tạp, vẻ đẹp thật sự của Bà Bovary ẩn giấu trong những chi tiết ngầm. Dù bà Bovary đã phạm vào những quy tắc đạo đức, nhưng ông Bovary cũng muôn đời chìm trong ảo tưởng, “thần thánh hóa” người vợ của mình, để rồi không kịp nhận ra những khát khao trần thế của bà. Văn phong “đẹp như thơ”, ngôn từ hoàn hảo và chuẩn xác của một tác giả cầu toàn đã tạo cho Bà Bovary một vị trí bất di bất dịch trong lòng những người đọc. 3. Chiến tranh và Hòa bình (Leo Tolstoy) Thêm một cuốn tiểu thuyết của nhà văn Nga Leo Tolstoy xuất hiện trong danh sách này. 5 gia đình, hơn 27 nhân vật là đại diện cho cả xã hội Nga dưới triều đại Nga Hoàng Alexander I, cuộc sống bị đảo lôn do sự xâm lăng của Napoleon. Tuy vậy, chính tác giả tự nhận cuốn sách không thể gọi là một cuốn tiểu thuyết: một số chương của cuốn sách hầu như chỉ luận bàn về triết học và không kể nhiều về cốt truyện.  Vào thời kì mới xuất bản, các nhà phê bình và nhà báo thậm chí không biết nên xếp cuốn sách vào thể loại nào: một tiểu thuyết văn học hay một tiểu thuyết lịch sử. Những cảnh chiến trận được miêu tả với sự thực tế đến mức gay gắt, trong khi câu chuyện lại chuyện hướng ngữ điệu hoàn toàn khác biệt. Có lẽ sự kết hợp của cả hai thể loại là điều đã tạo nên sự vĩ đại của cuốn sách. Đây là một trong những tiểu thuyết dài nhất từng được viết ra. 4. Lolita (Vladimir Nabokov) Cuốn sách gây nhiều tranh cãi khi mới ra đời của Vladimir Nabokov một lần nữa khẳng định vị trí của mình trong hàng ngũ những tuyệt phẩm. Câu chuyện của vị giáo sư văn học rơi vào vòng xoáy cuộc tình với một cô bé mới dậy thì đã thể hiện chiều sâu của nó, hơn chỉ là một cuốn sách gợi dục như bị lầm tưởng ban đầu.  Humbert cũng chỉ là một trong số vô vàn những người đàn ông bị thúc đẩy bởi khát khao của chính mình, trong khi Lolita chỉ xuất hiện trong lời kể lại của Humbert, không bao giờ được nhìn nhận như một con người đúng nghĩa. Chính vì vậy mà cô luôn xuất hiện rất mỉa mai, châm biếm. Cô mãi mãi là một người tình trong mơ của Humbert. 5. Những cuộc phiêu lưu của Huckleberry Finn (Mark Twain) Xuất hiện lần đầu tiên trong vai bạn của Tom Sawyer, Huckleberry Finn trở thành một nhân vật bất hủ với thời gian trong cuốn sách duy nhất có mang tên cậu – phần thứ hai trong loạt sách kể về cuộc phiêu lưu giữa hai cậu bé.  Tuy gặp phải nhiều phản ứng từ các phía do sự nhạy cảm của cốt truyện, không thể phủ nhận Mark Twain đã tạo ra kiệt tác “một câu chuyện về những cậu bé dành cho người lớn”: nhân vật sống động, ngây thơ trong sự trăn trở đạo đức về những hành vi bất công do tình trạng phân biệt chủng tộc với người da đen thời bấy giờ ở miền Nam nước Mỹ. Cuối cùng, Huckleberry Finn đã lựa chọn tình bạn, vượt ra khỏi khuôn khổ giáo điều bất công của xã hội. Đây cũng là tác phẩm đi đầu trong việc đưa ngôn ngữ địa phương vào văn học. Mark Twain thực sự đã phá bỏ nhiều rào cản với cuốn sách đột phá này. 6. Hamlet (Shakespeare)  Vì đâu vở kịch của Shakespeare về một vị hoàng tử trả thù cho cha lại trở thành kiệt tác của thế giới? Hamlet, ra đời trong khoảng những năm 1600, kể lại sự trăn trở và đấu tranh mạnh mẽ ","relevance":1},{"title":"Top 7 quyển sách hay về thành công - Downloadsach.com","url":"https:\/\/downloadsach.com\/top-10\/sach-hay-ve-thanh-cong.html","content":"Sách hay về thành công là nguồn cảm hứng cho những ai đang tìm kiếm con đường đi đến đỉnh cao và chinh phúc khát khao ước vọng của mình. Đọc sách là cách hiệu quả nhất để bạn trau dồi kiến thức mới cũng như học hỏi kinh nghiệm những người đã và đang thành công. Xem thêm :  ♦  3 quyển sách bạn nên đọc lại nhiều lần trong đời  ♦  Top 10 cuốn sách có thể thay đổi cuộc đời bạn  ♦  Top 7 sách hay về sức khỏe   Bạn đã biết Jack Canfield qua series Chicken Soup For The Soul với những câu chuyện truyền cảm hứng và ý nghĩa sâu sắc trong cuộc sống. Ông được biết đến với những triết lý sâu sác và thông thái mà bạn đọc sẽ tình cờ phát hiện đâu đó trong chính cuộc sống của mình. Quyển Những Nguyên Tắc Thành công tổng hợp 64 nguyên tắc cơ bản nhất và được sắp xếp một cách logic và tiếp nối với nhau tạo nên một cuốn sách tuyệt vời để bạn có thể học hỏi và áp dụng. Đây là quyển sách dành cho những ai muốn thay đổi bản thân mình và đạt được thành công mà mình theo đuổi. Với những nguyên tắc từ cuốn sách bạn sẽ có “kim chỉ nam thành công” tăng cường lòng tự tin, sẵn sàng vượt qua thử thách khó khăn, sống bằng tất cả niềm đam mê, và chinh phục khát vọng. Những nguyên tắc không hề mang tính lý thuyết mà nó tổng hợp đâu đó trong cuộc đời của chúng ta. Chính điều đó mang lại giá trị thực tiễn cho quyển sách.   2. Cách nghĩ để thành công Quyển sách được truyền cảm hứng bới nhà tư sản nổi tiếng của đất nước cờ hoa chính là Andrew Carnegie. Ông được gọi là ông vua của ngành thép, người đã khởi nguồn và tạo cảm hứng cho hàng triệu thế hệ sau tiếp nối và tạo nên thành công. Và theo tác giả Napoleon Hill thì “Cách nghĩ để thành công là cuốn sách viết về bí quyết thành công của Andrew Carnegi”. Quyển sách nhấn mạnh mấu chốt của thành công nằm ở cách nghĩ khác biệt và đột phá của những con người sinh ra để thay đổi thế giới. Và chính Napoleon Hill đã thành công  khi áp dụng và có được khối tài sản khổng lồ và ông đã truyền bá những bí quyết kinh nghiệm đó đến với chúng ta. Nếu bạn mang trong mình khát khao cháy bỏng kiếm tìm thành công thì đây chính là cuốn sách dành cho bạn. Hãy tìm nguồn cảm hứng vô tận từ những bài học, kinh nghiệm từ chính cuộc đời của Andrew Carnegie cũng như những câu chuyện thành công khác của những người đi lên từ tay trắng, dù cuộc đời họ có lúc chạm đáy khi khó khăn nhưng họ đã tìm được thành công bằng “cách nghĩ để thành công”.   3. Kẻ thành công phải biết lắng nghe Để trở thành một người thành công bạn phải hội tụ rất nhiều yếu tố cần thiết như tài năng, đam mê, khát vọng, một ý chí kiên cường và quan trọng không thể thiếu chính là kỹ năng giao tiếp. Có rất nhiều phương pháp giao tiếp hiệu quả nhưng Mark Goulston với quyển Kẻ thành công phải biết lắng nghe đã mang đến một nghệ thuật giao tiếp bằng cách lắng nghe. Đối với ông, lắng nghe phải bằng tất cả nội tâm mình để thật sự tìm hiểu vấn đề vấn đề cốt yếu để đi đến thành công trong giao tiếp. Một khi bạn là một người biết lắng nghe, bạn sẽ có thể dễ dàng giải quyết những mâu thuẫn trong cuộc sống cũng như tiếp cận được những con người tài giỏi mà sẽ giúp bạn trong công việc để đạt được thành công.   4. Phụ nữ tuổi 20 thay đổi để thành công  Thành công ngày nay không chỉ đến với đàn ông mà những người phụ nữ trong thế kỉ mới đã khẳng định vị thế và tầm quan trọng của mình trên thế giới. Như thủ tướng Đức Angela Merkel, người phụ nữ với tinh thần thép dẫn đắt quốc gia châu Âu hùng mạnh. Hay nữ CEO Marissa Mayer đang chèo lái con thuyền Yahoo trong sóng gió của sự thay đổi ồ ạt trong lĩnh vực công nghệ. Và còn rất nhiều những câu chuyện thành công khác nữa về phụ nữ ngày nay. Tuổi 20 được xem là độ tuổi đẹp nhất khi chúng ta có được sức khỏe, nhiệt huyết và khát khao cháy bỏng khẳng định mình. Bạn có thời gian để phạm sai lầm, nhưng điều quan trọng bạn phải biết thay đổi và học hỏi để tiếp tục tiến lên. Luôn học hỏi và trưởng thành, hãy tin tưởng vào bản thân mình và xây dựng tương lai vững chắc bằng thực lực. Đây thật sự là quyển sách đầy cảm hứng dành cho những phụ nữ đã và đang trên con đường tìm kiếm thành công. Họ sẽ cân bằng cán cân quyền lực và thành công, khẳng định mạnh mẽ họ có thể làm được những điều to lớn. Hãy thay đổi bản thân để thành công và tạo ra bước ngoặt trong cuộc sống, sự nghiệp của mình với quyển sách Phụ nữ tuổi 20 thay đổi để thành công. 5. Bánh răng khởi nghiệp – Đường đến thành công Những năm gần đây, phong trào Khởi nghiệp đang phát triển mạnh mẽ trong cộng đồng kinh doanh Việt Nam đặc biệt là các bạn trẻ muốn tự phát triên con đường kinh doanh của mình. Bạn có thể dễ dàng đọc những câu chuyện khởi nghiệp thành công trong và ngoài nước. Hàng loạt hội nhóm, cộng đồng khởi nghiệp được thành lập, những hội thảo được mở ra về khởi nghiệp thu hút không kém sự tham gia và chú ý của giới trẻ. Nhưng nhiều người không nhận thức được ý nghĩa thật sự của khởi nghiệp và vẫn chưa có cái nhìn chính xác về con đường khởi nghiệp. Đằng sau những thành công rực rỡ về khởi nghiệp là con đường trải hoa hồng trong đó có màu hồng cũng như những “cái gai” mà bạn sẽ gặp phải. Làm thế nào để phát triển một ý tưởng mới hoặc cải thiện một hệ thống đã có để tạo nên một doanh nghiệp khởi nghiệp. Bạn có thể tìm thấy được câu trả lời trong cuốn sách Bánh Răng Khởi Nghiệp – Đường Đến Thành Công. Cuốn sách cung cấp những giải pháp để bạn có thể quyết định những ý tưởng nào đáng để làm và mang về hiệu quả thiết thực nhất để đột phá trong kinh doanh   6. Bản đồ thành công Cuốn sách là tổng hợp con đường và cách thức thành công của những tập đoàn lớn trên thế giới. Bản đồ thành công hoàn toàn thực tiễn dù bạn đang là sinh viên hay một nhân viên và ngay cả","relevance":1},{"title":"10 Cuốn sách cuộc đời bạn phải đọc","url":"http:\/\/langmaster.edu.vn\/10-cuon-sach-giup-ban-phat-trien-ban-than-a56i636.html","content":"","relevance":0},{"title":"18 cuốn sách nên đọc sẽ thay đổi cuộc đời bạn","url":"http:\/\/tslethamduong.com\/-c\/18-cuon-sach-nen-doc-thay-doi-cuoc-doi-ban-p65.html","content":"❝3 năm sau bạn sẽ thay đổi như thế nào phụ thuộc vào những người bạn gặp, những cuốn sách bạn đọc và những nơi bạn đi qua.❞ - Khuyết Danh Sau đây là Top 16 cuốn sách chúng tôi sưu tầm, chúng tôi cho rằng nó sẽ thay đổi cuộc sống bạn. Sách là thức ăn nuôi dưỡng tinh thần, hãy cho não mình ăn mỗi ngày ít nhất 30 phút nhé.   1 - Khuyến học - Fukuzawa Yukichi  Khi mới đựơc in lần đầu, cuốn sách này có một số lượng ấn bản kỷ lục là 3,4 triệu bản, trong khi dân số Nhật Bản thời đó chỉ khoảng ba mươi lăm triệu người. Chỉ riêng điều đó đã cho thấy đây thực sự là cuốn sách gối đầu giường của mọi người dân Nhật trong thời kỳ Duy Tân. Kể từ năm 1942 đến năm 2000, riêng nhà xuất bản Iwanami Bunko cũng đã tái bản đến bảy mươi sáu lần. 2 - Đi tìm lẽ sống   Người đi tìm lẽ sống của Viktor Frankl là một trong những quyển sách kinh điển của thời đại. Thông thường, nếu một quyển sách chỉ có một đoạn văn, một ý tưởng có sức mạnh thay đổi cuộc sống của một người, thì chỉ riêng điều đó cũng đã đủ để chúng ta đọc đi đọc lại và dành cho nó một chỗ trên kệ sách của mình. Quyển sách này có nhiều đoạn văn như thế. 3 - Nhà giả kim   Cuốn tiểu thuyết được viết bằng tiếng Bồ Đào Nha, được dịch sang 56 ngôn ngữ, bán được hơn 65 triệu bản tại hơn 150 nước. Đây là một trong những cuốn sách bán chạy nhất trong mọi thời đại. 4 - 13 Nguyên Tắc Nghĩ Giàu Làm Giàu  Cuốn sách kinh điển của Napoleon Hill, nó được chọn làm sách gối đầu giường của rất nhiều người thành công trên thế giới. Là một trong những cuốn sách được Đặng Lê Nguyên Vũ tặng miễn phí cho các bạn trẻ Việt Nam. 5 - 7 Thói Quen Người Thành Đạt  Cuốn sách vẫn luôn là một trong những cây đại thụ của chủ đề “Phát Triển Bản Thân”. Sống theo 7 thói quen Stephen đề cập là một cuộc đấu tranh không ngừng nghỉ bởi khi bạn càng tiến bộ thì bản chất các thách thức bạn gặp cũng phải thay đổi. 6 - 21 Nguyên Tắc Tự Do Tài Chính  Cuốn sách sẽ cung cấp cho bạn những phương pháp để bạn có thể trở thành triệu phú, cho dù bạn là ai và có xuất phát điểm như thế nào. Bạn sẽ học được cách xác lập mục tiêu, lên kế hoạch và tổ chức hành động để đạt được mục tiêu tài chính như bạn muốn. 7 - Bí Mật Tư Duy Triệu Phú - T Harv Eker  Phân tích thói quen tư duy, hành động dẫn tới những kết quả về tiền bạc. Bí Mật Tư Duy Triệu Phú sẽ giúp bạn định hướng suy nghĩ, hành động giống như người giàu qua 17 điều khác biệt giữa người giàu và người nghèo. 8 - Đánh Thức Con Người Phi Thường Trong Bạn - Anthony Robbins   Anthony Robbins là một trong những diễn giả, chuyên gia đào tạo bậc thầy thế giới. Trong 3 thập kỷ đào tạo của ông, ông chỉ viết 2 cuốn sách và đó cũng là 2 cuốn có tầm ảnh hưởng rất lớn trong lĩnh vực khám phá và phát triển bản thân. Cuốn sách là một trợ thủ đắc lực, hỗ trợ bạn phát huy tối đa tiềm năng của mình và “người khổng lồ” bên trong bạn nhất định sẽ được đánh thức. 9 - Ba Người Thầy Vĩ Đại  Ba Người Thầy Vĩ Đại là một tác phẩm hư cấu. Đây là câu chuyện về một người đàn ông tên Jack Valentine, anh lên kế hoạch tìm kiếm tri thức để có một cuộc sống hạnh phúc hơn, tuyệt vời hơn. 10 - Bảy Chiến Lược Thịnh Vượng Và Hạnh Phúc - Jim Rohn   Jim Rohn được mệnh danh là diễn giả của những diễn giả. Ông là một bậc thầy sử dụng ngôn từ. Những ý tưởng là Jim Rohn chia sẻ trong cuốn sách sẽ là những góc nhìn và quan niệm rất mới về cuộc sống và thành công. 11 - Dạy Con Làm Giàu   Tài chính là một phần quan trọng trong cuộc sống. Khi còn trẻ, bạn càng có hiểu biết sớm về tài chính, bạn càng có lợi thế hơn khi về già. Bạn sẽ làm gì khi được cả hai người cha truyền dạy cho mình về chủ đề tiền bạc và sự chọn lựa cách sống trong đời? 12 - Sức mạnh của toàn tâm toàn ý  Trong cuốn sách vừa được tạp chí New York Times bình chọn là sách bán chạy nhất, Jim Loehr và Tony Schwartzđã chứng minh rằng không phải quản trị thời gian mà chính quản trị năng lượng mới là then chốt để duy trì cả hiệu suất cao lẫn sức khỏe, hạnh phúc và cân bằng cuộc sống. 13 -  Đối thoại với Thượng đế - Neale Donald Walsch   Với tôi, Đối Thoại Với Thượng Đế thật sự hay và ý nghĩa. Tôi bắt gặp quyển sách này trong lúc đang cảm thấy bế tắc với cuộc sống và những mối quan hệ xung quanh và bị ấn tượng bởi lời giới thiệu có vẻ rất hấp dẫn, dù thú thật là lúc đó tôi cũng chẳng tin rằng nó thật sự thần kỳ như thế. Nhưng khi mua về và đọc những trang đầu tiên thì tôi mới nhận ra rằng thật không ngoa khi nói rằng “quyển sách này có “quyền năng” thay đổi nhận thức và cuộc đời bạn”.   14 - Đắc Nhân Tâm   Tác phẩm có sức lan toả vô cùng rộng lớn - dù  bạn đi đến bất cứ đâu, bất kỳ quốc gia nào cũng đều có thể nhìn thấy. Tác phẩm được đánh giá là cuốn sách đầu tiên và hay nhất trong thể loại này, có ảnh hưởng thay đổi cuộc đời đối với hàng triệu người trên thế giới. 15 - Chiến thắng con quỷ trong bạn  Có một con quỷ trong mỗi chúng ta, nó ẩn láu, nó kiểm soát tâm trí và luôn tìm cách đánh gục chúng ta. Đọc cuốn sách sẽ như thể bạn đang nói chuyện với chính mình, cũng có lúc bạn sẽ tự hỏi “Con Qủy cso thật hay chỉ là một sản phẩm của trí tưởng tượng?” 16 - Hướng nghiệp cùng MBTI   MBTI (Myers-Briggs Type Indication) là một công cụ dùng để định vị và phát triển năng lực cá nhân được sử dụng phổ biến ở nhiều tập đoàn và các quốc gia trên thế giới, đặc biệt là các công ty thuộc nhóm 500 công ty hàng đầu của Mỹ (Fortune 500). Hàng năm trên thế giới có hàng triệu người sử dụng công cụ này để xác định tính cách đặc trưng của mình và những người xung quanh từ đó định hướng để phát triển tối đa tiềm năng của mình để có một cuộc sống thành công và hạnh phúc hơn. 17 -  Quẳng gánh lo đi và vui sống  Quẳng Gánh Lo Đi Và Vui Sống khuyên bạn những cách để giảm thi","relevance":0},{"title":"10 cuốn sách về khởi nghiệp nên đọc nếu bạn muốn thành công - Tiin","url":"https:\/\/www.baomoi.com\/10-cuon-sach-ve-khoi-nghiep-nen-doc-neu-ban-muon-thanh-cong\/c\/21544795.epi","content":"Tiin 15\/02\/2017 08:01 GMT+7 Timothy Ferriss Guy Kawasaki Charles Schwab Think And Grow Rich Napoleon Hill ADAM KHOO Citibank Quản Lý Nhân Sự Kawasaki Đầu Tư Mạo Hiểm Khởi Nghiệp IBM Cách Tiếp Cận Microsoft Thành Công Thành Đạt Tuyển Dụng Sa Thải Bắt Nguồn Thị Trường Chứng Khoán Tài Trợ 1. The art of the start (Khởi Thuật) - Guy Kawasaki  Đây được xem cuốn cẩm nang, một ngọn lửa thôi thúc các bạn trẻ hành động và hành động đúng đắn khi khởi nghiệp. Khởi thuật sẽ cung cấp cho bạn khái niệm GIST - Great Ideas for Starting Things - 'Những Ý Tưởng Lớn Để Bắt Đầu Mọi Việc', những bước đi then chốt, cần thiết trong việc tung ra các sản phẩm, dịch vụ. Không chỉ vậy, cuốn sách còn chỉ cho các nhà quản lý khơi dậy khả năng tư duy, tinh thần trách nhiệm trong kinh doanh và óc sáng tạo thông qua cách giải quyết tình huống mà khi bắt đầu việc gì bất cứ ai cũng gặp phải. 2. Start run & grow a successful small business - Tookit Media Group  Nếu bạn đang tìm kiếm một 'kim chỉ nam' dẫn đường giúp mình xây dựng một doanh nghiệp nhỏ thì chắc chắn cuốn sách này là sự lựa chọn hàng đầu đối với bạn. Cuốn sách đưa ra đầy đủ các quy luật và quy định thiết yêu cần thiết cho việc khởi nghiệp, đưa ra tầm nhìn đầy tiềm năng, lập kế hoạch tài chính cho đến phương pháp quản lý nhân sự phù hợp bao gồm tiền lương, phúc lợi, tuyển dụng và sa thải. Kawasaki xũng cung cấp những thông tin vàng giúp công ty của bạn có thể được chú ý bởi các doanh nghiệp lớn bên ngoài. 3. The startup game (Cuộc chơi khởi nghiệp) - William Henry Draper III  Đầu tư mạo hiểm đã không còn là một thuật ngữ quá mới mẻ ở Việt Nam trong vòng một thập kỷ qua. Tuy nhiên, điều vẫn còn bí ẩn với rất nhiều doanh nhân là làm thế nào để một công ty khởi nghiệp lọt được vào mắt xanh của những nhà đầu tư đầy kinh nghiệm? 'Cuộc chơi khởi nghiệp' (The Start-up Game) chính là cuốn sách giúp ta lý giải được những điều đó. Điểm đặc biệt của cuốn sách ngoài thể hiện ở cách mà tác giả phân tích các yêu tố để giúp khởi nghiệp thành công thông qua hai yếu tố: con người và sản phẩm của mô hình kinh doanh. Ngoài ra khi đọc cuốn sách bạn sẽ không hề bị nhàm chán vì bên cạnh những lý thuyết suông, tác giả còn đưa ra như câu chuyên, bài học trong quá trình khởi nghiệp của mình. 4. The 4 hour workweek - Tuần làm việc 4 giờ - Timothy Ferriss  'Tuần làm việc 4 giờ' sẽ tạo ra niềm vui, động lực, nguồn cảm hứng cho những ai đọc nó khi chỉ ra những vấn đề trong suy nghĩ cũng như cách sống của bạn, từ đó đưa ra lời khuyên đúng đắn về việc thay đổi nhận thức, thái độ sống. Tuy chỉ vỏn vẹn hơn 100 trang giấy nhưng cuốn sách chắc chắn sẽ cung cấp những nguồn thông tin hữu ích về cách để xây dựng một doanh nghiệp online, duy trì hoạt động thành công trên trang web. Và nếu bạn còn băn khoăn về việc làm sao để từ làm việc 14 giờ\/ngày và kiếm 40.000 đô la\/năm thành làm việc 4 giờ\/tuần và kiếm 40.000 đô la\/tháng thì cuốn sách này sẽ là lựa chọn thông minh đấy! 5. Rework (Khác biệt để bứt phá) - Jason Fried & David Hansson  'Bạn đừng làm theo luật của người khác, đừng để 'luật' của đối thủ chi phối. Hãy tạo ra 'pháp luật' của mình để chiến thắng bất cứ khách hàng, đối thủ, sân chơi nào'. Đó là câu nói đã trở nên nổi tiếng mà chính tác giả của cuốn sách này viết ra - Jason Fried. Đây thực sự là một cuốn sách kinh tế rất mới lạ khi nó không đưa ra những công thức kinh doanh khô khan, cứng nhắc mà chỉ cho bạn những 'mánh khóe' kinh doanh, những phương pháp mới lạ kiểu như 'Ít hơn là tốt' hay 'Họp hành là độc dược'. Dễ đọc, dễ hiểu và dễ làm theo, 'Khác biệt để bứt phá' quả thực là điểm đến tuyệt vời cho những ai đang mong muốn khởi nghiệp bằng chính đôi tay và sức lực của mình. 6. Think and Grow rich (Nghĩ giàu và làm giàu) - Napoleon Hill  Đây có thể xem là cuốn sách gối đầu kinh điển của rất nhiều doanh nhân thành đạt trên thế giới khi nó là nơi duy nhất cung cấp đầy đủ các nguồn lực mà bạn phải có để khởi nghiệp thành công. Những ý tưởng trong cuốn sách 'Think and Grow rich' bắt nguồn từ những động lực tốt đẹp: 'Thành công cá nhân' và 'Quan điểm suy nghĩ tích cực', khiến bạn sẽ sớm phát hiện ra một số nguyên tắc làm giàu đúng đắn, giúp tiết kiệm được thời gian cho cuộc sống đồng thời biết tập trung khai thác những điểm mạnh mà mình sẵn có. 7. Bí quyết tay trắng thành triệu phú - Adam Khoo  Chắc hẳn chúng ta không còn xa lạ gì với chuỗi những cuốn sách nổi tiếng của Adam Khoo như 'Tôi tài giỏi, bạn cũng thế, Bí quyết thành công dành cho tuổi teen hay làm chủ tư duy thay đổi vận mệnh'… Với cuốn sách lần này, bằng cách tiếp cận thiết thực, toàn diện và hiệu quả, tác giả sẽ chứng minh cho bạn thấy sự linh hoạt và hiệu quả trong quản lý tiền bạc, huy động vốn, làm thế nào để đạt mức lợi nhuận 12,08% từ thị trường chứng khoán với mức rủi ro cực thấp. Từ đó nó giúp hoạch định, thiết kế con đường làm giàu nhanh cho những ai muốn thành công. 8. Đạt kết quả tối đa từ những gì bạn có - Jay Abraham  Cuốn sách này của Jay Abraham đã giúp cho hàng trăm doanh nghiệp phát triển, trong đó có các tập đoàn lớn như IBM, Microsoft, Citibank và Charles Schwab. Bằng kiến thức uyên thâm và kinh nghiệm của mình, ông đã đúc kết đầy đủ những chiến lược hữu ích giúp cải thiện công việc, hoạt động kinh doanh và trong bất kỳ lĩnh vực không chỉ bằng lý thuyết mà còn qua những ví dụ minh chứng cụ thể, sinh động. Jay cho biết được mọi thứ tạo nên thành công đều rất đơn giản nếu ta thực sự cố gắng và mong muốn. Và nếu bạn đang ấp ủ một giấc mơ start - up thành công thì hãy tìm đến cuốn sách này, nó sẽ cho bạn nhiều lời khuyên hay ho đấy. 9. Khởi nghiệp với 100 USD - Chris Guillebeau.  Khi bắt đầu suy nghĩ giống như môt doanh nhâ","relevance":0}]}]}